[
    {
        "title": "que peut faire la STM contre les solliciteurs dans le métro",
        "score": 2,
        "id": "1gsbp36",
        "url": "https://www.reddit.com/r/montreal/comments/1gsbp36/que_peut_faire_la_stm_contre_les_solliciteurs/",
        "created_utc": 1731718740.0,
        "num_comments": 2,
        "selftext": "Je veux préciser que je ne parle pas du tout des sans-abris, la situation est complétement différente.\n\nDans plusieurs stations de métro il y a de plus en plus de ces \"solliciteurs\" qui t'invitent à signer des pétitions, donner de l'argent pour leur collecte, t'inscrire à leurs services, etc.  Au début je restais pour la conversation par politesse mais ils sont rendus vraiment insupportables. J'étais à Saint-Michel, au téléphone en train de marcher vite, et cet homme me suit sur plusieurs mètres en disant \"madame une minute s'il vous plaît madame!\". Cette même situation arrive à plusieurs reprises dans plusieurs stations différentes, Édouard-Montpetit, McGill, Guy-Concordia pour ma part.  Franchement j'en n'ai rien à faire de leurs campagnes mais à un moment c'est insupportable. Lorsque je devais rencontrer une amie, elle m'a vue de loin et a commencé à s'approcher vers moi. Une dame se met entre nous deux pour nous parler de sa campagne et même si on lui qu'on n'est pas intéressées, elle roule des yeux et lâche une insulte par frustration. J'en reviens juste pas de l'audace en fait ? C'est clairement eux qui dérangent les gens alors pourquoi cette attitude ? Je ne pense pas que la STM puisse faire grand chose contre ça donc j'imagine ce post est plus une *rant* qu'autre chose",
        "author": "loudefsoul"
    },
    {
        "title": "What is the worst Metro stop in the city?",
        "score": 0,
        "id": "1gsbbdz",
        "url": "https://www.reddit.com/r/montreal/comments/1gsbbdz/what_is_the_worst_metro_stop_in_the_city/",
        "created_utc": 1731717579.0,
        "num_comments": 20,
        "selftext": "I've been to every one of them at one point or another but I was thinking to myself today, which is the worst of the worst?",
        "author": "Ill-Pattern-4022"
    },
    {
        "title": "Recommendation for less touristy neighborhood to stay?",
        "score": 0,
        "id": "1gsb1vi",
        "url": "https://www.reddit.com/r/montreal/comments/1gsb1vi/recommendation_for_less_touristy_neighborhood_to/",
        "created_utc": 1731716785.0,
        "num_comments": 6,
        "selftext": "Hello, \n\nMy girlfriend and i are doing a trip to montreal / quebec city over american thanksgiving. \n\nWe land in montreal monday and are staying in old town montreal one night before going to quebec city. \n\nwhen we come back we will have another 2 nights in montreal. i am looking for recommendations of good neighborhoods to stay in that maybe are more local or less touristy? maybe an area that's artsy, has good walkable food options/activities, and where young people live? for comparison maybe something you would consider like the brooklyn of montreal?\n\nThank you!\n\n ",
        "author": "ayayeron"
    },
    {
        "title": "neopets birthday bash ",
        "score": 1,
        "id": "1gsazt2",
        "url": "https://www.reddit.com/r/montreal/comments/1gsazt2/neopets_birthday_bash/",
        "created_utc": 1731716604.0,
        "num_comments": 0,
        "selftext": "coucou, j'aurais beaucoup aimé être présente lors du birthday bash de Neopets à Mtl, mais je suis de Québec. Est-ce quelqu'un pourrait me donner le code pour avoir le goodie bag svp hihi",
        "author": "petit-moineau"
    },
    {
        "title": "Street signs in Montreal",
        "score": 0,
        "id": "1gsa1dz",
        "url": "https://www.reddit.com/r/montreal/comments/1gsa1dz/street_signs_in_montreal/",
        "created_utc": 1731713790.0,
        "num_comments": 6,
        "selftext": "Hey all,\n\nI was thinking about the sizes of street signs (the ones with the names of the roads) in Montreal. They're pretty small, and normally they're only in one of the four corners at each intersection. I imagine it would be easy to miss what street you were on if you were driving into the city from out of town (or just going to a part of the island you were unfamiliar with). So I just had a few questions about them.\n\n\\- When were the current street signs made? \n\n\\- Is there a historical reason for the size of the street signs and why there is only one at each intersection?\n\n\\- How do drivers keep track of what street they're on? Do people just rely on GPS/map apps, or do they memorize locations/track landmarks? Or do drivers here just have really good eyesight? \n\n\\- Do you think existing street signs should be updated to be easier for drivers to read (whether that's by putting more of them at intersections, or making them larger)?",
        "author": "C_elegans_6"
    },
    {
        "title": "Fusée dans le ciel?",
        "score": 1,
        "id": "1gs9l8d",
        "url": "https://i.redd.it/cbk44lzee51e1.jpeg",
        "created_utc": 1731712524.0,
        "num_comments": 9,
        "selftext": "J'ai vu ça passer il y a 5 min. Comme une fusée.",
        "author": "Kaiser_soze_MTL"
    },
    {
        "title": "Why are the SAQ liquor labels upside down?",
        "score": 34,
        "id": "1gs8ots",
        "url": "https://www.reddit.com/gallery/1gs8ots",
        "created_utc": 1731710015.0,
        "num_comments": 56,
        "selftext": "Saw the liquor labels upside down at an SAQ in Montreal. Thought I was trippin', but maybe it’s part of the strike? Anyone else notice this?",
        "author": "Ok_Manner_1565"
    },
    {
        "title": "Stewart’s soda",
        "score": 1,
        "id": "1gs888j",
        "url": "https://www.reddit.com/r/montreal/comments/1gs888j/stewarts_soda/",
        "created_utc": 1731708769.0,
        "num_comments": 5,
        "selftext": "\nDoes anyone know where i can get the Stewart’s root beer drink? Been craving it for months but cant find it anywhere! ",
        "author": "88peachfuz"
    },
    {
        "title": "Tonight’s Full Moon rising through the Olympic Stadium",
        "score": 150,
        "id": "1gs7y54",
        "url": "https://i.redd.it/3fwvm3f0151e1.jpeg",
        "created_utc": 1731708014.0,
        "num_comments": 5,
        "selftext": "",
        "author": "trevorkjorlien"
    },
    {
        "title": "Sociétés de transport | Déficit d’opération ou déficit de vision ?",
        "score": 0,
        "id": "1gs7tsj",
        "url": "https://www.lapresse.ca/dialogue/opinions/2024-11-14/societes-de-transport/deficit-d-operation-ou-deficit-de-vision.php",
        "created_utc": 1731707694.0,
        "num_comments": 1,
        "selftext": "",
        "author": "clgoh"
    },
    {
        "title": "Enjoy the night",
        "score": 33,
        "id": "1gs7638",
        "url": "https://www.reddit.com/gallery/1gs7638",
        "created_utc": 1731705978.0,
        "num_comments": 3,
        "selftext": "From the airport guy and gals . ",
        "author": "jemhadar0"
    },
    {
        "title": "Anything similar to Erico from Quebec City in MTL?",
        "score": 0,
        "id": "1gs65lt",
        "url": "https://www.reddit.com/r/montreal/comments/1gs65lt/anything_similar_to_erico_from_quebec_city_in_mtl/",
        "created_utc": 1731703272.0,
        "num_comments": 1,
        "selftext": "I have been to Juliette et Chocolate (numerous times!!!), but was wondering if there was something I *need* to try but haven't yet in. Erico in QC if anyone has been, is a chocolatier which somehow has the cheapest brownies I've ever had... and maybe the best.\n\nAnything similar to that here?",
        "author": "riz7242"
    },
    {
        "title": "Looking for recs for New Year’s Eve! ",
        "score": 0,
        "id": "1gs5khl",
        "url": "https://www.reddit.com/r/montreal/comments/1gs5khl/looking_for_recs_for_new_years_eve/",
        "created_utc": 1731701707.0,
        "num_comments": 1,
        "selftext": "Hey guys, I recently moved to Montreal for work and am pretty unfamiliar with the city. I’m looking for a bar/restaurant for New Year’s Eve to bring my significant other but I’m having trouble finding what I want. We’re in our mid 20s, looking for a cocktail bar (that serves food) that will turn more lively late night, preferably with a dj and some kind of dance floor. Not looking for actual nightclubs so much or if so something smaller/more intimate. \n\nIf anyone has any suggestions please let me know! ",
        "author": "Strict-Lobster-6860"
    },
    {
        "title": "Les livreurs Amazon qui s'invitent chez les gens, ça va?",
        "score": 28,
        "id": "1gs56ag",
        "url": "https://www.reddit.com/r/montreal/comments/1gs56ag/les_livreurs_amazon_qui_sinvitent_chez_les_gens/",
        "created_utc": 1731700650.0,
        "num_comments": 37,
        "selftext": "Un peu de contexte: j'habite un haut de duplex, les deux apparts ont leurs propres portes sur rue, donc c'est pas une situation ou y'a une entrée commune. C'est assez évident, y'a les deux portes une à côté de l'autre avec leur propre adresse.\n\n99.99% du temps je garde la porte barrée parce que, pour une raison qui m'échappe, les livreurs tentent TOUJOURS d'ouvrir la porte avant de sonner. Ben aujourd'hui c'était la fois ou j'avais pas la porte barrée car une amie venait tout juste de quitter et j'étais pas encore descendu barrer.\n\nBen esti, le gars rentre, monte les marches pas gêné, et a pas l'air surpris du tout de voir qu'il... est entré chez quelqu'un? Y'a tu quelque chose que j'ai pas compris?\n\nLes livreurs ont-ils l'habitude de tester la porte chez vous, oubedon même de juste rentrer pour le fun de même?  \n  \nLa prochaine fois je vais lui offrir un café.",
        "author": "Roflcubes"
    },
    {
        "title": "Les véhicules avec vignette de stationnement mais pas plaquées : de kossé?",
        "score": 0,
        "id": "1gs4ksa",
        "url": "https://www.reddit.com/r/montreal/comments/1gs4ksa/les_véhicules_avec_vignette_de_stationnement_mais/",
        "created_utc": 1731699077.0,
        "num_comments": 20,
        "selftext": "Le titre essentiellement.\n\nAussi : désolée si j'ai pas choisi le flair le plus approprié.\n\nDernièrement je vois plusieurs véhicules de ce type dans le Mile-End (là c'était à Du Parc/St-Viateur, comme l'indique l'enseigne de l'épicerie) qui ont une vignette de stationnement mais dont la plaque minéralogique est remplacée par un nom de compagnie de location, donc : pas de numéro de plaque. Me semble que quand on va acheter une vignette à l'arrondissement, ça prend toutes sortes d'infos, dont la plaque? \n\nEt aussi, pourquoi une compagnie de location devrait bénéficier d'espaces sur rue? Me semble que j'ai jamais vu ça pour d'autres, genre Entreprise qui n'est pas loin sur St-Laurent; eux font chier en masse à barouetter leurs chars dans la ruelle derrière, mais ils ne mangent pas d'espaces de stationnement réservés aux vignettes.\n\nMerci pour vos lumières.\n\nhttps://preview.redd.it/661zhxp0a41e1.jpg?width=1519&amp;format=pjpg&amp;auto=webp&amp;s=a0d7e147ce011756456be371d0258cdf1e854822\n\n",
        "author": "Critical_Try_3129"
    },
    {
        "title": "What are jobs that don't need a highschool diploma (smt other than cashier)",
        "score": 0,
        "id": "1gs4c4r",
        "url": "https://www.reddit.com/r/montreal/comments/1gs4c4r/what_are_jobs_that_dont_need_a_highschool_diploma/",
        "created_utc": 1731698450.0,
        "num_comments": 5,
        "selftext": "Other than the obvious jobs that highschoolers tend to work in, what are some jobs in Québec that don't need a highschool diploma and at most need some kind of certification ou peut-être une formation à courte durée? ",
        "author": "bitxhimtrying"
    },
    {
        "title": "Des trous dans la salle de bain?",
        "score": 0,
        "id": "1gs48ve",
        "url": "https://www.reddit.com/gallery/1gs48ve",
        "created_utc": 1731698212.0,
        "num_comments": 10,
        "selftext": "Quelqu'un a vu ça? C'est des bibites ou la mousse peut être? Je pense que c'est très recent, mais je suis pas sûr.",
        "author": "AnotherMillionYears"
    },
    {
        "title": "Cheap eats?",
        "score": 0,
        "id": "1gs3si7",
        "url": "https://www.reddit.com/r/montreal/comments/1gs3si7/cheap_eats/",
        "created_utc": 1731697083.0,
        "num_comments": 36,
        "selftext": "Coming for a game Dec 12th! Looking for cheap eats. I'm not picky (at all)! Google hasn't been the most helpful.\n\nETA: I'll be around for 3 days. It doesn't matter if places are close to the bell centre! ",
        "author": "NorthStatus7776"
    },
    {
        "title": "Question metro st michel",
        "score": 0,
        "id": "1gs3jh0",
        "url": "https://www.reddit.com/r/montreal/comments/1gs3jh0/question_metro_st_michel/",
        "created_utc": 1731696424.0,
        "num_comments": 10,
        "selftext": "Hello . Quick question. Do someone know what's the name of the company who repare the metro st michel? Like the maintenance? I'm interested to be part of the equipe. Thank you",
        "author": "itsmee_effy"
    },
    {
        "title": "Live sketches in Montreal bars, cafes etc",
        "score": 214,
        "id": "1gs3cq1",
        "url": "https://www.reddit.com/gallery/1gs3cq1",
        "created_utc": 1731695934.0,
        "num_comments": 12,
        "selftext": "These sketches are part of the drawing series that were done live around Montreal’s bars, coffee shops etc. I used a brush pen and markers on 9x12 toned paper",
        "author": "alex_kasyan_artist"
    },
    {
        "title": "Anyone go to the Place Forest shopping centre?",
        "score": 0,
        "id": "1gs2zn7",
        "url": "https://www.reddit.com/r/montreal/comments/1gs2zn7/anyone_go_to_the_place_forest_shopping_centre/",
        "created_utc": 1731695009.0,
        "num_comments": 1,
        "selftext": "[https://www.costar.com/article/158546270/shared/howard-szalavetz-acquires-place-forest-shopping-centre-in-montreal-north](https://www.costar.com/article/158546270/shared/howard-szalavetz-acquires-place-forest-shopping-centre-in-montreal-north)",
        "author": "CREFAN"
    },
    {
        "title": "Votre expérience avec les cardiologues de Santa-Cabrini",
        "score": 0,
        "id": "1gs2y3u",
        "url": "https://www.reddit.com/r/montreal/comments/1gs2y3u/votre_expérience_avec_les_cardiologues_de/",
        "created_utc": 1731694899.0,
        "num_comments": 1,
        "selftext": "Salut, petite question un peu niche chez ceux qui ont fréquentés ou qui ont des proches qui ont fréquentés  le pavillon de cardio de Santa-Cabrini, quelle est votre expérience avec les spécialistes? ",
        "author": "TerribleElevator9879"
    },
    {
        "title": "Montreal &lt;3",
        "score": 238,
        "id": "1gs2vfb",
        "url": "https://i.redd.it/p96nbc8gx31e1.jpeg",
        "created_utc": 1731694708.0,
        "num_comments": 17,
        "selftext": "",
        "author": "PtolomeoCesar"
    },
    {
        "title": "Montreal free euthanasia for cats?",
        "score": 0,
        "id": "1gs25c9",
        "url": "https://www.reddit.com/r/montreal/comments/1gs25c9/montreal_free_euthanasia_for_cats/",
        "created_utc": 1731692908.0,
        "num_comments": 13,
        "selftext": "I take in a cat with the previous owner not revealing she has behavior issues and I cannot take care of it. I get woken up several times at night I cannot sleep anymore. The spca in my region asks me 160$ to surender the cat. No one on kijiji or my acquaintances wants it even for free.\n\nI heard that most stray cats do not survive one year outside. I would rather have her put down so she doesn't freeze to death. Does anyone know a free or low cost euthanasia service in Montreal so my cat can die without suffering?\n\n**UPDATE:** Despite the unhelpful comments I received, I want to say thank you to the kind redditor who reached out to offer to adopt my cat.",
        "author": "samuelazers"
    },
    {
        "title": "This is a long shot. ",
        "score": 0,
        "id": "1gs1dmk",
        "url": "https://www.reddit.com/r/montreal/comments/1gs1dmk/this_is_a_long_shot/",
        "created_utc": 1731690964.0,
        "num_comments": 5,
        "selftext": "Hey guys I’ll keep this short and sweet. \n\nI’m the biggest Ovechkin fan (not as much as I love the Habs of course but he is my favorite athlete of all time), and i’m going to the Habs Vs. Capitals game on December 7th. I have always dreamt of meeting him or at least having him sign my jersey for me to put up on my wall. \n\nI was wondering if anyone had any insider information on where I can find him/see him when he comes to Montreal to play the Canadiens?\n\nIf anyone could hook me up with any information it would make my dream come true. \n\nThank you!!!",
        "author": "PocketFullaPringles"
    },
    {
        "title": "REM Testing Spotted at Bois-Franc Station",
        "score": 60,
        "id": "1gs16rk",
        "url": "https://i.redd.it/aobog50vk31e1.jpeg",
        "created_utc": 1731690476.0,
        "num_comments": 10,
        "selftext": "H",
        "author": "Midas_1000"
    },
    {
        "title": "Course chez Projet Montréal : La succession de Valérie Plante sera connue en mars",
        "score": 36,
        "id": "1gs15r3",
        "url": "https://www.lapresse.ca/actualites/grand-montreal/2024-11-15/course-chez-projet-montreal/la-succession-de-valerie-plante-sera-connue-en-mars.php",
        "created_utc": 1731690408.0,
        "num_comments": 11,
        "selftext": "",
        "author": "Academic-Comparison3"
    },
    {
        "title": "Guitar and Music Shops",
        "score": 0,
        "id": "1gs120s",
        "url": "https://www.reddit.com/r/montreal/comments/1gs120s/guitar_and_music_shops/",
        "created_utc": 1731690156.0,
        "num_comments": 4,
        "selftext": "Hi,\n\nI've visiting Montreal for 10 days at the end of the month.\n\nCould anyone reccommend any good guitar and music shops I should visit while I'm there. \n\nI'd prefer guitar shops with more vintage and 2nd hand stock (less interested in new stock, big brand name stores)\n\nI was looking forward to visiting Sound Central, but I think they are still looking for a new space.\n\nAny other reccommendations for fun things to see would be appreciated. \n\nThanks\n",
        "author": "Dscaife11"
    },
    {
        "title": "Valerie Plante is leaving and I have thoughts...",
        "score": 0,
        "id": "1gs0sgd",
        "url": "https://www.reddit.com/r/montreal/comments/1gs0sgd/valerie_plante_is_leaving_and_i_have_thoughts/",
        "created_utc": 1731689492.0,
        "num_comments": 43,
        "selftext": "[Valérie Plante has decided she can't keep doing her job](https://www.lapresse.ca/actualites/grand-montreal/2024-11-15/course-chez-projet-montreal/la-succession-de-valerie-plante-sera-connue-en-mars.php). Which is understandable. Being a public servant is not an easy job.\n\nI just feel quite angry because she (OK not her in particular) but her team is leaving a mess of a city. Sure they improved the \"look\" of the city in many regards but housing, [homelessness](https://www.lapresse.ca/dialogue/opinions/2024-11-14/notre-malaise-face-a-l-itinerance.php), garbage, city works, traffic, taxes, public transportation plus the fact that water pipes are bursting, etc.. are out of control.\n\n I find it quite cowardly to leave NOW. And there is no opposition, it seems there is no one who has a vision lest the courage to take the lead. Montreal feels sad and abandoned right now. ",
        "author": "JoMarching"
    },
    {
        "title": "À qui donner ses manteaux d'hiver",
        "score": 7,
        "id": "1gs0nl4",
        "url": "https://www.reddit.com/r/montreal/comments/1gs0nl4/à_qui_donner_ses_manteaux_dhiver/",
        "created_utc": 1731689149.0,
        "num_comments": 20,
        "selftext": "Nous avons beaucoup de vêtements d'hiver en bonne condition à donner pour tous âges. Normalement, on les laisserait au Renaissance, mais est-ce qu'il y a mieux pour s'assurer qu'ils serviront à du monde en vrai besoin?",
        "author": "Pokermuffin"
    },
    {
        "title": "La fraude dans les bus/métros et la qualité de service de la STM",
        "score": 27,
        "id": "1grziox",
        "url": "https://www.reddit.com/r/montreal/comments/1grziox/la_fraude_dans_les_busmétros_et_la_qualité_de/",
        "created_utc": 1731686251.0,
        "num_comments": 65,
        "selftext": "Je m’excuse d’avance pour cette publication assez négative. Je suis un Montréalais né ici, vécu toute ma vie jusqu’à récemment où j’ai déménagé à l’étranger. Je suis de retour à Montréal pour une courte durée et j’ai été forcé de constater la détérioration du service de la STM. Wagons sales, consommation d’alcool/drogues visible, bus en retard (c’est pas nouveau), saleté, des types chelous qui m’observent dans le métro. J’ai l’impression que le service a dégringolé en qualité pendant l’année et demi que j’ai quitté la ville. Aussi, il semble que plusieurs personnes ne paient simplement pas leur titre de transport, c’est devenu la norme de rentrer dans un bus sans rien scanner ni payer? Ce n’était pas comme ça de mémoire, du moins pas à ce point là.",
        "author": "krissdebanane"
    },
    {
        "title": "An exercise in community | Meet the eclectic group of fitness fanatics who are putting their differences aside in the shared pursuit of physical prowess",
        "score": 15,
        "id": "1grz40b",
        "url": "https://www.theglobeandmail.com/canada/article-montreal-outdoor-gym-community-underexposed/",
        "created_utc": 1731685168.0,
        "num_comments": 4,
        "selftext": "",
        "author": "Hrmbee"
    },
    {
        "title": "Moving abroad ",
        "score": 0,
        "id": "1grycya",
        "url": "https://www.reddit.com/r/montreal/comments/1grycya/moving_abroad/",
        "created_utc": 1731683143.0,
        "num_comments": 14,
        "selftext": "Hi all, I’m an Australian. Practically cousins.. \n\nIf I was wanting to move to Montreal for work in construction, is there any recommendations on where or which companies would be willing to take me on? Experience is not an issue, obviously it’s the whole visa process and application. So yeah, would really appreciate some help here. Thanks in advance 🫶🏻 \n\nP.s. I’m learning French ",
        "author": "Upbeat_Sweet_8719"
    },
    {
        "title": "How long do you expect to stay at a restaurant for a 3-4 course menu?",
        "score": 0,
        "id": "1grxho4",
        "url": "https://www.reddit.com/r/montreal/comments/1grxho4/how_long_do_you_expect_to_stay_at_a_restaurant/",
        "created_utc": 1731680698.0,
        "num_comments": 17,
        "selftext": "With MTLàTABLE happening right now, I’ve noticed that in the few experiences I’ve had so far, I’ve spent around 2 to 2.5 hours at each restaurant.\n\nI’m wondering if that’s the usual amount of time people spend, or if I’m just losing patience more quickly than most. Is that time frame typical, or am I not alone in feeling that it’s a bit long?",
        "author": "ddcv6"
    },
    {
        "title": "Un agent accusé d’avoir fracturé le crâne d’un homme sans-abri",
        "score": 82,
        "id": "1grxgpc",
        "url": "https://www.lapresse.ca/actualites/justice-et-faits-divers/2024-11-15/spvm/un-agent-accuse-d-avoir-fracture-le-crane-d-un-homme-sans-abri.php",
        "created_utc": 1731680617.0,
        "num_comments": 61,
        "selftext": "",
        "author": "goronmask"
    },
    {
        "title": "Collège Sainte-Anne",
        "score": 0,
        "id": "1grwvqq",
        "url": "https://www.reddit.com/r/montreal/comments/1grwvqq/collège_sainteanne/",
        "created_utc": 1731678917.0,
        "num_comments": 1,
        "selftext": "on est à la recherche d'ancien.nes élèves du Collège Sainte-Anne. On aimerait vous parler des examens du ministère! écrivez-moi!",
        "author": "Aliyahh2002"
    },
    {
        "title": "Vegan restaurants for tonight? ",
        "score": 0,
        "id": "1grwuw7",
        "url": "https://www.reddit.com/r/montreal/comments/1grwuw7/vegan_restaurants_for_tonight/",
        "created_utc": 1731678846.0,
        "num_comments": 9,
        "selftext": "Hi, any recommendations for nice restaurants for tonight that are vegan or vegan options? Thanks so much ",
        "author": "ohlawdyshecomin"
    },
    {
        "title": "Pq le Canada a choisi le maudit Castor?",
        "score": 0,
        "id": "1grwugf",
        "url": "https://www.reddit.com/r/montreal/comments/1grwugf/pq_le_canada_a_choisi_le_maudit_castor/",
        "created_utc": 1731678808.0,
        "num_comments": 25,
        "selftext": "Donc je suis dans ma maison oui? Et j'attend que le mall ouvre (C 4 heure du matin), et je me demand \"pq le castor\" pq avons nous choisi un gros rat marron de 40kg quand on pouvait choisir un Bison ou un Lion des montagne? Mais NOOOOON! Bien sur qu'il faut choisir le putain qui invade ma maison chaque hiver.",
        "author": "CrAzYIDKKK"
    },
    {
        "title": "Pour les fans de musique qui brasse un peu. Le 6 décembre à l'Esco! Destruction Derby, Subsun et Scorbut",
        "score": 10,
        "id": "1grvw6b",
        "url": "https://v.redd.it/cu1m8uqgd21e1",
        "created_utc": 1731675881.0,
        "num_comments": 0,
        "selftext": "Pour ceux qui aiment le rock lourd, le stoner rock, le doom et autres dérivés, c'est le 6 décembre à l'Esco!\n\nBillets: https://lepointdevente.com/billets/dderby-subsun-scorbut\n\nÉvènement Facebook: https://www.facebook.com/share/1As88gyQU3/",
        "author": "Mastodon8919"
    },
    {
        "title": "Bar to watch Jake paul vs Mike Tyson tonight?",
        "score": 0,
        "id": "1grupgk",
        "url": "https://www.reddit.com/r/montreal/comments/1grupgk/bar_to_watch_jake_paul_vs_mike_tyson_tonight/",
        "created_utc": 1731671785.0,
        "num_comments": 7,
        "selftext": "you guys know of any bar here in montreal where we can enjoy the weekend and watch Tyson kick the sh!t out of that paul kid? thank you 🙏",
        "author": "Extension_Tomorrow88"
    },
    {
        "title": "Vendredi Libre | Freedom Friday - November 15",
        "score": 2,
        "id": "1grt1wo",
        "url": "https://www.reddit.com/r/montreal/comments/1grt1wo/vendredi_libre_freedom_friday_november_15/",
        "created_utc": 1731664845.0,
        "num_comments": 6,
        "selftext": "#VENDREDIS LIBRES\n\nQu'avez-vous fait de bon cette semaine? Des plans pour la fin de semaine? Qu'est-ce qui trotte dans votre tête?\n\nVous êtes à l'endroit idéal pour parler de tout et de rien - que ce soit relié à Montréal ou non!\n\n💡 Les mégapoteaux **VENDREDI LIBRE** sont exempts de la règle #1\n\n_Respectez toujours les autres règles de la communauté et les règles de Reddit_\n\n&amp;nbsp;\n\n---\n\n#FREEDOM FRIDAYS\n\nWhat have you been up to this week? Any plans for the weekend? What are your thoughts?\n\nYou're in the perfect place to discuss anything and everything - whether related to Montreal or not!\n\n💡 The **FREEDOM FRIDAY** megathreads are **free** from rule #1.\n\n_All other rules still apply - follow the other community rules and the Reddit rules._",
        "author": "AutoModerator"
    },
    {
        "title": "PQ leads in Quebec voting intentions as CAQ loses more support: poll",
        "score": 178,
        "id": "1grpr79",
        "url": "https://montreal.ctvnews.ca/pq-leads-in-quebec-voting-intentions-as-caq-loses-more-support-poll-1.7108292",
        "created_utc": 1731650315.0,
        "num_comments": 159,
        "selftext": "I don’t live in Montreal or Quebec (Ontarian that’s interested in Quebec politics lol) but for the people that do live there and have ground reality experience, why do you think the Leagult Government is losing support?",
        "author": "Yute-101"
    },
    {
        "title": "Une voiture bloque ma voiture et appelle un agent de stationnement ",
        "score": 153,
        "id": "1grpoia",
        "url": "https://www.reddit.com/r/montreal/comments/1grpoia/une_voiture_bloque_ma_voiture_et_appelle_un_agent/",
        "created_utc": 1731650008.0,
        "num_comments": 127,
        "selftext": "Bonjour,\nJ’ai besoin de conseil pour savoir quoi faire de mon problème… j’avais immobiliser ma voiture pour pouvoir allaiter mon bébé en pleur dans un stationnement sur la rue st-laurent coin clark c’est collé à l’immeuble 99 rue chabanel. Et là y a un monsieur en auto qui vient en vitesse me bloquer mon auto pour m’empêcher de sortir. Il m’a retenue prisonnière et m’a seulement dit que je n’avais pas d’affaire à être là. Ensuite il sort de son auto et me dit qu’il revient dans 15 minutes… pour me faire chier… un geste complètement méchant et ensuite quand il retourne dans sa voiture il fait des appels… et là une voiture d’agent de stationnement viens dans le stationnement et me donne un ticket de 91$ qu’elle a déjà préparer d’avance et me le met sur la voiture alors que moi j’étais au téléphone avec la police pour porter plainte contre le monsieur qui me bloqué. Donc le monsieur a fait exprès de me retenir pour me condamner à payer une amende et le problème c’est que la madame voit de ses yeux que le monsieur m’a bloqué volontairement et ne me donne aucune explication de mon constat. Je sais qu’ils sont complices dans cet acte. J’ai filmé la scène et j’aimerais avoir des conseils sur ce que je peut faire contre cette injustice.\n* il s’agit d’un ticket de la ville de Montréal\n\nMerci beaucoup! ",
        "author": "Strong_Aide_9502"
    },
    {
        "title": "What’s the best/worst spa experience you’ve had in Montreal? ",
        "score": 0,
        "id": "1gro92c",
        "url": "https://www.reddit.com/r/montreal/comments/1gro92c/whats_the_bestworst_spa_experience_youve_had_in/",
        "created_utc": 1731644822.0,
        "num_comments": 4,
        "selftext": "Ok actual parameters: I have some pretty big injuries so I’m limited to somewhere very easily accessible by metro or downtown, and affordable. I’m pretty simple - I just want a sauna and dimmer lighting than a gym for my birthday. \n\nAlso curious if a particular spa has special perks. \nALTERNATIVELY: anywhere with a good promotion.  ",
        "author": "zzbay"
    },
    {
        "title": "Quel est le juste prix pour une douche ? ",
        "score": 3,
        "id": "1gro83z",
        "url": "https://www.reddit.com/r/montreal/comments/1gro83z/quel_est_le_juste_prix_pour_une_douche/",
        "created_utc": 1731644732.0,
        "num_comments": 19,
        "selftext": "Voici votre texte corrigé et reformulé :\n\nBonjour,\n\nJe suis actuellement à la recherche d’une entreprise pour rénover ma douche. Elle est assez classique : un bac céramique de 45”x45”, trois murs carrelés et une porte en plastique. Nous souhaitons tout changer : remplacer les carreaux par des modèles plus grands, installer un bac plus fin et une porte en verre.\n\nNous allons bientôt recevoir des visites pour des devis, mais on nous demande souvent quel est notre budget. Je ne comprends pas trop la question, car pour moi, il y a un juste prix entre les matériaux, les heures de travail, l’évacuation des déchets, etc.\n\nAuriez-vous une idée du coût moyen pour une rénovation de ce type afin que nous puissions avoir un ordre d’idée ?\n\nMerci beaucoup ☺️ \n PS : Prix avec facture, en tout l’égalité ! ",
        "author": "Eboline"
    },
    {
        "title": "Dating Culture?",
        "score": 0,
        "id": "1grnv62",
        "url": "https://www.reddit.com/r/montreal/comments/1grnv62/dating_culture/",
        "created_utc": 1731643521.0,
        "num_comments": 37,
        "selftext": "A guy I’m dating (whose from Montreal) told me about dating culture in Montreal, saying it’s very feminist and men don’t offer to pay because that would be insulting to women. Is that true or bullshit??",
        "author": "DoctorStunning"
    },
    {
        "title": "Vandalisme dans un petit parc en construction - Décourageant! (Coin Beaubien/Boyer, Petite-Patrie)",
        "score": 60,
        "id": "1grnscc",
        "url": "https://i.redd.it/ydh8wlp7oz0e1.jpeg",
        "created_utc": 1731643259.0,
        "num_comments": 53,
        "selftext": "",
        "author": "TheMountainIII"
    },
    {
        "title": "All cops are dicks (a rant and a question)",
        "score": 63,
        "id": "1grnfyd",
        "url": "https://www.reddit.com/r/montreal/comments/1grnfyd/all_cops_are_dicks_a_rant_and_a_question/",
        "created_utc": 1731642084.0,
        "num_comments": 134,
        "selftext": "I was minding my own business driving to work, when the lane I was on stalled after going on very slowly for a couple of minutes. I changed lanes (to the left) and drove a couple of meters to the red light.\n\nOne of the police officers controlling the lights knocks on my window, visibly angry. I am a very calm and polite guy, I wasn't in a hurry or anything (I never am).\n\nI open the window and greet him \"bonjour monsieur\". He goes, very angrily \"c'était quoi ça, monsieur?\"\n\"Uh... Pardon, monsieur, je ne comprends pas. C'est quoi le problème?\"\n\"J'ai vous demandé c'était quoi ça?\"\n\"Oui, j'ai compris la question mais je comprends pas le problème. Est-ce que j'ai fait de l'erreur ou quelque chose?\" - I don't remember the exact words, but that's the basics of this interaction.\n\"Vous pouvez pas attendre comme toute le monde? Est-ce que vous pensez que vous êtes spécial, monsieur?\"\n\"Je suis vraiment désolée, monsieur, mais je vraiment comprends pas quel est le problème ici\"\n\nHe gets really angry and starts saying things like \"I asked you a question, aren't you going to answer me? You know what you did\" and stuff like that, clearly looking for a fight or something. He asks for my documents, and tells me to pull over.\n\nThen a second officer comes and takes over, they exchange some words that I don't hear. This one is clearly more prepared to deal with the public, and says \"bonjour, vos documents, svp\".\n\nI notice this guy seems more reasonable and ask him \"hey, look, it looks like I made a mistake or something, but I'm not really seeing what it is.\"\n\nHe calmly says \"you changed lanes over a solid line back there \". I know I did not. I say \"oh, thanks for clarifying. I am pretty sure I did not...\"\n\nHe interrupts me and say \"do you want to make your day even more complicated this early in the morning?\"\n\nTL;dr: all cops are dicks.\n\nNow my question:\n\nThey took my driver's license and my insurance papers. They returned them to me and said \"you'll get the ticket in the mail\".\n\nI didn't sign anything, they didn't give me anything, and I am absolutely sure I didn't change lanes over a solid line.\n\nCan I plea not guilty? Is it worth it? Is there any chance I win?\n\nThanks for your input.",
        "author": "GrizzlyFoxCat"
    },
    {
        "title": "Does anyone else feel like their quality of life has improved since they stopped taking public transportation?",
        "score": 1,
        "id": "1grnd8f",
        "url": "https://www.reddit.com/r/montreal/comments/1grnd8f/does_anyone_else_feel_like_their_quality_of_life/",
        "created_utc": 1731641822.0,
        "num_comments": 62,
        "selftext": "I know we have the best system in Canada, but since August, I decided to bike everywhere, walk or, worst comes worst, take a cab. it's been over 3 months, and I noticed I am much more relaxed and always on time for work or school. Not dealing with public tantrums or someone snorting drugs out in public. Before, I was constantly anxious, especially in the morning, that what if the green or orange line is down (most of the time it was) or the bus wouldn't show up on time or come earlier than expected? Now I plan my leave and time it well and never late for anything. plus saving 100 a month.",
        "author": "mindmyownbusinx"
    },
    {
        "title": "Librairie (en/fr) qui est centrée sur les livres d'histoire, de linguistique, etc ",
        "score": 3,
        "id": "1grncbb",
        "url": "https://www.reddit.com/r/montreal/comments/1grncbb/librairie_enfr_qui_est_centrée_sur_les_livres/",
        "created_utc": 1731641737.0,
        "num_comments": 5,
        "selftext": "Bonjour, je recherche un librairie qui est plus centrée sur des essais, des non-fiction et des livres posant sur l'histoire. Clairement, renaud-bray ou archembault ne font pas l'affaire car ils sont plus focused sur des romans et livres fictions. Anglais preferablement puisqu'il y a plus de ressource. merci",
        "author": "TacticoolBuddy"
    },
    {
        "title": "A guy is doing hard drugs in the metro car ",
        "score": 123,
        "id": "1grmaz6",
        "url": "https://www.reddit.com/r/montreal/comments/1grmaz6/a_guy_is_doing_hard_drugs_in_the_metro_car/",
        "created_utc": 1731638406.0,
        "num_comments": 106,
        "selftext": "I am not shocked but baffled. You can see people injecting themselves idk what while arriving at berri. Wtf?!?? I just need to share the experience. ",
        "author": "raga_drop"
    },
    {
        "title": "[RANT] La sollicitation Bell porte-à-porte ",
        "score": 219,
        "id": "1grll92",
        "url": "https://www.reddit.com/r/montreal/comments/1grll92/rant_la_sollicitation_bell_porteàporte/",
        "created_utc": 1731636156.0,
        "num_comments": 79,
        "selftext": "C’est tu rien que moi qui trouve totalement inadmissible que Bell sonne chez moi à 20h30 le soir pour essayer de me vendre son internet, malgré mon gros sticker « Aucune sollicitation » à côté de ma sonnette.\n\nContexte:\n20h30 Plateau:\n- Ça sonne chez moi, je pèse sur le buzzer pour laisser entrer dans la cage d’escalier étroite de mon haut de duplex.\n- Une femme rentre avec un homme derrière, tout deux arborant des manteaux de Bell.\n- N’étant pas né de la dernière pluie, je leur indique que je ne suis pas intéressé par leur sollicitation et qu’ils peuvent quitter.\n- La femme, déjà en haut de mon escalier est insultée.\n- « Monsieur, vous ne savez même pas pourquoi nous sommes ici. »\n- « Je ne desire pas de sollicitation j’aimerais que vous quittiez SVP. »\n- « Qui vous a dit que ne faisons de la sollicitation? »\n- « Pourquoi êtes-vous ici alors? »\n- elle sort son iPad: « nous voyons ici que vous êtes avec Videotron…»\n- « C’est pas de vos affaires, j’aimerais qui vous quittiez… »\n- « Monsieur, pourquoi êtes-vous impoli avec moi? »\n- « Je ne suis pas impoli, j’aimerais juste que vous quittiez SVP, je ne suis pas intéressé par aucun produit présentement. »\n- « Je n’ai jamais parlé de produits, pourquoi m’empêchez-vous de faire mon travail? »\n- « Allez-vous en SVP! »\n- « Monsieur je ne viens pas vous empêcher de faire votre travail, pourquoi m’empêchez-vous de faire le mien? »\n- « Je vous ai demandé 5 fois de partir qu’est-ce que vous ne comprenez pas ? »\n- «Mais monsieur…»\n- Je lui ferme la porte au nez.\n\nC’est la pire tactique de marketing possible, esti on est en 2024, si je veux changer de forfait internet j’suis capable tout seul. Je me suis senti envahi dans mon propre domicile. Je sais pas si Bell donne des commissions ou quelque chose, mais il n’y a aucune excuse pour être aussi insistant. Ça me donne rien que le goût de jamais faire affaire avec eux.\n\nJ’suis tu tout seul ou c’est arrivé à d’autres gens icitte???\n\n",
        "author": "Assrobot"
    },
    {
        "title": "Moon halo tonight ",
        "score": 17,
        "id": "1grktzs",
        "url": "https://i.redd.it/n6iocc5fwy0e1.jpeg",
        "created_utc": 1731633828.0,
        "num_comments": 0,
        "selftext": "",
        "author": "celestial-coordinate"
    },
    {
        "title": "Seeking Christmas Cake",
        "score": 0,
        "id": "1grkshb",
        "url": "https://www.reddit.com/r/montreal/comments/1grkshb/seeking_christmas_cake/",
        "created_utc": 1731633696.0,
        "num_comments": 9,
        "selftext": "Hiya all. I am looking to locate where I might buy some delicious Traditional English Christmas Cake (i.e. dark fruitcake with a layer of marzipan and Royal Icing. It must be dark cake.) \n\nI did pick up a President's Choice brick, Brandied fruit cake, which is tasty! However I am hoping to perhaps source a nice, ideally local-made, one which will be given as a hosting gift. Nicer presentation is a bonus, though less important than quality flavours. TIA",
        "author": "gal_tiki"
    },
    {
        "title": "What are the West Island’s GOAT restaurants?",
        "score": 0,
        "id": "1grkkg9",
        "url": "https://www.reddit.com/r/montreal/comments/1grkkg9/what_are_the_west_islands_goat_restaurants/",
        "created_utc": 1731633006.0,
        "num_comments": 66,
        "selftext": "I know it’s significant part of the island, but because I’ve lived in the southwest and downtown for most of my life, I’ve never really experienced the West Island, but I want to!… \n\nPeople of the West Island: which part are you from, and what are your all-time great restaurants?",
        "author": "JustDisgrace"
    },
    {
        "title": "If you make 150k$+ what type of work do you do?",
        "score": 117,
        "id": "1grkbpq",
        "url": "https://www.reddit.com/r/montreal/comments/1grkbpq/if_you_make_150k_what_type_of_work_do_you_do/",
        "created_utc": 1731632295.0,
        "num_comments": 531,
        "selftext": "Looking for insights from those earning $150k$+ per year: What industries do you work in, what types of roles do you hold, and what education or qualifications have helped you reach this level?",
        "author": "vaterfirth"
    },
    {
        "title": "Les meilleur des piscines à Montréal? / Best pools in Montreal?",
        "score": 1,
        "id": "1grkaxs",
        "url": "https://www.reddit.com/r/montreal/comments/1grkaxs/les_meilleur_des_piscines_à_montréal_best_pools/",
        "created_utc": 1731632224.0,
        "num_comments": 10,
        "selftext": "Salut! Je suis entrainement pour le course l'année prochaine. Le piscine pres de chez moi est seulement 25 m. j'aimerais essayer une piscine de 50 m. Le centre Olympique est fermé jusqu'à Janvier. Cepsum c'est bonne mais coût $19 pour un pass journalier. Existe-t-il de meilleures options?\n\n(Pardon pour mon shitty francais)\n\nHey I'm training for a race next year and looking to get better at longer distance swimming the pool near my house is fine and free but get's busy and is only 25m. Looking for either something larger (50m) or somewhere relatively quiet. The olympic centre is closed until Jan and cepsum is good but costs like $19 for a day pass which is a bit steep to go regularly. Any other decent options? Anywhere near a metro would be good. \n\nThanks!",
        "author": "MoistTadpoles"
    },
    {
        "title": "Le supermarché T&amp;T a été extrêmement décevant",
        "score": 0,
        "id": "1grjzos",
        "url": "https://www.reddit.com/r/montreal/comments/1grjzos/le_supermarché_tt_a_été_extrêmement_décevant/",
        "created_utc": 1731631293.0,
        "num_comments": 5,
        "selftext": "J'ai enfin visiter les supermarchés T&amp;T!\n\nQuel désastre! Beaucoup d'employés ne parlent pas le français mais aussi certains ne parlent pratiquement pas l'anglais.\n\nIls n'avaient pas non plus 3 des 4 articles que je cherchais spécifiquement et dont ils font la publicité sur leur site web.\n\nEnfin, les prix sont très élevés, même pour des produits locaux à mon avis!\n\nTrès décevant! J'espère que la situation s'améliorera la prochaine fois que j'irai!\n\n",
        "author": "Optionsislife"
    },
    {
        "title": "Au volant même s’il pétait la balloune: un jeune coupable d’avoir fait deux blessés graves",
        "score": 11,
        "id": "1grjqvj",
        "url": "https://www.journaldemontreal.com/2024/11/14/au-volant-meme-sil-petait-la-balloune--un-jeune-coupable-davoir-fait-deux-blesses-graves",
        "created_utc": 1731630580.0,
        "num_comments": 1,
        "selftext": "",
        "author": "Optionsislife"
    },
    {
        "title": "Partir de Montréal... et contempler revenir a Montréal? avec enfants!?",
        "score": 0,
        "id": "1grj90c",
        "url": "https://www.reddit.com/r/montreal/comments/1grj90c/partir_de_montréal_et_contempler_revenir_a/",
        "created_utc": 1731629145.0,
        "num_comments": 58,
        "selftext": "Bonjour,\n\nHistoires similaires ici?  \nJe suis partie de Montreal pour mes études de maitrise, et au lieu de retourner a Montréal, je suis aller m'installer en Estrie, sachant que mon conjoint et moi voulons fonder une famille dans les prochaines années (debut-mi trentenaire pour les deux). J'adore le plein air a proximité ici, les appartements/maisons sont abordables mais Montréal me manque. Malgré les problèmes d'itinérances, le traffic sans fin, la difficulté de sortir de l'ile a cause du ce meme traffic, tout qui coute tellement plus cher, les petits logements... \n\nDes gens veulent me raconter a quel point avoir des enfants a Montreal est une bonne ou une mauvaise idée? A quel point quitter montreal a été un bonne ou mauvaise idée haha? Des gens ont vécu la meme chose de quitter la ville pour revenir plus tard ou simplement ont quitté et ce fut la meilleure decision? \n\n  \nJe cherche une sorte de support moral, ou simplement du partage de situation similaire! ",
        "author": "marzipanduchess"
    },
    {
        "title": "Busiest bars in Montreal? Longest lines to enter?",
        "score": 0,
        "id": "1grix0d",
        "url": "https://www.reddit.com/r/montreal/comments/1grix0d/busiest_bars_in_montreal_longest_lines_to_enter/",
        "created_utc": 1731628194.0,
        "num_comments": 3,
        "selftext": "Looking for some fun places to go out at night, any day of the week. \n\nI love busy places, I don't mind waiting in line for a little bit. \n\nThanks!",
        "author": "Low-Box2555"
    },
    {
        "title": "Local musicians Christmas songs",
        "score": 0,
        "id": "1grivhe",
        "url": "https://www.reddit.com/r/montreal/comments/1grivhe/local_musicians_christmas_songs/",
        "created_utc": 1731628073.0,
        "num_comments": 3,
        "selftext": "I want to get into the holiday spirit and start listening to festive music. I love supporting local talent. Any local musicians with Christmas music? Thanks ",
        "author": "CanBeCovered"
    },
    {
        "title": "When does the parking lot at namur fill up on Fridays?",
        "score": 0,
        "id": "1griqmz",
        "url": "https://www.reddit.com/r/montreal/comments/1griqmz/when_does_the_parking_lot_at_namur_fill_up_on/",
        "created_utc": 1731627693.0,
        "num_comments": 3,
        "selftext": "I need to drive to namur on Friday but unfortunately due to unfortunate circumstances the earliesy I can get there is 8:15. I know the parking lot is very popular, so will it be full by then? I very much need to park somewhere near the station, so if it's full am I allowed to park in the Walmart parking lot beside it? ",
        "author": "throwawayforashow"
    },
    {
        "title": "Recommendations for 100 people birthday that we can bring our own food?",
        "score": 0,
        "id": "1grifyp",
        "url": "https://www.reddit.com/r/montreal/comments/1grifyp/recommendations_for_100_people_birthday_that_we/",
        "created_utc": 1731626852.0,
        "num_comments": 3,
        "selftext": "Any recommendations for a place that accomodates 100 people for a birthday party that has tables and chairs, but that we can bring our own food. TIA",
        "author": "NothingImaginary9777"
    },
    {
        "title": "Montreal via Greyhound",
        "score": 0,
        "id": "1gricyk",
        "url": "https://www.reddit.com/r/montreal/comments/1gricyk/montreal_via_greyhound/",
        "created_utc": 1731626617.0,
        "num_comments": 12,
        "selftext": "Hello everyone,\nI'm an 18 year old who is going by greyhound to visit a friend in Montreal from NY. I was wondering what type of questions would be asked at the border. Greyhound says on their website that they will ask us the purpose of the visit and may search our belongings but I was wondering if that's all? Also, I am bringing gifts for my friends, l'm assuming I would need to tell the agent? I would appreciate some help, thank you!",
        "author": "No-Damage-45"
    },
    {
        "title": "Chialage sur la conduite",
        "score": 25,
        "id": "1gricvf",
        "url": "https://www.reddit.com/r/montreal/comments/1gricvf/chialage_sur_la_conduite/",
        "created_utc": 1731626609.0,
        "num_comments": 15,
        "selftext": "Voyons qu'est-ce qui se passe avec les autos en ce moment. Tout les monde conduit mal en criss'. Ça préviens pas quand ça va tourner, ça klaxonne tout les temps pour rien, genre le feu est passé vers y a 1 seconde câlisse. Ça fait pas attention aux piétons, ça s'arrête sur les passages piétons plus que d'attendre au début du carrefour. Au début c'était pas mal du monde de l'Ontario ( en tout cas dans mon quartier) qui conduisait mal je trouvais. Mais depuis cette rentrée là c'est devenu la zone Crim' faites attention à vous",
        "author": "yaki_"
    },
    {
        "title": "Où se trouve des casse-têtes de création de phrases pour les enfants?",
        "score": 3,
        "id": "1grfq1t",
        "url": "https://www.reddit.com/r/montreal/comments/1grfq1t/où_se_trouve_des_cassetêtes_de_création_de/",
        "created_utc": 1731619546.0,
        "num_comments": 6,
        "selftext": "Je cherche quelque chose comme ca mais mais en français:\n\nhttps://www.amazon.ca/Learning-Resources-Builders-Sentence-Puzzles/dp/B0BVM8HMBC\n\nMerci!",
        "author": "levelworm"
    },
    {
        "title": "Hi I know nothing about food delivery but how can I learn to do it?",
        "score": 0,
        "id": "1grfmn5",
        "url": "https://www.reddit.com/r/montreal/comments/1grfmn5/hi_i_know_nothing_about_food_delivery_but_how_can/",
        "created_utc": 1731619297.0,
        "num_comments": 8,
        "selftext": "Hi I don't even have a bike and I saw someone do it with Bixi.\n\nAnd I don't want to be slow and make the food cold and customer angry....\n\nI don't know how to start... How can I learn to do deliveries?\n\nI have an Uber eats delivery account ",
        "author": "asdf_8954"
    },
    {
        "title": "En Corée du sud, les citoyens sont récompensés pour dénoncer des infraction à la loi. ",
        "score": 56,
        "id": "1gre397",
        "url": "https://www.youtube.com/watch?v=Bpn8QhImLk0",
        "created_utc": 1731615306.0,
        "num_comments": 67,
        "selftext": "",
        "author": "Znkr82"
    },
    {
        "title": "Restaurant avant le hockey",
        "score": 0,
        "id": "1grdh3g",
        "url": "https://www.reddit.com/r/montreal/comments/1grdh3g/restaurant_avant_le_hockey/",
        "created_utc": 1731613728.0,
        "num_comments": 23,
        "selftext": "Bonjour cher gens!\n\nJe recherche un restaurant avant d'aller au canadien de Montreal ( j'ai gagné des billets avec le travail, yay!)\n\nNous aimons énormément general tao/ crevette panné sel et poivre. C'est quand meme spécifique mais nos 2 resto préféré asiatique sont \"l'echalotte\" à Richelieu et \"le rouge\" au dix30.\n\nSinon BBQ coréen, c'est quelque chose qu'en campagne je n'ai pas la chance de manger.\n\nDernièrement, burger et tartare sont tjrs gagnant. Un grand fan de \"la cochonerie\" à Chambly.\n\nPréférablement un resto pas trop loin du centre Bell qui me permettrait de me stationner et de marcher au 2 location. Si vous connaissez des bon parking pour se rendre au centre Bell prenne le temps de commenter que je fasse un \"melting pot\" de toute vos idées.\n\nMerci beaucoup!",
        "author": "Brainl3ss"
    },
    {
        "title": "Restaurants for this weekend?",
        "score": 0,
        "id": "1grdb9o",
        "url": "https://www.reddit.com/r/montreal/comments/1grdb9o/restaurants_for_this_weekend/",
        "created_utc": 1731613304.0,
        "num_comments": 14,
        "selftext": "This will be our first time visiting the city and want to have the best food! Any must-see spots? Would love some authentic French cuisine and poutine but open to anything :)",
        "author": "External_Reporter386"
    },
    {
        "title": "Expos iconic logo explained 🙌",
        "score": 684,
        "id": "1grcvj3",
        "url": "https://i.redd.it/zm40dv034x0e1.jpeg",
        "created_utc": 1731612192.0,
        "num_comments": 59,
        "selftext": "Better late than never!",
        "author": "mtlretroblog"
    },
    {
        "title": "What is the BEST restaurant experience you’ve had in Montreal?",
        "score": 110,
        "id": "1grbhgy",
        "url": "https://www.reddit.com/r/montreal/comments/1grbhgy/what_is_the_best_restaurant_experience_youve_had/",
        "created_utc": 1731608660.0,
        "num_comments": 246,
        "selftext": "En miroir de l'autre thread très intéressant sur les pires expérience dans les restos de Montréal, quelles sont vos meilleures expériences ?\n\nÇa a malheureusement fermé mais j'adorais aller à la Maison Publique sur le plateau, réserver une 'table' au bar, partager d'excellentes assiettes, discuter avec la personne qui fait le service, la regarder faire des cocktails, etc La deco, la musique, l'ambiance, c'etait super ! ",
        "author": "agravepasmon-k"
    },
    {
        "title": "Best affordable food places in Montreal for tourists (no Beef or Pork)? ",
        "score": 0,
        "id": "1gratf5",
        "url": "https://www.reddit.com/r/montreal/comments/1gratf5/best_affordable_food_places_in_montreal_for/",
        "created_utc": 1731607009.0,
        "num_comments": 1,
        "selftext": "Hey everyone! I’m looking for some great, affordable food spots in Montreal that are a must-try. I can’t eat beef or pork, so any recommendations for places with delicious alternatives (chicken, seafood, etc.) would be awesome. Thanks in advance! ",
        "author": "Conscious_Fig_8518"
    },
    {
        "title": "Je cherche désespérément un emploi / Looking for a job in Montreal areas",
        "score": 8,
        "id": "1granet",
        "url": "https://www.reddit.com/r/montreal/comments/1granet/je_cherche_désespérément_un_emploi_looking_for_a/",
        "created_utc": 1731606599.0,
        "num_comments": 52,
        "selftext": "Je (Feminin) cherche désespérément un emploi, je n'arrive pas à en trouver à cause d'un gap de 2 ans sur mon CV. Mais si personne ne veut m'offrir la chance de retourner sur le marché de travail le gap va s'allonger. Je suis dans le domaine du TI (qualité logiciel test manuel/ software manual testing). Mais je cherche même une job connexe: saisie de données, service clientèle (mon niveau d'anglais est intermédiaire donc je peine à en trouver).",
        "author": "No_Palpitation3668"
    },
    {
        "title": "Peut être temps d'équiper les communautos avec une caméra de recul 🤔",
        "score": 66,
        "id": "1grac5r",
        "url": "https://i.redd.it/wfyah435lw0e1.jpeg",
        "created_utc": 1731605823.0,
        "num_comments": 77,
        "selftext": "",
        "author": "agaceformelle"
    },
    {
        "title": "Problèmes avec compte bixi?",
        "score": 1,
        "id": "1gr96bp",
        "url": "https://www.reddit.com/r/montreal/comments/1gr96bp/problèmes_avec_compte_bixi/",
        "created_utc": 1731602908.0,
        "num_comments": 8,
        "selftext": "J'essais de me logger sur mon espace bixi sur le web, et j'ai un message d'erreur comme quoi je ne peux pas me connecter. J'ai essayé avec plusieurs browser différents, sur 3 appareils et j'ai meme demandé a un ami d'essayer sur leur ordi et ca fonctionne pas. Les tech de bixi font juste répéter de vider ma cache et toutes les données de mon navigateur ou de réinitialiser mon mot de passe (que je peux pas faire à cause que je peux pas logger in).\n\nBref, j'ai l'impression que le problème est de leur bord... Quelqu'un peut essayer voir si ils ont le meme problème?\n\n\n\nedit: Bon finalement je leur ai décrit en détails toutes les choses que j'ai fait pour prouver que le problème était pas de mon bord pis je leurs ai demandé de faire suivre à leur équipe technique. Un peu plus tard il m'ont revenus en demandant d'essayer à nouveau. Ca marche maintenant mais j'ai aucune idée c'était quoi le problème.\n\nhttps://preview.redd.it/323cswlacw0e1.png?width=1618&amp;format=png&amp;auto=webp&amp;s=922eba0f1c659f0c1aba07e48e8a5b26cea5c4f7",
        "author": "bloooooort"
    },
    {
        "title": "REM trains to start rolling west and north in fall of 2025",
        "score": 90,
        "id": "1gr8d8g",
        "url": "https://montrealgazette.com/news/local-news/rem-trains-to-start-rolling-west-and-north-in-fall-of-2025",
        "created_utc": 1731600817.0,
        "num_comments": 21,
        "selftext": "",
        "author": "PhilipTheGreat"
    },
    {
        "title": "Diving into the Montreal bathhouse Bain Colonial 👀",
        "score": 0,
        "id": "1gr8ckl",
        "url": "https://www.themain.com/articles/diving-into-the-montreal-bathhouse-bain-colonial",
        "created_utc": 1731600769.0,
        "num_comments": 5,
        "selftext": "",
        "author": "PhilipTheGreat"
    },
    {
        "title": "Place Ville-Marie",
        "score": 167,
        "id": "1gr8b83",
        "url": "https://i.redd.it/v9xit4cs5w0e1.jpeg",
        "created_utc": 1731600673.0,
        "num_comments": 5,
        "selftext": "",
        "author": "TheBali"
    },
    {
        "title": "No GPS required: Transit app can now detect underground metro locations",
        "score": 75,
        "id": "1gr88iy",
        "url": "https://blog.transitapp.com/go-underground/",
        "created_utc": 1731600483.0,
        "num_comments": 8,
        "selftext": "",
        "author": "mtlbagelboy"
    },
    {
        "title": "Can the landlord refuse to renew my lease? ",
        "score": 0,
        "id": "1gr7by5",
        "url": "https://www.reddit.com/r/montreal/comments/1gr7by5/can_the_landlord_refuse_to_renew_my_lease/",
        "created_utc": 1731598171.0,
        "num_comments": 87,
        "selftext": "It's a big condo of 50 floors and since the beginning of my stay, I wasn't happy with the building and the management. So I wrote a big and long review on google to express my frustration. I also included photos of rusty jacuzzi and photos of the elevators not working. In response, the management answered this on google: \"Hi..., we are very disappointed to read this review. we fully understand by our decision not to extend the same promotions that you currently have in your lease for next year...\" Can management disagree to renew my lease at the end of the day? Because my boyfriend and I would like to continue living there because we are fed up with the process of moving out and all. Please I need your advice.",
        "author": "Conscious_Cookie_841"
    },
    {
        "title": "How is it to work in Tech?",
        "score": 0,
        "id": "1gr70ru",
        "url": "https://www.reddit.com/r/montreal/comments/1gr70ru/how_is_it_to_work_in_tech/",
        "created_utc": 1731597346.0,
        "num_comments": 2,
        "selftext": "Hi everybody! I'd like to know how is it the market nowadays in the IT field comparing to other cities or countries?\nI was living in Montreal until the last year and I was working like administrative clerk, came back to Italy due to family reason and working like IT support technician level 1. I passed the CCNA exam last month and I would like to do something more than help desk. Here it's very hard to boost your career, but I would like to hear experiences from people working in IT jobs in MTL to know if it's better to work there (I also speak French).",
        "author": "Striking-Start-5120"
    },
    {
        "title": "Déraillement de train à Longueuil",
        "score": 23,
        "id": "1gr6ujv",
        "url": "https://ici.radio-canada.ca/nouvelle/2119912/deraillement-train-deversement-peroxyde-hydrogene",
        "created_utc": 1731596888.0,
        "num_comments": 2,
        "selftext": "",
        "author": "allo555"
    },
    {
        "title": "On aime ça, la nature",
        "score": 85,
        "id": "1gr6djt",
        "url": "https://i.redd.it/q894y23tqv0e1.jpeg",
        "created_utc": 1731595620.0,
        "num_comments": 77,
        "selftext": "",
        "author": "sour-gummiez"
    },
    {
        "title": "Is the metro a bit more crowded lately??",
        "score": 0,
        "id": "1gr68xb",
        "url": "https://www.reddit.com/r/montreal/comments/1gr68xb/is_the_metro_a_bit_more_crowded_lately/",
        "created_utc": 1731595265.0,
        "num_comments": 20,
        "selftext": "Bonjour/hi Montreales! Is it just me or the metro feels a bit more crowded than usual lately?? Would it be maybe because the puffy jackets make us all a bit wider and we are occupying more space? Or is it that we are having more contingencies in the metro?",
        "author": "NotUSually_right"
    },
    {
        "title": "Entreprises qui ont commencé leur Black Friday 2024?",
        "score": 0,
        "id": "1gr5m56",
        "url": "https://www.reddit.com/r/montreal/comments/1gr5m56/entreprises_qui_ont_commencé_leur_black_friday/",
        "created_utc": 1731593475.0,
        "num_comments": 6,
        "selftext": "Je sais qu'il est encore tôt, mais connaissez-vous des entreprises en ligne qui ont déjà commencé le Black Friday / Vendredi Fou au Québec ou Canada (ship au QC)? Je regarde pour magasiner des cadeaux de host, bougies, etc.",
        "author": "PerformerNo5067"
    },
    {
        "title": "What is the worst restaurant experience you’ve had in Montreal?",
        "score": 279,
        "id": "1gr5kwi",
        "url": "https://www.reddit.com/r/montreal/comments/1gr5kwi/what_is_the_worst_restaurant_experience_youve_had/",
        "created_utc": 1731593372.0,
        "num_comments": 548,
        "selftext": "I am wondering what is the worst experience others have had dining in Montreal ? For me it was personally the restaurant jade buffet in china town, I was walking around Chinatown with my wife and her sister and my sister in law suggested dim sum, so we saw in the window they had dim sum and a buffet for a reasonable price, we decided to go in. The first warning was you had to pay before you even got in but we didn’t think too much of it, then as soon as you got inside the smell hits you, musty old carpet with a hint of urine. At this point we paid and were committed, then we saw the food and I thought to myself this is exactly the place where you would get food poisoning, it looked like it had been there for days, but I was hungry so I went for what looked the safest. The food was very gross and it was hard to eat anything with the pissy/musty smell around us. Also beside our table was a man watching videos on his phone with the volume on full blast, another customer complained to him and then they started arguing about Legault and being French vs English. My wife decided to go to the bathroom and she said there was human waste all over the toilets and period blood everywhere, and right when we were finished I watched a huge rat run across the floor 🤣",
        "author": "vmackdaddy"
    },
    {
        "title": "Who watching Tyson and Paul on Friday?",
        "score": 0,
        "id": "1gr4n8s",
        "url": "https://www.reddit.com/r/montreal/comments/1gr4n8s/who_watching_tyson_and_paul_on_friday/",
        "created_utc": 1731590553.0,
        "num_comments": 14,
        "selftext": "Les Trois Monkeys on Peel street is showing the fight. FINALLY! All the other bars I called are not showing it. I heard the food is just crap. Does anyone know of another bars with better food that is showing it?\n",
        "author": "I812many4chuncookies"
    },
    {
        "title": "Décorations de Noël ",
        "score": 2,
        "id": "1gr4dzv",
        "url": "https://www.reddit.com/r/montreal/comments/1gr4dzv/décorations_de_noël/",
        "created_utc": 1731589735.0,
        "num_comments": 20,
        "selftext": "Question légère aujourd'hui ... \nVos décorations de Noël, intérieur et extérieur, vous les installer a quel moment ? \nAvant le 1er décembre c'est trop tôt d'après vous ? \n\nÇa me passait par la tête car j'ai des voisins qui ont décoré 3 jours après l'Halloween ! ",
        "author": "le_maire_de_montreal"
    },
    {
        "title": "Au moins 10 ans de pénitencier pour un octogénaire qui a tué sa femme atteinte d’Alzheimer «par grande compassion»",
        "score": 1,
        "id": "1gqthqq",
        "url": "https://www.journaldemontreal.com/2024/11/13/au-moins-10-ans-de-penitencier-pour-un-octogenaire-qui-a-tue-sa-femme-atteinte-dalzheimer-par-grande-compassion",
        "created_utc": 1731548077.0,
        "num_comments": 1,
        "selftext": "",
        "author": "John__47"
    },
    {
        "title": "GOOD passport photo places",
        "score": 0,
        "id": "1gr3njh",
        "url": "https://www.reddit.com/r/montreal/comments/1gr3njh/good_passport_photo_places/",
        "created_utc": 1731587276.0,
        "num_comments": 24,
        "selftext": "Do you have any recommendations for places that take decent passport photos and will actually try/let you see them? Not like a drugstore type, somewhere that you were actually happy with the result. ",
        "author": "whyuoft"
    },
    {
        "title": "Rencontrer le Pro du DVD ",
        "score": 58,
        "id": "1gr2zwi",
        "url": "https://www.reddit.com/r/montreal/comments/1gr2zwi/rencontrer_le_pro_du_dvd/",
        "created_utc": 1731584849.0,
        "num_comments": 13,
        "selftext": "Sympa comme article.\n\n[https://www.journaldemontreal.com/2024/11/16/il-y-a-de-largent-a-faire-avec-les-dvd--notre-chroniqueur-a-visite-le-mysterieux-pro-des-dvd-et-a-accepte-daccrocher-une-de-ses-annonces-artisanales-pres-de-chez-lui](https://www.journaldemontreal.com/2024/11/16/il-y-a-de-largent-a-faire-avec-les-dvd--notre-chroniqueur-a-visite-le-mysterieux-pro-des-dvd-et-a-accepte-daccrocher-une-de-ses-annonces-artisanales-pres-de-chez-lui)\n\n",
        "author": "azedarac"
    },
    {
        "title": "Recommandations pour une première visite à Montréal pour mes parents / Recommendations for a First-Time Visit to Montreal for My Parents",
        "score": 0,
        "id": "1gqymny",
        "url": "https://www.reddit.com/r/montreal/comments/1gqymny/recommandations_pour_une_première_visite_à/",
        "created_utc": 1731565261.0,
        "num_comments": 1,
        "selftext": "Bonjour à tous !\n\nMes parents visitent Montréal pour la première fois et je cherche des recommandations pour rendre leur séjour de 3 semaine ici inoubliable. Ils ont tous les deux la cinquantaine, et je vis dans la ville depuis environ 7 mois. Cependant, avec le travail et un emploi du temps chargé, je n'ai pas eu l'occasion d'explorer autant que je le voudrais. Je prévois aussi de les emmener à Ottawa et à Québec pendant leur séjour, donc on veut vraiment profiter au maximum de notre temps à Montréal.\n\nJ’aimerais des suggestions pour des activités, des sites à visiter et des restaurants qui seraient agréables pour eux – rien de trop intense, mais plutôt des choses qui montrent le meilleur de Montréal. Bien que je connaisse les incontournables (le Vieux-Montréal, le Mont Royal, les Jardins botaniques), j’espère obtenir quelques conseils locaux sur des trésors cachés ou des expériences uniques qu'ils pourraient apprécier.\n\nNous sommes intéressés par :\n\nDes lieux avec de belles vues\nDes attractions culturelles ou historiques\nDes endroits agréables et mémorables pour manger\nToute expérience incontournable qui rend Montréal spécial\nMerci beaucoup pour vos suggestions !\n\n——\n\nHi everyone!\n\nMy parents are visiting Montreal for the first time, and I’m looking for some recommendations to make the most of their 3-week vacation here. They’re both in their 50s, and I’ve been living in the city for about 7 months. However, with work and a busy schedule, I haven’t had a chance to explore much myself. I also plan to take them to Ottawa and Quebec City during their stay, so we want to make the most of our time in Montreal.\n\nI’d love suggestions for activities, sights, and restaurants that would be enjoyable and memorable for them—nothing too extreme, but ideally things that showcase the best of Montreal. While I’m familiar with the basics (Old Montreal, Mont Royal, the Botanical Gardens), I’m hoping for some local insights into hidden gems or unique experiences they might enjoy.\n\nWe’re interested in:\n\nScenic spots with beautiful views\nCultural or historical attractions\nRelaxed yet memorable places to eat\nAny must-try experiences that make Montreal special\nThanks so much for your help!\n\n",
        "author": "False_Scar_9261"
    },
    {
        "title": "What's the best chocolate in Montreal?",
        "score": 0,
        "id": "1gqy5z7",
        "url": "https://www.reddit.com/r/montreal/comments/1gqy5z7/whats_the_best_chocolate_in_montreal/",
        "created_utc": 1731563444.0,
        "num_comments": 10,
        "selftext": "Every year for Christmas I like getting my mom some nice chocolates. Last year I got things from Ernestine and they were great. I'm not opposed to buying from them again but I'd also like to support other local chocolate makers. Ideally places that you can order online and they'd ship, since life happens and I don't have a whole lot of time to drive around these days.\n\nThanks!",
        "author": "TenMinutesToDowntown"
    },
    {
        "title": "REM qui ralentit dans les 15km/h jusqu’à la prochaine station?",
        "score": 26,
        "id": "1gqwnaw",
        "url": "https://www.reddit.com/r/montreal/comments/1gqwnaw/rem_qui_ralentit_dans_les_15kmh_jusquà_la/",
        "created_utc": 1731558033.0,
        "num_comments": 19,
        "selftext": "Bonjour,\n\nC’est ma première expérience où le REM ralentit dans les alentours de 15km/h proche de l’entrepôt Costco jusqu’à la station Île-des-Soeurs pour ensuite reprendre sa vitesse habituelle vers Brossard. Il y a une raison pour cela? ",
        "author": "1dej"
    },
    {
        "title": "Where can I buy fish stock? Already made ",
        "score": 0,
        "id": "1gqwevs",
        "url": "https://www.reddit.com/r/montreal/comments/1gqwevs/where_can_i_buy_fish_stock_already_made/",
        "created_utc": 1731557246.0,
        "num_comments": 11,
        "selftext": "I want to cook a Finnish dish for a friend and I need fish stock. \nNeed more characters for this to not get deleted, so here's more characters. Kiitos, that means thank you in Finnish.",
        "author": "Anarkya"
    },
    {
        "title": "Drivers are making me go insane ",
        "score": 0,
        "id": "1gqvvyw",
        "url": "https://www.reddit.com/r/montreal/comments/1gqvvyw/drivers_are_making_me_go_insane/",
        "created_utc": 1731555505.0,
        "num_comments": 17,
        "selftext": "Dear Montrealer's, It has come to my attention that their has been super horrible driving out on the road lately, and a lot of people have been not paying attention and either or almost having collisions almost ending my life entirely while out on the road. \n\n  \nNovember 8th, their was a car that was on highway 40 when I was getting on that was going a million miles an hour and that it endangered my life and that he **ALMOST** hit me and caused something fatal,  he was still speeding, and it made me uncomfortable and shaken to my core to my destination, \n\n  \nNov 13th evening; Ville St Laurent going onto highway 40.\n\n  \nI was minding my own business when suddenly I see a car that was **PARKED** in the distance, I had to suddenly do something and maneuver really quickly or else that I would of caused a collision. Their was this car that was also going fast behind me but he did not thankfully was in the way, but flashed his headlights and honked his horn because I was making the maneuver to avoid an accident. I safely made it out alive, and was still trembling after the fact though, I just couldn't bare. \n\n  \nIs their anything that could be done? I am very sick of almost getting into collisions and also almost fatal accidents, when people should be concentrating on the road. \n\nTheirs so many drivers that dont follow the rules and also just dont pay attention. Honestly, that I feel they should be more attentive more than being distracted on their phones and or doing something else. \n\n  \nMontreal has been very negative lately, out of my 30 years of being here I've never been so scared of other drivers. \n\n  \nDO BETTER MONTREAL. \n\n\n\n",
        "author": "Erhmactually"
    },
    {
        "title": "Karaoke suggestions!",
        "score": 0,
        "id": "1gquh5k",
        "url": "https://www.reddit.com/r/montreal/comments/1gquh5k/karaoke_suggestions/",
        "created_utc": 1731551075.0,
        "num_comments": 2,
        "selftext": "I have a friend coming in from out of town and they want to celebrate their birthday at a karaoke box... is there a fav other than Pang Pang and le Mic? and if you could only do one, which one would it be (if there aren't any other favorites)? Merci!",
        "author": "rDub416"
    },
    {
        "title": "Dating in MTL",
        "score": 0,
        "id": "1gqtfyr",
        "url": "https://www.reddit.com/r/montreal/comments/1gqtfyr/dating_in_mtl/",
        "created_utc": 1731547927.0,
        "num_comments": 17,
        "selftext": "I dont know if im doing something wrong or things are this way here but is dating impossible in MTL? Im a blond, tall, athlethic guy that is reasonably attractive and never had any problems with dating in my home country. Recently landed in MTL and havent had a single eye contact with a girl, as if people walk with their head down and dont look at anyone. I prefer to approach girls live but ive been told to be careful here? Not sure what it meant. As far as dating apps, yea we all know these dont work. Last thing, why is there so many stunning girls with ugly bfs?",
        "author": "sikimango"
    },
    {
        "title": "Help Me Find a Barbershop Location in MTL! 🚨💈",
        "score": 0,
        "id": "1gqtbob",
        "url": "https://www.reddit.com/r/montreal/comments/1gqtbob/help_me_find_a_barbershop_location_in_mtl/",
        "created_utc": 1731547574.0,
        "num_comments": 4,
        "selftext": "Hey r/montreal,\n\nI’m on the hunt for a prime spot to open a barbershop and could really use your help! Here’s what I’m looking for:\n\n\t•\tLocation: Busy area with lots of foot traffic (think neighborhoods with cafés, shops, or near public transport).\n\t•\tSize: Over 500 sq. ft.\n\t•\tRent: Ideally under $1700/month.\n\nIf you know of any hidden gems or have any tips on where to look, please drop a comment or DM me! I’m open to suggestions across the city, as long as it’s in a bustling spot. Thanks in advance for your help!\n\nCheers!",
        "author": "Yourrname"
    },
    {
        "title": "3 days to visit - memorable experiences? ",
        "score": 0,
        "id": "1gqrxmz",
        "url": "https://www.reddit.com/r/montreal/comments/1gqrxmz/3_days_to_visit_memorable_experiences/",
        "created_utc": 1731543540.0,
        "num_comments": 2,
        "selftext": "Hello everyone, I'm traveling with two friends for Messe De Morts  (metal music festival) and was looking for recommendations of things to do, places to visit, restaurants etc before 6pm (when the show starts). Really anything that could make this special, please feel free to drop in the comments. Thanks in advance ! ",
        "author": "blackfnmetal"
    },
    {
        "title": "Habitez-vous à Outremont ou Parc-Ex? J'ai un projet participatif à vous proposer.",
        "score": 0,
        "id": "1gqrnqr",
        "url": "https://www.reddit.com/r/montreal/comments/1gqrnqr/habitezvous_à_outremont_ou_parcex_jai_un_projet/",
        "created_utc": 1731542761.0,
        "num_comments": 2,
        "selftext": " Je cherche des participants pour un projet de recherche à Outremont et Parc-Ex. Le projet consiste à jouer à un jeu vidéo sur les espaces verts! Tous les participants recevront une plante en cadeau et les résultats du projet seront partagés avec la Ville.\n\nSi jamais ça vous tente, voici un lien avec plus d'infos et la possibilité de s'inscrire: [https://forms.office.com/r/7QBPxfQ3et](https://forms.office.com/r/7QBPxfQ3et)\n\nIf you speak English only, you are also welcome to join! We will hold sessions in English as well.  \n",
        "author": "mindlessdroid"
    },
    {
        "title": "Why does stm suck so bad?",
        "score": 0,
        "id": "1gqrif7",
        "url": "https://i.redd.it/1p5axjbhcr0e1.jpeg",
        "created_utc": 1731542376.0,
        "num_comments": 17,
        "selftext": "I regularly deal with stm being late, leaving before schedule time and/or not showing up entirely. Ive made many complaints to customer service yet it seems like the services only get worse. \nWhy do i pay 100$ per month for this god awful transport? Because i have no other options due too mtl rent being so damn high. \nWinter is coming and it is only going to get worse. \nWe should go on strike or something, because  no one seems to do anything about it and im tired of missing appointments/being late for work, because of these inconsiderate stm workers. \nAnyway rant over, saw this vandalism at the 485O bus stop, after the bus passed 4 mins before their scheduled time. Now im waiting for the 202 and it keeps getting delayed more and more. Stuck outside in -1 weather waiting indefinitely for some jerk to show up finally. \nI agreed stranger, STM BUSSES SUCK!",
        "author": "Imaginary_Parsley444"
    },
    {
        "title": "Face to face French tutors",
        "score": 6,
        "id": "1gqr2wb",
        "url": "https://www.reddit.com/r/montreal/comments/1gqr2wb/face_to_face_french_tutors/",
        "created_utc": 1731541163.0,
        "num_comments": 7,
        "selftext": "Hello, I am looking for a French tutor as my French grades are really bad and I want to be able to be fluent in French. However, because I really cannot focus online, I have been looking face to face tutors, which has proven difficult. I would appreciate any advice or recommendations, price is not an issue. Thank you",
        "author": "SK_Reddit123456789"
    },
    {
        "title": "How To Learn French",
        "score": 0,
        "id": "1gqq868",
        "url": "https://www.reddit.com/r/montreal/comments/1gqq868/how_to_learn_french/",
        "created_utc": 1731538855.0,
        "num_comments": 24,
        "selftext": "Bonjour à tous! I moved to Montreal a month ago, I signed up for Francisation courses right away, and now I’m waiting. I know it may take long to start so I’m looking for alternatives. Do you know any places that offer cheap French courses? \nBtw I’m not looking for online classes, I’m already learning from Youtube and Duolingo.",
        "author": "redditsdom"
    },
    {
        "title": "Off leash dogs ",
        "score": 53,
        "id": "1gqpy63",
        "url": "https://www.reddit.com/r/montreal/comments/1gqpy63/off_leash_dogs/",
        "created_utc": 1731538108.0,
        "num_comments": 119,
        "selftext": "Not sure what to do. Everyday myself and my partner go on the little forest in outremont side of the mountain. There are signs everywhere that leashes are required. The people who live up there on the mountain seem to think this space is their backyard and it’s actually rare to see dogs on leashes. Myself I’m pretty good with dogs but my partner and child not so much. We see all kinds of dogs up there but a lot of big ones with lock jaw. Do we say something? How do we keep ourselves safe? My partner is extremely upset and nervous about this and while I try to reassure him I understand the stress when there are very large dogs who don’t recall when owners ask and are off leash. I am very open to perspectives but in the end the leash is required and they seem to think they can skirt around this until someone gets hurt. \nEdit: after doing research lock jaw is a myth but dog attacks are not.",
        "author": "Critical-Face-1139"
    },
    {
        "title": "Ouest et nord du REM | La livraison aura lieu à l’automne 2025",
        "score": 73,
        "id": "1gqp7v6",
        "url": "https://www.lapresse.ca/actualites/grand-montreal/2024-11-13/ouest-et-nord-du-rem/la-livraison-aura-lieu-a-l-automne-2025.php",
        "created_utc": 1731536168.0,
        "num_comments": 41,
        "selftext": "",
        "author": "clgoh"
    },
    {
        "title": "J'ai essayé l'application Montréal",
        "score": 370,
        "id": "1gqp00f",
        "url": "https://www.reddit.com/r/montreal/comments/1gqp00f/jai_essayé_lapplication_montréal/",
        "created_utc": 1731535593.0,
        "num_comments": 36,
        "selftext": "Une amie m'a parlé de l'application Montréal avec lequel on peut rapporter toutes sortes de problèmes comme des nids de poule, des vidanges pas ramassées, du mobilier urbain brisé, etc...  J'étais assez sceptique mais j'ai installé l'application.  Dernièrement dans ma ruelle, un réverbère a cessé de fonctionner, en fait il s'est mis à flasher à la manière du Bal-En-Blanc.  J'ai donc utilisé l'application pour rapporter la situation.  3 jours plus tard, le réverbère est réparé!  J'ai même reçu différentes notifications sur l'évolution de ma demande.\n\nJe suis agréablement surpris par l'efficacité de la chose et j'avais envie de partager ce que je considère un bon coup de la ville.  \n\nEt vous, avez-vous eu des expériences avec cette application?",
        "author": "jeanfmartel"
    },
    {
        "title": "Anyone aware of the foundation asking for money at Villa Maria metro?",
        "score": 0,
        "id": "1gqozbb",
        "url": "https://www.reddit.com/r/montreal/comments/1gqozbb/anyone_aware_of_the_foundation_asking_for_money/",
        "created_utc": 1731535538.0,
        "num_comments": 9,
        "selftext": "There are a few people at Villa Maria metro asking for money, for a children’s foundation I have not heard of, the money is supposedly for gift bags for Christmas. I haven’t given any money to it since I’m fairly skeptical, just wondering if anyone has encountered them as of late and what they thought of them?",
        "author": "Top_Contract_4910"
    },
    {
        "title": "Weekly car parking",
        "score": 0,
        "id": "1gqoime",
        "url": "https://www.reddit.com/r/montreal/comments/1gqoime/weekly_car_parking/",
        "created_utc": 1731534358.0,
        "num_comments": 2,
        "selftext": "Weekly car parking\n\nHi montreal\nI’m going to travel outside of Canada for the holidays.\nI was wondering where can i safely park/store my car for three to four weeks for a reasonable price?\n",
        "author": "leeroyklay"
    },
    {
        "title": "Time in Montreal vs Quebec City",
        "score": 0,
        "id": "1gqo8h3",
        "url": "https://www.reddit.com/r/montreal/comments/1gqo8h3/time_in_montreal_vs_quebec_city/",
        "created_utc": 1731533630.0,
        "num_comments": 7,
        "selftext": "Hello all, looking for advice on how much time to spend in Montreal vs Quebec city for a 5 night trip. \n\n\\-Arrive Montreal Monday 5PM. get dinner, maybe check out something? is there anything worth it monday night?\n\nLeave on train to quebec city Tuesday morning.\n\nsomewhere in between wednesday - thursday morning go from quebec city back to montreal \n\nLeave home Saturday 5pm. \n\nMy question is, should i plan two nights in quebec city (Tue-Wed) and two nights in montreal (thursday, Friday), or should i plan only one night in quebec city, maybe leave back to montreal Wednesday afternoon or evening to get a little more time in montreal?\n\nBasically, would you split or spend more time in montreal given my parameters?\n\nThanks in advance!   ",
        "author": "ayayeron"
    },
    {
        "title": "What to order",
        "score": 0,
        "id": "1gqo6cj",
        "url": "https://www.reddit.com/r/montreal/comments/1gqo6cj/what_to_order/",
        "created_utc": 1731533491.0,
        "num_comments": 8,
        "selftext": "What’s the best thing to order on uber eats in mtl? Im a big foodie and im tired of ordering the same thing over and over again🙄 Recommend me your favorite order ! Thksss",
        "author": "Similar_Income8380"
    },
    {
        "title": "Mercier Bridge",
        "score": 0,
        "id": "1gqnpdd",
        "url": "https://i.redd.it/ff5hyf1kiq0e1.jpeg",
        "created_utc": 1731532310.0,
        "num_comments": 4,
        "selftext": "Does anyone know, why the mercier bridge has blue strap all over it ? \n\nI crossed this bridge more often these days to go to montreal and I’m always wondering what these straps are for ? \n\nAre they there to support something thats under the bridge? \n\nThanks! ",
        "author": "Fun-Literature7124"
    },
    {
        "title": "AJA qu'en 1997, Howard Stern a expansé son émission radio, basée à New York, au Canada et l'a diffusé à Montréal sur CHOM-FM. Stern a donné une tirade anti-francophone et anti-française son premier jour sur CHOM.",
        "score": 109,
        "id": "1gqmxg7",
        "url": "https://en.wikipedia.org/wiki/CHOM-FM",
        "created_utc": 1731530353.0,
        "num_comments": 68,
        "selftext": "",
        "author": "throw_and_run_away"
    },
    {
        "title": "Driveway pole/signs",
        "score": 0,
        "id": "1gqmili",
        "url": "https://www.reddit.com/r/montreal/comments/1gqmili/driveway_polesigns/",
        "created_utc": 1731529334.0,
        "num_comments": 4,
        "selftext": "I’m an American currently visiting the Montreal area and I’ve noticed in the suburbs there are colorful poles that have names and phone numbers on them on the edges of most driveways. After doing some googling I’ve found zero info on what they’re for. So what are they?? ",
        "author": "I_know_I_know_not"
    },
    {
        "title": "Recommandations pour un bon tailleur qui peut altérer un manteau en lainage",
        "score": 2,
        "id": "1gqlyhm",
        "url": "https://www.reddit.com/r/montreal/comments/1gqlyhm/recommandations_pour_un_bon_tailleur_qui_peut/",
        "created_utc": 1731527928.0,
        "num_comments": 0,
        "selftext": "Bonjour, comme le titre le dit, j’aimerais vos recommandations pour un bon tailleur qui pourrait faire des altérations à un manteau. Dans le sud ouest de préférence mais ça me dérange pas de me déplacer si ça vaut la peine. J’veux juste pas me ramasser avec quelque chose de tout croche. Merci! ",
        "author": "tidderorsomething"
    },
    {
        "title": "5x en deux jours.. c'est un peu beaucoup, non? 😒",
        "score": 57,
        "id": "1gqkm40",
        "url": "https://i.redd.it/x5ul5a4hvp0e1.jpeg",
        "created_utc": 1731524549.0,
        "num_comments": 39,
        "selftext": "C'est le cinquième pamphlet qui arrive dans ma boîte aux lettres dans Hochelaga en deux jours.. ",
        "author": "julpyz"
    },
    {
        "title": "Construction/White noise on Atwater under hwy 136",
        "score": 0,
        "id": "1gqkl95",
        "url": "https://www.reddit.com/r/montreal/comments/1gqkl95/constructionwhite_noise_on_atwater_under_hwy_136/",
        "created_utc": 1731524494.0,
        "num_comments": 1,
        "selftext": "Anyone else in St Henri/Little Burgundy/Downtown hear this annoying white noise coming from the highway 136 bridge? \n\nIt’s definitely construction noise but I want to know what it is because it’s so loud, it bothers me while I work, and my cat goes crazy wondering what the sound is. It’s been on and off since yesterday.\n\nAnyone do an investigation or know what it is?",
        "author": "cacapoopoobebelala"
    },
    {
        "title": "Best nastiest pizza",
        "score": 92,
        "id": "1gqjt5s",
        "url": "https://www.reddit.com/r/montreal/comments/1gqjt5s/best_nastiest_pizza/",
        "created_utc": 1731522564.0,
        "num_comments": 191,
        "selftext": "Hello dear Montrealers, \n\nI am a girl that is new-ish to Montreal and presently I am on my period and honestly I’ve never needed a NASTELY GREASY AND CHEESY DRIPPING good pizza more in my LIFE!! Where is the best place to find this holy grail? Thank you so much in advance 😅",
        "author": "Low_Function4191"
    },
    {
        "title": "UPDATED: About to become homeless, any tips? ",
        "score": 0,
        "id": "1gqj72b",
        "url": "https://www.reddit.com/r/montreal/comments/1gqj72b/updated_about_to_become_homeless_any_tips/",
        "created_utc": 1731521045.0,
        "num_comments": 4,
        "selftext": "Hi everyone, \n\nI just want to thank everyone for their helps, words of kindness and encouragement, and support from my previous post. \n\nThings haven’t been going well unfortunately. I tried, I really tried my hardest. I’ve called housing and food support resources but I’m in waiting lists or waiting for call backs. I had a job, and they put me on a trial week and then at the end said I didn’t have enough team spirit and they didn’t even pay me(I had to walk 2 hours back and forth from that place, and my stitches are all messed up and my leg is hurting like crazy now). I tried to reconcile and make things better with my landlord but before I could even ask her for a little bit more time she started saying how I’m lazy (even though I take care of the building?!!?) and how I owe her money from previous and from her car(???). I’m out of medication, my cat passed 2 days ago and every time I think or type that out I feel like I’m being destroyed all over again. I’m really not seeing the light at the end of the tunnel. Getting rejected and ghosted for jobs, not having food, no car, no family anymore and I’m really tired of always having to struggle. \n\nAt the behest of some very kind souls out there, here is a gofundme link: \n\nhttps://gofund.me/4e564606\n\nI’m so sorry to have to essentially beg, if you choose to donate please let me know if there’s something I can do in return. I am even willing to pay you back once I have income. \n\nI’m really trying to feel better physically and mentally and gung ho life I’m just having trouble right now. Contemplating just living in the forest until it’s time.  Thanks for reading this long post, I sincerely appreciate it. Have a good day. ",
        "author": "SingSangBingBang"
    },
    {
        "title": "Where can I buy kratom? ",
        "score": 0,
        "id": "1gqiyeo",
        "url": "https://www.reddit.com/r/montreal/comments/1gqiyeo/where_can_i_buy_kratom/",
        "created_utc": 1731520475.0,
        "num_comments": 5,
        "selftext": "Any shops in the city that sell Kratom?  I usually buy it online but my shipment won’t be arriving for a few days and I need it for pain management. \n\nThanks :) \n\n",
        "author": "tiffany__elizabeth"
    },
    {
        "title": "Quebecois-style split pea soup",
        "score": 22,
        "id": "1gqi8iv",
        "url": "https://www.reddit.com/r/montreal/comments/1gqi8iv/quebecoisstyle_split_pea_soup/",
        "created_utc": 1731518690.0,
        "num_comments": 51,
        "selftext": "Soup season is finally here. I want to eat some pea soup. I'm from Western Canada and want to eat Quebecois split pea soup specifically... any restaurant in Montreal that serves a good bowl of this? Or other Quebecois dishes? I want to learn the food culture here. I ate a pudding chomeur the other week and it was mind blowing. Merci en avance.",
        "author": "fleurdesureau"
    },
    {
        "title": "NDG - City garbage collectors smashed back light cover on my car",
        "score": 36,
        "id": "1gqi63g",
        "url": "https://www.reddit.com/gallery/1gqi63g",
        "created_utc": 1731518527.0,
        "num_comments": 48,
        "selftext": "Hey folks looking for a bit of advice. \n\nAs title says, the back light cover on my car was smashed when a large garbage bin was thrown at it (I guess). Obviously this is a speculation as I have photos of only the after math. \n\nWhat is the advice here? It’s a $150 part that I can probably replace myself. I feel like if I do a claim on my insurance I will just pay more in the long run. \n\nI heard some people call 311. Is there any point? Would the city pay for this?\n\nThank you ",
        "author": "Manik_Ronin"
    },
    {
        "title": "Overnight Park &amp; Ride? // Parc relais durant la nuit?",
        "score": 0,
        "id": "1gqi20p",
        "url": "https://www.reddit.com/r/montreal/comments/1gqi20p/overnight_park_ride_parc_relais_durant_la_nuit/",
        "created_utc": 1731518260.0,
        "num_comments": 0,
        "selftext": "\nHello,\n\nMe and my friends are going to the Don Toliver concert and were wondering what’s the best parking for overnight park &amp; rides, since we’ll be too tired to drive back after the concert and thus need to stay the night.\n\nPrice doesn’t matter, we just want the safest option (i.e underground parking which tend to be more safe).\n\nThank you!\n\n//\n\nSalut,\n\nMoi et mes amis nous allons au concert de Don Toliver en venant d’Ottawa, et nous nous demandons ce qui est le meilleur stationnement / parc relais durant la nuit, puisque nous serons trop épuisés pour qu’on se conduisent chez Ottawa après le concert, et donc on aura besoin de rester la nuit.\n\nLe prix nous ne concernent pas, on se concerne presque uniquement de la sécurité (c.a.d les stationnements de sous-sol qui sont plus sécuritaires).\n\nMerci!",
        "author": "SnooComics9354"
    },
    {
        "title": "Where can I find a breakfast sausage like the ones they have at breakfast diners?",
        "score": 43,
        "id": "1gqi0t1",
        "url": "https://i.redd.it/y5c75ptjcp0e1.jpeg",
        "created_utc": 1731518183.0,
        "num_comments": 78,
        "selftext": "I really like the one from nickles, I’ve tried a bunch of breakfast sausages from multiple groceries but I’ve always found them to be disappointing. I want to buy them in big packs not the small packs that that I finish in less then a week 😂.",
        "author": "A_pickled_taco"
    },
    {
        "title": "Kickboxing classes for beginners",
        "score": 0,
        "id": "1gqhqti",
        "url": "https://www.reddit.com/r/montreal/comments/1gqhqti/kickboxing_classes_for_beginners/",
        "created_utc": 1731517500.0,
        "num_comments": 4,
        "selftext": "Hi! I'm looking to sign up for a kickboxing class for women beginners but it seems difficult to find details about stuff like this anywhere or on any websites. Does anyone know of a good place that offers this? Preferably downtown or in the West Island? Something where I can sign up for a class once a week for a certain number of weeks kind of thing.\n\n  \nTYIA!",
        "author": "throwawayyyy628189"
    },
    {
        "title": "Restaurants MTL à TABLE?",
        "score": 0,
        "id": "1gqhn84",
        "url": "https://www.reddit.com/r/montreal/comments/1gqhn84/restaurants_mtl_à_table/",
        "created_utc": 1731517269.0,
        "num_comments": 8,
        "selftext": "English below\n\nC’est l’anniversaire de mon copain, et j’aimerais vraiment lui faire plaisir! Il adore les fruits de mer et a un bon appétit. Est-ce que quelqu’un a été vraiment impressionné par les restaurants de MTL à TABLE? Je suis un peu dépassée par toutes les options. En ce moment, Joséphine et Cérise Café Buvette me semblent de bons choix, mais je n’ai jamais été à l’un ou l’autre. Des recommandations? Merci!!!\n\nEN\n\nIt’s my boyfriend’s birthday and I really want to treat him! He loves seafood and has a big appetite. Has anyone been greatly impressed by the restaurants on MTL à TABLE? I’m overwhelmed with all of the options. Right now, Joséphine and Cérise Cafe Buvette both look like good options, but I’ve never been to either. Any recommendations??? Thank you!",
        "author": "crazeddancer"
    },
    {
        "title": "RAMQ not covering eye care for kids anymore ",
        "score": 0,
        "id": "1gqhlsb",
        "url": "https://www.reddit.com/r/montreal/comments/1gqhlsb/ramq_not_covering_eye_care_for_kids_anymore/",
        "created_utc": 1731517180.0,
        "num_comments": 10,
        "selftext": "A colleague informed me RAMQ won’t be covering eye care for child under 18 anymore as of November 21. \n\nIs this accurate? I checked the RAMQ site but didn’t see anything at all. \n\nAnyone have more insight on this? ",
        "author": "CheesyRomantic"
    },
    {
        "title": "Which stores/restaurants/places that are still open do you get the most nostalgic from?",
        "score": 49,
        "id": "1gqhbwa",
        "url": "https://www.reddit.com/r/montreal/comments/1gqhbwa/which_storesrestaurantsplaces_that_are_still_open/",
        "created_utc": 1731516481.0,
        "num_comments": 61,
        "selftext": "Mine is super easy and I'd love to hear yours. \n\nFor me it's hands down The Bay, especially the downtown location but any Bay location will do.\n\nIt always brings back great memories of shopping with my mom when I was a boy. Especially their toy section on the 5th floor which has now since moved and been downsized.\n\nI haven't been to the downtown Bay in a little while but nostalgia hits hard for me aimlessly wandering around the Bay on a Friday night at 8 pm.\n\nProbably the only thing I miss about working DT was going after work on a Thursday or Friday.\n\nWhen you step into any Bay it feels like time has stood still from a simpler time of yeateryear. ",
        "author": "Optionsislife"
    },
    {
        "title": "Italian associations in Mtl",
        "score": 0,
        "id": "1gqfn0p",
        "url": "https://www.reddit.com/r/montreal/comments/1gqfn0p/italian_associations_in_mtl/",
        "created_utc": 1731512231.0,
        "num_comments": 0,
        "selftext": "Hello, I'm writing an article about Italian associations in Montreal. I know a lot of them are closing down due to lack of participation and funding. If you or someone you know saw your regional association shut down and would be willing to share your feelings, DM me, I would love to talk. ",
        "author": "EditorTerrible2970"
    },
    {
        "title": "Un avion fait pas mal de tours à basse altitude (~525ft) au-dessus de nos têtes en pleine agglomération. Pourquoi? Ce n'est pas normal, right?",
        "score": 35,
        "id": "1gqfgyz",
        "url": "https://i.redd.it/11n8ttkmso0e1.png",
        "created_utc": 1731511795.0,
        "num_comments": 43,
        "selftext": "",
        "author": "silveric"
    },
    {
        "title": "Videotron rate increase lawsuit",
        "score": 18,
        "id": "1gqf60a",
        "url": "/r/VideotronCustomers/comments/1gqf55j/videotron_rate_increase_lawsuit/",
        "created_utc": 1731510999.0,
        "num_comments": 8,
        "selftext": "",
        "author": "PsychopompusJY_KR"
    },
    {
        "title": "Enlevée par ses frères dans un resto: «Elle criait d’appeler le 911»",
        "score": 73,
        "id": "1gq46ah",
        "url": "https://www.tvanouvelles.ca/2024/11/12/enlevee-par-ses-freres-dans-un-resto---elle-criait-dappeler-le-911",
        "created_utc": 1731470055.0,
        "num_comments": 51,
        "selftext": "",
        "author": "John__47"
    },
    {
        "title": "Where can I find the best Cinnamon Buns? ",
        "score": 0,
        "id": "1gqcuc9",
        "url": "https://www.reddit.com/r/montreal/comments/1gqcuc9/where_can_i_find_the_best_cinnamon_buns/",
        "created_utc": 1731504418.0,
        "num_comments": 14,
        "selftext": "Does anyone know where I buy freshly-made cinnamon buns? Gooey &amp; yummy  \n\nNot from grocery stores (they always taste off) \nI’ve had the *BIGGEST* cravings for them for so long and can’t find a bakery that sells them :-(!\n\nPlease and thank you!! &lt;3! ",
        "author": "PrincessRoseDaisy"
    },
    {
        "title": "Fondation Terre Enfants - Arnaque/Scam dans le metro?",
        "score": 15,
        "id": "1gqcrjn",
        "url": "https://www.reddit.com/r/montreal/comments/1gqcrjn/fondation_terre_enfants_arnaquescam_dans_le_metro/",
        "created_utc": 1731504188.0,
        "num_comments": 17,
        "selftext": "Bonjour!  \nJ'ai croisé un groupe de jeunes hommes dans le métro récemment à qui j'ai fait un petit don pour une \"fondation\" appelée Terre Enfants. Je ne trouve pas beaucoup d'information sur eux autre un site web, et page FB/Instagram. Leur plus vieux post datent de juillet de cette année. Ils sont basés au Canada selon ce que j'ai pu lire, mais opèrent en côte d'ivoire. Un de leur post sur instagram à un hashtag #MTL.\n\nCe qui est le plus douteux selon moi est le fait qu'ils acceptent des paiements cash (ils prennent aussi des cartes, sur squareup selon un autre post que j'ai vu, un autre redflag). Il n'essaient pas de prendre des dons mensuels comme les autres ONG. C'est louche parce que pour en effet être capable de payer les canvasseurs et gestionnaires, il faut des dons quand même récurrents. Un 5$ ne couvre a peine quoi que ce soit au niveau administratif...je pense pas que cet argent est allé très loin. Ils semblent distribuer des sacs a dos à des enfants en Côte d'ivoire avec leur logo, mais je ne vois pas ce qu'ils font de concret et ça peut-être une forme de marketing.\n\nAussi sketch est le fait que les canvasseurs des deux groupes que j'ai croisé ont tous l'air de venir du même groupe ethnique. Je ne trouve nulle part des offres d'emploi passées venant de leur organisme, étrange considérant que c'est tout nouveau comme fondation.\n\nUne petit recherche dans le repertoire des organismes de bienfaisance le site de l'ARC ne me donne aucun résultat non plus.\n\nJ'ai fait l'erreur de donner sans me renseigner d'avantage. Pas un gros montant, mais ça me trouble de penser que ça va directement dans leurs poches et ça nuit aux vrais ONG et leurs canvasseurs.\n\nQu'en pensez vous?",
        "author": "jesuispersonne"
    },
    {
        "title": "Local Politician Holding Rally against Bike Lane",
        "score": 204,
        "id": "1gqbcmc",
        "url": "https://i.redd.it/0br9mnhwsn0e1.jpeg",
        "created_utc": 1731499469.0,
        "num_comments": 224,
        "selftext": "Saw this shared within a community fb page and did a little browsing only to find the original poster is a group page filled with right-wing propaganda from the likes of RFK Junior and anti UN propaganda as well. Funny thing is, they misspelled Terrebonne. What are your thoughts?",
        "author": "mtlmonti"
    },
    {
        "title": "Art de la mémoire - Conférence et compétition à venir",
        "score": 6,
        "id": "1gq95yl",
        "url": "https://i.redd.it/ujsu440btm0e1.jpeg",
        "created_utc": 1731490356.0,
        "num_comments": 1,
        "selftext": "",
        "author": "FrancisBlondin"
    },
    {
        "title": "Où s’essayer au violoncelle/ where can I try cello ",
        "score": 0,
        "id": "1gq7ogl",
        "url": "https://www.reddit.com/r/montreal/comments/1gq7ogl/où_sessayer_au_violoncelle_where_can_i_try_cello/",
        "created_utc": 1731483411.0,
        "num_comments": 2,
        "selftext": "English will follow \n\nBonjour, \nJ’ai toujours voulu essayer de jouer du violoncelle malheureusement je n’ai jamais vraiment eu l’occasion d’essayer et aujourd’hui j’aimerais remédier à cela. Connaissez-vous un(e) enseignant(e) qui propose des essais gratuits ou non peu importe(qui fournît l’instrument aussi pour la session d’essai)\nMerci\n\nHi, \nI’ve always wanted to try to play cello but never really had the chance to do back then and I sort want to try it now. Do any of you know a teacher who offers some sort of discovery class (free or not, I don’t mind)? Ideally they would be able to provide the cello as well since I don’t own one. \nThanks \n\n",
        "author": "RevolutionaryFly9349"
    },
    {
        "title": "Bonjour j’aurais besoin de l’aide pour quelque information je me situe à Montréal et j’aimerais devenir perceuse corporel et pratiquer le tongue split c’est vraiment ce que je veu faire dans ma vie et je suis aller dans plusieurs salon personne veulent me montrer que faire ? ",
        "score": 0,
        "id": "1gq64jk",
        "url": "https://www.reddit.com/r/montreal/comments/1gq64jk/bonjour_jaurais_besoin_de_laide_pour_quelque/",
        "created_utc": 1731476956.0,
        "num_comments": 4,
        "selftext": "J’ai postuler , j’ai également envoyez 20 email à plusieurs places , j’ai l’impression que les gens ne veulent pas montrer , il n’a pas non plus de formation vraiment connaissez vous un perceur qui pourrais m’apprendre ? ",
        "author": "Blue_dream_6666"
    },
    {
        "title": "Vielle publicité Québécoise ",
        "score": 120,
        "id": "1gq64gi",
        "url": "https://v.redd.it/iow08ijxxl0e1",
        "created_utc": 1731476947.0,
        "num_comments": 46,
        "selftext": "Je m’en rappelle de cette pub 🤣🥲",
        "author": "Truelyindeed091"
    },
    {
        "title": "Place to get something soldered",
        "score": 0,
        "id": "1gq4vop",
        "url": "https://www.reddit.com/r/montreal/comments/1gq4vop/place_to_get_something_soldered/",
        "created_utc": 1731472452.0,
        "num_comments": 10,
        "selftext": "I have an electronic device and some wires got disconnected.\n\nI thought about buying a soldering iron, but I think it would be too advanced for me.\n\nAnyone know a place that can solder something for me?\n\n  \nThanks!",
        "author": "DestinyUnfollowed"
    },
    {
        "title": "Gun shots downtown ",
        "score": 0,
        "id": "1gq3wdx",
        "url": "https://www.reddit.com/r/montreal/comments/1gq3wdx/gun_shots_downtown/",
        "created_utc": 1731469142.0,
        "num_comments": 9,
        "selftext": "Quelqu'un a entendu les coups de feu au centre-ville ? Quelque chose autour de la rue Sainte-Catherine et de la rue Guy.\nOr I imagine ?",
        "author": "Commercial-Elk-815"
    },
    {
        "title": "What is the White Car With YouTube Logo Recording",
        "score": 0,
        "id": "1gq305r",
        "url": "https://www.reddit.com/r/montreal/comments/1gq305r/what_is_the_white_car_with_youtube_logo_recording/",
        "created_utc": 1731466359.0,
        "num_comments": 4,
        "selftext": "Hi everyone, yesterday I saw a white car with the YouTube logo on the side that had a camera on top of it, similar to the Google Street Views cars. It was on the South Shore near Dix-30. Anyone know what this is about? ",
        "author": "Homework_Successful"
    },
    {
        "title": "I love you MTL; je suis éternellement redevable de l'amour reçu",
        "score": 334,
        "id": "1gq2ukl",
        "url": "https://www.reddit.com/r/montreal/comments/1gq2ukl/i_love_you_mtl_je_suis_éternellement_redevable_de/",
        "created_utc": 1731465875.0,
        "num_comments": 18,
        "selftext": "it was my birthday today and I asked for available people to show up. First of all 50+ people reaching out, it's hard to describe human emotions but it made me feel so happy. I think this was the happjest birthday and some previous ones were really really hard to beat!!! Lots of people couldn't show up because I didn't manage it well but the ones who showed up, absolutely lovely human beings. I am 7 shots down and I don't drink much and I don't even drink if I don't feel safe. About to watch a movie. \n\n\nJust wanted to say this city is wayyyyyyy too kind and loving and I love it here and one day I will return the favour to the city in some or the other way :))",
        "author": "ausernametakenffs"
    },
    {
        "title": "Roommates not paying rent for last month",
        "score": 0,
        "id": "1gq2pu4",
        "url": "https://www.reddit.com/r/montreal/comments/1gq2pu4/roommates_not_paying_rent_for_last_month/",
        "created_utc": 1731465464.0,
        "num_comments": 14,
        "selftext": "two of my roommates are not paying the rent, we all are on the lease. what can i do to get money back from them.",
        "author": "Harshparmar320"
    },
    {
        "title": "Air duct cleaning",
        "score": 0,
        "id": "1gq1y92",
        "url": "https://www.reddit.com/r/montreal/comments/1gq1y92/air_duct_cleaning/",
        "created_utc": 1731463161.0,
        "num_comments": 0,
        "selftext": "Random question: has anyone cleaned their ducts in their homes/apartments themselves?\nIf so, what did you use ? An air whip?",
        "author": "WarmIntroduction5161"
    },
    {
        "title": "C'est-tu moi ou Renaissance est rendu greedy?",
        "score": 269,
        "id": "1gq1oai",
        "url": "https://www.reddit.com/r/montreal/comments/1gq1oai/cesttu_moi_ou_renaissance_est_rendu_greedy/",
        "created_utc": 1731462323.0,
        "num_comments": 114,
        "selftext": "Je magasine chez Renaissance depuis au moins 15 ans. En 15 ans, j'ai vu tout les prix monter, et c'est normal, mais je me questionne sur les prix des items qui ne sont pas des vêtements. Je vois régulièrement des trucs du Dollarama qui sont vendu plus cher! Des affaires vraiment ordinaires vendues super cher (aujourd'hui: une lampe avec un abat-jour sale - 20$; une casserole ben normale -16$, une tasse, man, juste une tasse, 3$, c'est juste des exemples qui me viennent en tête). Man, je me demande si c'est pas moins cher juste aller au Dollarama. Qu'est-ce qui explique cette montée des prix? On dirait que c'est des prix tirage-au-sort. Et je fréquente au moins 4 Renaissance, fèque c'est pas l'affaire de quelques employés qui savent pas bien \"pricer\" les choses. En tout cas, j'ai plus de thrill pantoute d'aller magasiner là. Vous autres?\n\n(Ah oui, pis la section des vêtements \"boutique\", je trouve qu'ils exagèrent. Tsé, des jeans GAP ça vaut-tu vraiment 20$??)",
        "author": "real_legit_unicorn"
    },
    {
        "title": "Recherche d'un piano / Looking for a piano",
        "score": 0,
        "id": "1gq1lfs",
        "url": "https://www.reddit.com/r/montreal/comments/1gq1lfs/recherche_dun_piano_looking_for_a_piano/",
        "created_utc": 1731462081.0,
        "num_comments": 12,
        "selftext": "Bonjour,\n\nJe suis à la recherche d'un piano pour m'entraîner. Malheureusement, j'ai un budget limité et je n'ai pas la possibilité d'en louer un. Tout conseil serait grandement apprécié!\n\n---\nHello,\n\nI am looking for a piano to practice. Unfortunately, I’m on a budget and don’t currently have the ability to rent one. Any pointers would be greatly appreciated!",
        "author": "Difficult-Bee3404"
    },
    {
        "title": "Moving to montreal. Need advice choosing a neighborhood. ",
        "score": 0,
        "id": "1gq18kq",
        "url": "https://www.reddit.com/r/montreal/comments/1gq18kq/moving_to_montreal_need_advice_choosing_a/",
        "created_utc": 1731461019.0,
        "num_comments": 28,
        "selftext": "Parking is a must.  \nShould be very bike friendly. I do have a road bike that i like to do long rides with. Somewhere thats clean and nice looking with parks. Im not really worried about cost but im looking into 1 bed apartments that are either fairly new/well managed. Ways to meet people and enjoy outdoors. Tysm for your input. ",
        "author": "fackmea"
    },
    {
        "title": "ATM double charges ",
        "score": 0,
        "id": "1gq0wor",
        "url": "https://www.reddit.com/r/montreal/comments/1gq0wor/atm_double_charges/",
        "created_utc": 1731460046.0,
        "num_comments": 4,
        "selftext": "Hi folks,\n\nIs anyone else experiencing double charges at the ATM's? \nI'd withdraw cash once for the day at the atm yet my statement displays a double charge",
        "author": "Low-Top7484"
    },
    {
        "title": "Où trouver l’horaire des trains exo à une station spécifique?",
        "score": 0,
        "id": "1gq0ezn",
        "url": "https://www.reddit.com/r/montreal/comments/1gq0ezn/où_trouver_lhoraire_des_trains_exo_à_une_station/",
        "created_utc": 1731458659.0,
        "num_comments": 4,
        "selftext": "Bon, peut-être que je suis nul ou quelque chose du genre mais je n’arrive pas à trouver un simple tableau (genre pdf) qui montre tout les arrivés et départ de trains exo à la station Vendôme.  \n  \nSur le site exo, on peut faire des recherches spécifiques sur une des trois lignes qui y passent, et le site te montre le prochain train de chaque ligne seulement. Sur l’appli Transit on peut planifier un voyage à la fois. Mais nul part je trouve une seule place pour voir tout les horaires au complet dans le but de planifier mes voyagements futur.   \n  \nJe cherche quelques choses, genre comme le gros tableau des trains qu’on voit à la gare centrale. Il me semble que ceci devrait être facile à trouver, mais je trouve rien à travers Google. ",
        "author": "Coachbalrog"
    },
    {
        "title": "J'ai trouvé cette photo sur Facebook..J'ai pensé que certains d'entre vous apprécieront 😉 - It's a reference to a recurring joke here on r/montreal , for those of you who don't know -",
        "score": 0,
        "id": "1gq09za",
        "url": "https://i.redd.it/n5fktc9rck0e1.png",
        "created_utc": 1731458262.0,
        "num_comments": 4,
        "selftext": "",
        "author": "Alpha_Aleph"
    },
    {
        "title": "Does Scotiabank Cinema play films in English?",
        "score": 0,
        "id": "1gq08rm",
        "url": "https://www.reddit.com/r/montreal/comments/1gq08rm/does_scotiabank_cinema_play_films_in_english/",
        "created_utc": 1731458166.0,
        "num_comments": 6,
        "selftext": "Hello, I want to see an American film in IMAX up in Montreal (coming from the U.S.) Do they play movies in English, French, or both? Thanks!",
        "author": "internet_czar"
    },
    {
        "title": "Éthique pourboires pour restaurant avec frais de livraison (pas Uber eats et autres)",
        "score": 3,
        "id": "1gpzx49",
        "url": "https://www.reddit.com/r/montreal/comments/1gpzx49/éthique_pourboires_pour_restaurant_avec_frais_de/",
        "created_utc": 1731457283.0,
        "num_comments": 37,
        "selftext": "Bonsoir, un dilemne encore une fois concernant les pourboires pour livraison.\n\nMa copine a commandé d'un restaurant a 2km de sa maison et pour une commande de 26$ +4$ de frais de livraison.\n\nElle donne ensuite sur la platforme tel que suggéré 5% (avant Frais de livraison)comme pourboir, puisque frais de livraisons.\n\nLe livreur au moment de la livraison lui dit alors as-tu d'autres chose pour moi. Elle n'avait pas de cash ou quoique ce soit et a déjà payée beaucoup plus que si elle avait fait un pick up ou service au table.\n\n\nC'est quoi l'éthique derrière Ca?\n\nLe 4$ va où aussi?\n\nElle vient d'un contient sans pourboires et considérait que les frais d'extra agissait comme paiement jusqu'à un certain point.\n\n\nVos opinions?",
        "author": "Terrebonniandadlife"
    },
    {
        "title": "When Montreal opened the Pie-IX BRT, the asphalt was subtly tinted red but apparently it wasn't bright enough to make it clear the lanes were for busses only. So this time, for the Henri-Bourassa BRT they went \"f*ck subtlety\".",
        "score": 574,
        "id": "1gpz1wv",
        "url": "https://i.redd.it/xlf38ui64k0e1.jpeg",
        "created_utc": 1731454875.0,
        "num_comments": 87,
        "selftext": "",
        "author": "janiceian1983"
    },
    {
        "title": "Restaurant recommendations and activities",
        "score": 0,
        "id": "1gpyfar",
        "url": "https://www.reddit.com/r/montreal/comments/1gpyfar/restaurant_recommendations_and_activities/",
        "created_utc": 1731453127.0,
        "num_comments": 3,
        "selftext": "Bonjour! Hi!\nI was curious to know if any of you had any fine dining recommendations? My fiancé loves fine dining, and as do I, however his birthday is in a month and I wanted to take him out on a date. We’ve been to Hiatus, Bis and Portus360, and he’s enjoyed them all. He’s especially a big fan of truffle or of any beef options (he likes oysters too but doesn’t like lobster). Let me know what you suggest!\n\nI also wanted to sort of look into an activity we could do together afterwards. We both very much enjoy escape rooms, Ceramic Cafe, and we most recently went to the Museum of Illusions close to the Old Port. If you have any suggestions for that type of thing as well, do let me know! ",
        "author": "fartingconstantly101"
    },
    {
        "title": "Cybertruck on the road",
        "score": 0,
        "id": "1gpxqa5",
        "url": "https://v.redd.it/yhyozx2ltj0e1",
        "created_utc": 1731451271.0,
        "num_comments": 13,
        "selftext": "First time seeing one in person and I’m both surprised on how ridiculously large it is and how awkward it looks. ",
        "author": "Bearington656"
    },
    {
        "title": "Billets à donner",
        "score": 19,
        "id": "1gpx8v8",
        "url": "https://www.reddit.com/r/montreal/comments/1gpx8v8/billets_à_donner/",
        "created_utc": 1731450006.0,
        "num_comments": 5,
        "selftext": "Salut j'ai pas réussi a vendre mes billets je préfère les donner quils soient perdu donc 2 billets pour Thee sacred souls se soir au mtelus",
        "author": "AstrologicalMistake"
    },
    {
        "title": "Qu'est ce que vous en pensez?",
        "score": 0,
        "id": "1gpwswl",
        "url": "https://i.redd.it/tosvbkhemj0e1.jpeg",
        "created_utc": 1731448857.0,
        "num_comments": 18,
        "selftext": "Je viens de voir cette annonce sur marketplace. Je passe assez du temps sur marketplace pour reconnaître une mauvaise deal/blague. Par contre, il y a quelque chose qui me fait repenser à propos de l'annonce; on dirait même un \"gut feeling\". Ca n'as pas l'air d'être une photo prise ici mais quand même haha. Je laisse un link qui vous dirige vers le post directement.\nhttps://www.facebook.com/share\n/sjR1pRQPveeUdrEX/",
        "author": "burning_abtz"
    },
    {
        "title": "Voie maritime du Saint-Laurent | Le repavage de la piste cyclable repoussé à 2025",
        "score": 12,
        "id": "1gpwh6m",
        "url": "https://www.lapresse.ca/actualites/grand-montreal/2024-11-12/voie-maritime-du-saint-laurent/le-repavage-de-la-piste-cyclable-repousse-a-2025.php",
        "created_utc": 1731448034.0,
        "num_comments": 1,
        "selftext": "",
        "author": "clgoh"
    },
    {
        "title": "anyone been to Angell Woods?",
        "score": 0,
        "id": "1gpwdkt",
        "url": "https://www.reddit.com/r/montreal/comments/1gpwdkt/anyone_been_to_angell_woods/",
        "created_utc": 1731447780.0,
        "num_comments": 3,
        "selftext": "Are there fees to get in? Do you recommend it? I'm looking for a forest or such that is quiet and secluded",
        "author": "momo326"
    },
    {
        "title": "My cat got stolen. Mon chat cest fait voler ",
        "score": 1,
        "id": "1gpvi3p",
        "url": "https://www.reddit.com/gallery/1gpvi3p",
        "created_utc": 1731445588.0,
        "num_comments": 7,
        "selftext": "",
        "author": "Cultural_Safe2240"
    },
    {
        "title": "Wedding Planner - Experience with Hindu/Sikh weddings",
        "score": 0,
        "id": "1gpvhdu",
        "url": "https://www.reddit.com/r/montreal/comments/1gpvhdu/wedding_planner_experience_with_hindusikh_weddings/",
        "created_utc": 1731445538.0,
        "num_comments": 1,
        "selftext": "# Montreal redditors, anyone know of a creative affordable wedding planner, specifically for Hindu/Sikh weddings? I moved to the US so I really need someone local that can help.",
        "author": "One_Push6957"
    },
    {
        "title": "Est-ce encore possible de se bâtir à Montréal?",
        "score": 28,
        "id": "1gpuvz2",
        "url": "https://ici.radio-canada.ca/info/long-format/2118160/delais-permis-montreal-construction-version-longue",
        "created_utc": 1731444087.0,
        "num_comments": 16,
        "selftext": "",
        "author": "Archeob"
    },
    {
        "title": "Meilleure heure pour aller à l'Eco Centre?",
        "score": 4,
        "id": "1gputxw",
        "url": "https://www.reddit.com/r/montreal/comments/1gputxw/meilleure_heure_pour_aller_à_leco_centre/",
        "created_utc": 1731443948.0,
        "num_comments": 4,
        "selftext": "J'ai des déchets de construction à jeter. Je viens de me buter à une file interminable à L'école Centre St-Michel. Est-ce qu'il y a une heure dans la journée ou l'attente est moins pire?",
        "author": "Campoozmstnz"
    },
    {
        "title": "Any reputable Trading Card Shops?",
        "score": 0,
        "id": "1gpurxc",
        "url": "https://www.reddit.com/r/montreal/comments/1gpurxc/any_reputable_trading_card_shops/",
        "created_utc": 1731443814.0,
        "num_comments": 15,
        "selftext": "I’m wanting to sell some Pokémon Cards… also get some graded if the shop offers bundle grading. I was hoping somebody here will know of a place that offers such a service.\n\nNo I’m not going to sell them to Reddit folks, unless said Reddit folks are card shop employees \n\n\n\n",
        "author": "BlonkisOdonnelly"
    },
    {
        "title": "Trump is 'looming' over port dispute as labour minister warns against 'economic self-destruction'",
        "score": 0,
        "id": "1gptgio",
        "url": "https://nationalpost.com/news/canada/labour-minister-trump-arbitration-port-dispute?utm_source=reddit&amp;utm_medium=organic&amp;utm_campaign=NP_social",
        "created_utc": 1731440530.0,
        "num_comments": 5,
        "selftext": "",
        "author": "nationalpost"
    },
    {
        "title": "Can anyone suggest a bang-for-buck place for espresso beans (large 5lb bags ideal if possible)",
        "score": 0,
        "id": "1gpt0er",
        "url": "https://www.reddit.com/r/montreal/comments/1gpt0er/can_anyone_suggest_a_bangforbuck_place_for/",
        "created_utc": 1731439450.0,
        "num_comments": 10,
        "selftext": "I'm in Ottawa, but will be in MTL for the day shortly. Cafe Olympico (which I love in every way) has a great price for espresso beans, but wanted to check with the MTLers if they have other suggestions.\n\nMerci!",
        "author": "riz7242"
    },
    {
        "title": "Where can I find some jungle music?!",
        "score": 0,
        "id": "1gpsa5t",
        "url": "https://www.reddit.com/r/montreal/comments/1gpsa5t/where_can_i_find_some_jungle_music/",
        "created_utc": 1731437686.0,
        "num_comments": 8,
        "selftext": "Ok y'all I need it like a drug. I need to dance for multiple hours on some deep jungle. Where can I find this in montreal regularly ???? PLeAZE",
        "author": "Skratifyx"
    },
    {
        "title": "Emplois dans le VFX et le jeu vidéo s'écroule",
        "score": 232,
        "id": "1gps7h6",
        "url": "https://www.reddit.com/r/montreal/comments/1gps7h6/emplois_dans_le_vfx_et_le_jeu_vidéo_sécroule/",
        "created_utc": 1731437490.0,
        "num_comments": 127,
        "selftext": "Pour ceux qui sont dans le domaine du jeu vidéo ou du VFX, je compatie. En ce moment, c'est comme jouer à la chaise musicale, tout ceux qui ont un poste sont assis et en sécurité et ceux qui cherchent sont désesperés. Mais même pour ceux qui ont une job, il y a comme un nuage incertain qui plane. On ne sait jamais s'il va y avoir des coupures. \n\nEn plus de la grève des scénaristes aux États-Unis, des mises à pieds de 2023, là il y a eu Papa Legault qui tire la plug sur les subventions, c'est catastrophique. \n\nJe suis freelance et en ce moment, il n'y a rien depuis octobre. Je vois des gens qui change de domaine, pas le choix.\n\nÇa va les artistes/ techniciens? Moi je commence à rusher.",
        "author": "Thierry22"
    },
    {
        "title": "Enlevé dans le Vieux-Montréal: le corps décomposé de Kevin Mirshahi retrouvé au parc de la visitation.",
        "score": 35,
        "id": "1gprpnp",
        "url": "https://www.journaldemontreal.com/2024/11/12/enleve-dans-le-vieux-montreal-le-corps-decompose-de-kevin-mirshahi-retrouve",
        "created_utc": 1731436278.0,
        "num_comments": 32,
        "selftext": "C’était pas un meurtre au hasard.",
        "author": "Truelyindeed091"
    },
    {
        "title": "Des enseignes de commerces du passé",
        "score": 463,
        "id": "1gprmkq",
        "url": "https://www.reddit.com/gallery/1gprmkq",
        "created_utc": 1731436069.0,
        "num_comments": 62,
        "selftext": "",
        "author": "Lord-Velveeta"
    },
    {
        "title": "1976,Decarie Highway",
        "score": 85,
        "id": "1gpr57y",
        "url": "https://i.redd.it/7nxjn2qygi0e1.jpeg",
        "created_utc": 1731434920.0,
        "num_comments": 47,
        "selftext": "",
        "author": "brolbo"
    },
    {
        "title": "French Tiktokers",
        "score": 0,
        "id": "1gpr4t7",
        "url": "https://www.reddit.com/r/montreal/comments/1gpr4t7/french_tiktokers/",
        "created_utc": 1731434891.0,
        "num_comments": 4,
        "selftext": "What do you guys think of these tiktokers from France who are staying in Montreal? I know some of them likes to complain but others are genuinely appreciative of the city. ",
        "author": "AmiCal13"
    },
    {
        "title": "Tinashe at mtelus on Nov 10 , who was the opening dj before the opening act ? If anyone went and knows the name of the dj please lmk ! ",
        "score": 0,
        "id": "1gpqvrb",
        "url": "https://www.reddit.com/r/montreal/comments/1gpqvrb/tinashe_at_mtelus_on_nov_10_who_was_the_opening/",
        "created_utc": 1731434302.0,
        "num_comments": 1,
        "selftext": "Tinashe at mtelus on Nov 10 , who was the opening dj before the opening act ? If anyone went and knows the name of the dj please lmk ! Would e greatly appreciated thank you !",
        "author": "tonypotenza"
    },
    {
        "title": "New Hobby in Town (Cote des Neiges)",
        "score": 117,
        "id": "1gpqbip",
        "url": "https://v.redd.it/5267715wai0e1",
        "created_utc": 1731432898.0,
        "num_comments": 34,
        "selftext": "",
        "author": "Single-Chair2580"
    },
    {
        "title": "Thank you Montreal!",
        "score": 17,
        "id": "1gpptq6",
        "url": "https://www.reddit.com/r/montreal/comments/1gpptq6/thank_you_montreal/",
        "created_utc": 1731431688.0,
        "num_comments": 5,
        "selftext": "After a decades long hiatus, I took up tennis again this summer. Hats off to the City of Montreal and the staff at Parc Jeanne-Mance for an incredible summer of tennis. The city does a great job taking care of the courts and the staff was so wonderful as I pushed myself to use more French to communicate. (US citizen here.) Being greeted with a Bonjour and a smile really made my day every time I went. We are fortunate to have such great facilities and kind people!",
        "author": "SwimGuyMA"
    },
    {
        "title": "American escaping Americans - ideas?",
        "score": 0,
        "id": "1gpp9s1",
        "url": "https://www.reddit.com/r/montreal/comments/1gpp9s1/american_escaping_americans_ideas/",
        "created_utc": 1731430328.0,
        "num_comments": 23,
        "selftext": "I'm a 45 year old male New Yorker deeply unhappy with my current social situation.\n\nTo that end, I've booked a month up in Montréal to study and read and practice French and maybe cross country ski and just enjoy life for a while.\n\nI am open to any and all suggestions for cultural immersion and experiences that may come my way...please offer what you will...thank you!",
        "author": "No_Macaron_4163"
    },
    {
        "title": "Any recommendations for a restaurant serving indigenous food?",
        "score": 34,
        "id": "1gpoctz",
        "url": "https://www.reddit.com/r/montreal/comments/1gpoctz/any_recommendations_for_a_restaurant_serving/",
        "created_utc": 1731428071.0,
        "num_comments": 15,
        "selftext": "I have recently had some rally good news regarding my immigration status in Canada, and will like to celebrate be eating some indigenous food.\n\nAre there any restaurants in the city working with traditional ingredients or plates?",
        "author": "ElColosoDeLa53"
    },
    {
        "title": "Videotron D2D agent/ agent porte-à-porte",
        "score": 0,
        "id": "1gpn3j0",
        "url": "https://www.reddit.com/r/montreal/comments/1gpn3j0/videotron_d2d_agent_agent_porteàporte/",
        "created_utc": 1731424829.0,
        "num_comments": 1,
        "selftext": "EN: Does anyone have the contact information for a Videotron independent/door-to-door agent? I've heard they have good deals and I'm curious about what they could offer me since I'm moving\n\nFR: Quelqu'un a les coordonnées d'un agent indépendant ou de porte-à-porte de Vidéotron ? J'ai entendu dire qu'ils avaient de bonnes offres et je suis curieux de savoir ce qu'ils pourraient me proposer étant donné que je déménage",
        "author": "SubjectMedium7048"
    },
    {
        "title": "Foulab (Montreal hackerspace) events - November 2024",
        "score": 9,
        "id": "1gpmqz8",
        "url": "https://foulab.org/news/events-november-2024/",
        "created_utc": 1731423909.0,
        "num_comments": 2,
        "selftext": "",
        "author": "eigma"
    },
    {
        "title": "Seed-oil free restaurants",
        "score": 0,
        "id": "1gpmdp9",
        "url": "https://www.reddit.com/r/montreal/comments/1gpmdp9/seedoil_free_restaurants/",
        "created_utc": 1731422914.0,
        "num_comments": 4,
        "selftext": "Does anyone know where i can eat out with no seed oils? I consume tallow, butter, ghee, lard and coconut oil as frying oils. Seed oils break me out unfortunately.",
        "author": "Feisty_Lawfulness105"
    },
    {
        "title": "Question regarding parking, vehicle registration, and driver's license exchange after moving to Montreal",
        "score": 0,
        "id": "1gpm86b",
        "url": "https://www.reddit.com/r/montreal/comments/1gpm86b/question_regarding_parking_vehicle_registration/",
        "created_utc": 1731422489.0,
        "num_comments": 4,
        "selftext": "I am planning to move from Ontario to Montreal next month. After the move, I have several questions regarding parking, vehicle registration, and driver’s license exchange. I am currently learning French, so I apologize for asking in English. 🙏\n\n1.\tParking Permit\n\nMy new residence requires street parking, and I plan to use public transportation to commute to downtown during weekdays. Therefore, I will need to park my car in the street parking area near my home. However, I noticed that only permit holders can use these spots. I intend to apply for a permit (zone sticker) immediately after moving in. The required documents include the vehicle registration, identification, and proof of residence. My question is: Is it necessary for the vehicle to be registered in Quebec to obtain the permit? Are only vehicles registered in Quebec eligible to apply?\n\n2.\tVehicle Registration\n\nTo register my vehicle, I understand that I need the vehicle registration, ownership certificate, insurance certificate, and driver’s license from my previous residence. Additionally, I have heard that an inspection is required, which can be done at designated SAAQ locations. I plan to make an appointment and inquire about the necessary inspections during the registration process. However, I have been informed that vehicles from other provinces are subject to inspection. Wouldn’t it be more time-efficient to have the inspection done directly at the designated location during registration? My car is a 2019 compact SUV with approximately 60,000 km and has no accident history. Also, I would like to confirm whether it is possible to register the vehicle and obtain Quebec license plates without exchanging my driver’s license.\n\n3.\tDriver’s License Exchange\n\nI have heard that exchanging a driver’s license takes approximately 2 to 3 months. Is this timeframe accurate?\n\n",
        "author": "Jutopia123"
    },
    {
        "title": "Lost phone",
        "score": 11,
        "id": "1gplnbo",
        "url": "https://www.reddit.com/r/montreal/comments/1gplnbo/lost_phone/",
        "created_utc": 1731420858.0,
        "num_comments": 4,
        "selftext": "I hope this somehow reaches the owner- someone dropped a white google phone in the metro this morning, on the green line headed in the Angrignon direction. I left it with the employee at the kiosk at Angrignon. ",
        "author": "i_appear_missing_1"
    },
    {
        "title": "What are some groups I can join to improve my French?",
        "score": 17,
        "id": "1gpl81o",
        "url": "https://www.reddit.com/r/montreal/comments/1gpl81o/what_are_some_groups_i_can_join_to_improve_my/",
        "created_utc": 1731419639.0,
        "num_comments": 33,
        "selftext": "I have been living in anglophone bubble right now, I am doing pretty good with reading, listening but I need to improve my speaking. Are there group activities that are in french and in person. ",
        "author": "Harshparmar320"
    },
    {
        "title": "Problèmes de consommation et d’intimidation: La STM ferme un édicule du métro Atwater pour l’hiver",
        "score": 189,
        "id": "1gpi0yg",
        "url": "https://www.lapresse.ca/actualites/grand-montreal/2024-11-12/problemes-de-consommation-et-d-intimidation/la-stm-ferme-un-edicule-du-metro-atwater-pour-l-hiver.php",
        "created_utc": 1731408586.0,
        "num_comments": 127,
        "selftext": "",
        "author": "Separate_Football914"
    },
    {
        "title": "Donating large furniture ",
        "score": 0,
        "id": "1gpexee",
        "url": "https://www.reddit.com/r/montreal/comments/1gpexee/donating_large_furniture/",
        "created_utc": 1731394464.0,
        "num_comments": 17,
        "selftext": "I am supposed to be cleaning out my parents house in Broussard area. They have downsized their house and have moved to the west coast and won’t be needing most of their furniture; beds, tables, couch, hutches, etc. \n\nI have a very short time to clear out their house so putting stuff on Kajiji or trying to sell them is not really an option. Is there a place I can just call for them to pick things up for donation? Or any other advice? \n\n\n\nEdit 1: thank you all for the great suggestion, really appreciate it. I will definitely give all of them a try to get the most of the stuff out of the house. ",
        "author": "47DegreesNorth"
    },
    {
        "title": "What is the washroom situation at L’Olympia theatre? ",
        "score": 0,
        "id": "1gpd8ob",
        "url": "https://www.reddit.com/r/montreal/comments/1gpd8ob/what_is_the_washroom_situation_at_lolympia_theatre/",
        "created_utc": 1731387873.0,
        "num_comments": 9,
        "selftext": "Bonjour, i am visiting Montreal for a week. I want to visit the theatre at night. Are there universal bathrooms or trans washrooms at L’Olympia theatre? I am staying in the gay village downtown so hopefully there are activities LGBT activities to do.",
        "author": "thewealthycd6"
    },
    {
        "title": "A surreal couple of days in your beautiful city ❤️",
        "score": 745,
        "id": "1gpciln",
        "url": "https://www.reddit.com/gallery/1gpciln",
        "created_utc": 1731385394.0,
        "num_comments": 29,
        "selftext": "We tried to soak in as much of Montreal’s hospitality as possible in the two short but magical days my wife and I spent in your charming city. Thank you for having us, and we wish to come back again soon!",
        "author": "rvvind"
    },
    {
        "title": "Retrouver un témoin (accident vélo-camion) 15-10-2024",
        "score": 22,
        "id": "1gpcaca",
        "url": "https://www.reddit.com/r/montreal/comments/1gpcaca/retrouver_un_témoin_accident_vélocamion_15102024/",
        "created_utc": 1731384646.0,
        "num_comments": 28,
        "selftext": "Alors voilà, j’ai été frappée par un camion Qualinet le 15 octobre 2024 alors que j’étais sur la piste cyclable au croisement St-Denis et Boucher et que le signalement lumineux pour le vélo était au vert. Le camion Qualinet a tourné sur la droite alors qu’il n’avait pas encore la signalisation pour tourner.\n\nHeureusement je n’ai rien eu, mais le camion a roulé sur ma bicyclette et elle est en très mauvais état (perte totale). J’ai fait sortir le rapport d’accident, mais celui-ci ne dit pas grand chose à part les gens impliqués (il ne dit pas c’est la faute à qui). Enfin! J’aimerais savoir si quelqu’un à vu l’accident? Je me souviens d’un jeune homme de mon âge (environ 30 ans) qui s’est arrêté pour me demander si j’allais bien. \n\nLa compagnie est de mauvaise foi et dit que c’était un accident 50-50 ce qui est complètement absurde. Je souhaite envoyer une mise en demeure, mais j’aimerais mettre toutes les chances de mon côté. ",
        "author": "eastcoastgirl23"
    },
    {
        "title": "Looking for advice. Is there any way for international students to get into culinary?",
        "score": 0,
        "id": "1gopp2u",
        "url": "https://www.reddit.com/r/montreal/comments/1gopp2u/looking_for_advice_is_there_any_way_for/",
        "created_utc": 1731322975.0,
        "num_comments": 2,
        "selftext": "Hope you’re all well. I’m not sure if this is the right place to ask, but I couldn’t think of a better community to seek support and advice from. As I’m still unfamiliar with the country and looking to find a sense of community, I ended up here on Reddit, which I’m new to. So, please don't downvote me.\n\nI was wondering if there is any way I could join a culinary school preferably for the pastry program. But based on what I have heard from a lot of chefs, real learning happens when cooking in a restaurant, not at school. They say culinary schools are not necessary. So, any opportunity to work/learn in a restaurant is more preferred - but tbh, I am not very sure.\n\nI am an international student from Bangladesh, though I lived mostly in Oman. I just began my third month here in Montreal or Canada for that matters. I am currently 26 and am studying MSc in Applied Computer Science at Concordia University. However, I have always wanted to become a chef in cooking or pastry as they both interest me a lot. However, I could not find opportunity in the country I come from to develop my skills and move towards my dream. And, honestly, I even struggled to get a good job in my field of study with a bachelor's in Computer science. I in some sense was bound to study Master’s in the hope that I could perhaps find a better career in my country. But, after all these grueling years, I barely want to study anymore. Studying for a master's has now become torture to me – and I feel like being trapped in this loop of endless depression and anxiety.\n\nSo, is there any way I could drop out of university and pursue my interest? And, above all, I am not even sure if I can join a workplace and learn. My study permit does allow me to work, but only as a student.  Are the international students even allowed to do so? I am lost and helpless. Any good advice, recommendation, or any other help is deeply appreciated. Thanks.",
        "author": "RoughNotice700"
    },
    {
        "title": "Anyone know what’s happening at the airport? ",
        "score": 240,
        "id": "1gpbe9p",
        "url": "https://www.reddit.com/r/montreal/comments/1gpbe9p/anyone_know_whats_happening_at_the_airport/",
        "created_utc": 1731381726.0,
        "num_comments": 70,
        "selftext": "I just landed and the entire airport has been evacuated and we have been told to hold off from entering. Noticing a really big police presence. Trying to find any bit of news",
        "author": "AY88"
    },
    {
        "title": "Why is Metro selling rotten fruits ?... yes, Metro at Galerie du Parc... rotten fruit on sale",
        "score": 0,
        "id": "1gpa935",
        "url": "https://www.reddit.com/r/montreal/comments/1gpa935/why_is_metro_selling_rotten_fruits_yes_metro_at/",
        "created_utc": 1731378160.0,
        "num_comments": 15,
        "selftext": "I went yesterday shopping at Metro, the store at Galerie du Parc, I saw the tangerines were on sale, I went to the shelve to get a bag and most of the bags had one or two tangerines in an advanced state of decay, or were moldy. Why is a supermarket allowed to sell rotten fruits, even at a discount ?\n\nhttps://preview.redd.it/okjjunv3sd0e1.jpg?width=3468&amp;format=pjpg&amp;auto=webp&amp;s=5e03e8f0b402b43f6665a10f71a40f6c2d66b753\n\nhttps://preview.redd.it/is3a1vv3sd0e1.jpg?width=3468&amp;format=pjpg&amp;auto=webp&amp;s=eed553584474d49a186d13934bd089d6d6d27ba5\n\n",
        "author": "PuzzleheadedOne3841"
    },
    {
        "title": "La circulation à montréal ",
        "score": 5,
        "id": "1gpa5he",
        "url": "https://www.reddit.com/r/montreal/comments/1gpa5he/la_circulation_à_montréal/",
        "created_utc": 1731377861.0,
        "num_comments": 24,
        "selftext": "Salut reddit, je suis étudiant en secondaire 5 sur la Rive-Sud et je vais probablement être pensionnaire au CEGEP Saint-Anne à Lachine. Je suis pratiquant de MMA et j’ai l’intention d’aller m’entraîner au gym H2O MMA se situant sur le boulevard Monk. Google maps me dit que c’est 15 minutes d’auto en passant soit par la rue Saint-Patrick ou par Saint-Joseph, puis Notre-Dame pour arriver au boulevard Monk. Je ne connais pas très bien les rues et l’état de la circulation à Montréal autour de 5-6h mais ça m’inquiète un peu, et je me demandais si ce 15 minutes que suggère Google Maps est réaliste, et s’il ne l’est pas est-ce que le trajet serait plus rapide à vélo? Désolé du post très spécifique, je suis simplement curieux de savoir comment je vais pouvoir m’organiser. Merci!",
        "author": "Comrade_KermitYT"
    },
    {
        "title": "Running in the dark",
        "score": 0,
        "id": "1gpa4vh",
        "url": "https://www.reddit.com/r/montreal/comments/1gpa4vh/running_in_the_dark/",
        "created_utc": 1731377814.0,
        "num_comments": 6,
        "selftext": "Hey Montrealers,\n\nI’ve started running late in the summer and want to try to keep it up. With the time change though, it’s pitch black when I get in from work.\n\nIn Verdun where I live the street lights are abysmal, so I’m looking for some recommendations for well-lit areas or even tracks for an evening run!\n\nThanks! ",
        "author": "katduckworth"
    },
    {
        "title": "Can someone give me a suggestion for a good trivia spot near NDG?",
        "score": 0,
        "id": "1gpa02z",
        "url": "https://www.reddit.com/r/montreal/comments/1gpa02z/can_someone_give_me_a_suggestion_for_a_good/",
        "created_utc": 1731377418.0,
        "num_comments": 12,
        "selftext": "I used to go to trivia back home and I'm trying somewhere new in Montreal! Ideally somewhere local around NDG that does it regularly? Ideally earlier in the week! Thank you so much for your help!!",
        "author": "Margo123456789"
    },
    {
        "title": "Piqué par une seringue souillée en tentant de ramasser ses clefs",
        "score": 31,
        "id": "1gp9vy9",
        "url": "https://www.reddit.com/r/montreal/comments/1gp9vy9/piqué_par_une_seringue_souillée_en_tentant_de/",
        "created_utc": 1731377076.0,
        "num_comments": 38,
        "selftext": "Un vrai cauchemar! Comment se mobiliser et/ou se rassurer pour la suite?\n\nPiqué par une seringue souillée en tentant de ramasser ses clefs https://lp.ca/bcrDim?sharing=true",
        "author": "AssociationOk3261"
    },
    {
        "title": "Duck on parkometers? ",
        "score": 42,
        "id": "1gp98ij",
        "url": "https://i.redd.it/pef31ql6jd0e1.jpeg",
        "created_utc": 1731375131.0,
        "num_comments": 31,
        "selftext": "Does anyone know why there are duck stickers on parkers on Peel Street?\n",
        "author": "yandq"
    },
    {
        "title": "The sky was so blue yesterday.",
        "score": 41,
        "id": "1gp8tbo",
        "url": "https://i.redd.it/qnxk65elfd0e1.jpeg",
        "created_utc": 1731373925.0,
        "num_comments": 14,
        "selftext": "Taken around 4pm",
        "author": "sickseveneight"
    }
]