[
    {
        "title": "🏐 volleyball bloopers but this time we're mic'd up 🏐",
        "score": 1,
        "id": "1gsbwbk",
        "url": "https://www.youtube.com/watch?v=U04F2OQPP5s",
        "created_utc": 1731719377.0,
        "num_comments": 0,
        "selftext": "",
        "author": "AsTheyCollide"
    },
    {
        "title": "I just landed my first kill block after starting volleyball maybe 2 months ago, holy hell this sport is amazing. I'm hooked.",
        "score": 32,
        "id": "1gs8e5d",
        "url": "https://www.reddit.com/r/volleyball/comments/1gs8e5d/i_just_landed_my_first_kill_block_after_starting/",
        "created_utc": 1731709214.0,
        "num_comments": 11,
        "selftext": "",
        "author": "GTylker"
    },
    {
        "title": "How did you get into playing volleyball?",
        "score": 2,
        "id": "1gs1bx3",
        "url": "https://www.reddit.com/r/volleyball/comments/1gs1bx3/how_did_you_get_into_playing_volleyball/",
        "created_utc": 1731690840.0,
        "num_comments": 6,
        "selftext": "Hi. I was just curious how all of you that play volleyball actually got into it? What’s the story behind that. I’m sure it’s very interesting:3 \n\nFor me my parents forced me to play when I was younger cus I hated soccer and they wanted me to do a sport. I didn’t like volleyball at first but now I really enjoy it and play for my high school team!!",
        "author": "SavBananana"
    },
    {
        "title": "Got a headcam",
        "score": 6,
        "id": "1gryint",
        "url": "https://v.redd.it/xub2zjia031e1",
        "created_utc": 1731683584.0,
        "num_comments": 9,
        "selftext": "Pretty cool too bad battery lasts less than an hour",
        "author": "aaronvillaosme"
    },
    {
        "title": "How to improve my form",
        "score": 0,
        "id": "1grwuov",
        "url": "https://v.redd.it/3djl4838m21e1",
        "created_utc": 1731678829.0,
        "num_comments": 9,
        "selftext": "15M practising only",
        "author": "Ok-Science-1262"
    },
    {
        "title": "How to deal with injuring a teammate",
        "score": 18,
        "id": "1grwtrt",
        "url": "https://www.reddit.com/r/volleyball/comments/1grwtrt/how_to_deal_with_injuring_a_teammate/",
        "created_utc": 1731678749.0,
        "num_comments": 35,
        "selftext": "Im 21 y/o and play volleyball since around 4 years (with around a year of injury break).\n\nI just moved cities and started playing for a club on a pretty high level. Im not good enough, but the Coach is really supportive and wants me to participate to get better, since he likes my foundations.\n\nNow i have been training there for not even 2 months and the training is hard and i feel out of place, however, the teammates and especially the coach are very encouraging and i really admire the coach.\n\nYesterday was practice, and i wasnt sure if i should come, since i was the last week sick, but then i decided to join the training. \n\nWe were barely enought with 8 people and started with the training. \n\nWe did some spiking/blocking drilll and i felt quite good. Then there was a really close set to the net, but i tried to spike it.\n\nI spiked it, but then when i landed i saw that my foot was on the line. I got scared and saw in the same moment the coach who was blocking me landed on my foot. \n\nFor a brief moment everything seemed ok, but then his leg started shaking and twisting on my foot, he landed on the ground, and screamed. The outside band of his foot is most likely ruptured. \n\nHe most likely wont be able to conitue with the saison, and he is probably one of the most experience players in the Team and the captain.\n\nAnother player told me that the coach has already dealt with (really really terrible) ankle sprains on both ankles. \n\nHe went straight to the Hospital, i wrote him a message, apologized.\n\nHe said that things like that happens and i just have to learn from it and every is alright.\n\nI asked him to tell me the diagnosis as soon as he knows it, but he hasnt answered yet.\n\nI feel terrible and that i should leave the club. Every since i joined i had no positive impact on the training and even injured one of the most important peoples in the team.\n\nI want to play again, but i also feel to scared that something like that will Happen again.\n\nHas anyone experienced something similar?",
        "author": "Icy-Trust-8563"
    },
    {
        "title": "Why isn’t a technology similar to 'Connected Ball Technology' used to help referees detect block touches?",
        "score": 59,
        "id": "1grvzbs",
        "url": "https://i.redd.it/hkmnat3ae21e1.png",
        "created_utc": 1731676162.0,
        "num_comments": 29,
        "selftext": "",
        "author": "FollowSina"
    },
    {
        "title": "HIGH-DEFINITION VICTORY 📡",
        "score": 1,
        "id": "1grv6ep",
        "url": "https://www.reddit.com/r/volleyball/comments/1grv6ep/highdefinition_victory/",
        "created_utc": 1731673455.0,
        "num_comments": 0,
        "selftext": "The Cignal HD Spikers continue their winning ways as they secure win no. 5 at the expense of the EcoOil La Salle Green Oilers at the 2024 Spikers' Turf Invitational Conference!  \n  \n\\#SpikersTurf #OneSports\n\nhttps://preview.redd.it/p77cju48621e1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=8849e7c0c6d306cf4ae4a4baaa1ffab523bb6bf1\n\n",
        "author": "OneSportsPHL"
    },
    {
        "title": "Can someone pls explain the rules for this ",
        "score": 21,
        "id": "1grteul",
        "url": "https://v.redd.it/1iu1hshgl11e1",
        "created_utc": 1731666470.0,
        "num_comments": 26,
        "selftext": "I’ve been playing volleyball for about a year now, and I’m still not too sure about all the rules, as far as I’ve been told, the back row isn’t allowed to attack in front of the pipe line, so why was Nikolov allowed to run past the line to hit, even though he was back row for the point. ",
        "author": "Amazing-Ad3432"
    },
    {
        "title": "Tear to new mikasa V360w",
        "score": 1,
        "id": "1grsgc7",
        "url": "https://www.reddit.com/r/volleyball/comments/1grsgc7/tear_to_new_mikasa_v360w/",
        "created_utc": 1731661982.0,
        "num_comments": 5,
        "selftext": "I've just went and bought a more professional volleyball, coming from Spalding's. I went to test it because it felt much smoother and nicer to handle, but after like 3 minutes of play on grass, a small bit of the surface has been ripped. Its not deep and i feel like it wont effect play.\n\nIs this common among the low end mikasa balls, as the previous ones i used didn't tear anywhere as fast. This one also had a weird slipperiness to it, but i think its just from being factory fresh\n\nhttps://preview.redd.it/ge9zfv76911e1.jpg?width=1868&amp;format=pjpg&amp;auto=webp&amp;s=a76a30a8d223c10f8b88d6d6092dc90e1ea3094e\n\n",
        "author": "Zelapid"
    },
    {
        "title": "How do you guys get the ball when you play outdoors?",
        "score": 5,
        "id": "1grmlig",
        "url": "https://www.reddit.com/r/volleyball/comments/1grmlig/how_do_you_guys_get_the_ball_when_you_play/",
        "created_utc": 1731639322.0,
        "num_comments": 9,
        "selftext": "Me and my hs team struggle to find court time as we go to a very small school and rn the boys and girls basketball team are occupying the court every day. there are genuinely 0 other indoor courts near us, so one of us bought an outdoor net and we go to a nearby park after school sometimes and scrimmage/ run drills, but its a very large grassy field so every tike after a nice hit or missed recieve we have to run to go get it. short term thats fine, better for conditioning, but after an hour it starts to wear us down and really hampers the fun. how do you guys deal with this? do you bring pads or smth to make a perimeter? or do you just take turns grabbing it. thanks for the help!",
        "author": "EverPig"
    },
    {
        "title": "Question for Lefties with Apple Watches",
        "score": 0,
        "id": "1grkga7",
        "url": "https://www.reddit.com/r/volleyball/comments/1grkga7/question_for_lefties_with_apple_watches/",
        "created_utc": 1731632661.0,
        "num_comments": 21,
        "selftext": "I just got an Apple Watch to track my heart rate and was a bit worried about the watch being on my hitting hand.\n\nDo yall have any issues with playing/hitting with the watch on your left hand? ",
        "author": "leebaiman"
    },
    {
        "title": "VBTV most recent matches no available?",
        "score": 2,
        "id": "1grdv0p",
        "url": "https://www.reddit.com/r/volleyball/comments/1grdv0p/vbtv_most_recent_matches_no_available/",
        "created_utc": 1731614706.0,
        "num_comments": 1,
        "selftext": "Could someone tell me why the most recent matches are being removed just after live streaming and sometimes I need to wait until next day before they are added to the archive of replays?\nI looked forward to watch today's matches of beach volleyball when I came from work and they are not there while I saw they were streamed during the day.\nI once created a ticket about this and in 2 days they answered that the matches are available in the archive. Well, yes, but they were not there just after stream when I wanted to watch.",
        "author": "JustineLT"
    },
    {
        "title": "Look what came in the mail!",
        "score": 115,
        "id": "1grgjzg",
        "url": "https://i.redd.it/cmnzp66fwx0e1.jpeg",
        "created_utc": 1731621723.0,
        "num_comments": 16,
        "selftext": "",
        "author": "June_Spicey"
    },
    {
        "title": "Another 3-0 win for LP Kangasala (FIN) vs. Maccabi Haifa (ISR)",
        "score": 8,
        "id": "1grbi41",
        "url": "https://www.reddit.com/gallery/1grbi41",
        "created_utc": 1731608705.0,
        "num_comments": 4,
        "selftext": "",
        "author": "kimmeljs"
    },
    {
        "title": "Thoughts on the VKTRY insoles?",
        "score": 3,
        "id": "1gr5bra",
        "url": "https://www.reddit.com/r/volleyball/comments/1gr5bra/thoughts_on_the_vktry_insoles/",
        "created_utc": 1731592639.0,
        "num_comments": 32,
        "selftext": "I've read alot of other people's thoughts on VKTRY and it has been generally negative, which I definitely get, since most I have read have tried it and said it's a scam and that it's not really effective or even comfortable.  \nI do want to try it and see for myself the criticisms, but it does feel a bit iffy and kind of wasteful since many besides the actual pros who seem to promote it criticize it.  \nAnd it's so damn expensive as well.\n\nIs it worth it to at least buy and test it? Cause I do want to see the deal about VKTRY that has pros like TJ DeFalco and many more say it's helped them improve their game, but at the same time, the negavity from others who've tried it makes me feel a bit unsure if it's the right decision",
        "author": "THEFIKSETH"
    },
    {
        "title": "Alternative Ways to Run an Open Gym Smoothly",
        "score": 10,
        "id": "1gqwzkg",
        "url": "https://www.reddit.com/r/volleyball/comments/1gqwzkg/alternative_ways_to_run_an_open_gym_smoothly/",
        "created_utc": 1731559216.0,
        "num_comments": 3,
        "selftext": "I host an open gym at a local sportscenter with 2 courts. Recently things have been good with around 4 teams coming in, but we’re coming up on the winter break where college kids are coming back and we see up to 8 teams. Sometimes during the summer, we even see up to 12. I’ve been trying out different things to get games going smoothly, but each has its own problems. I’ve tried separating the teams in half and assigning them to a court to rotate on. But that led to people complaining that they were “too good” for the court (some true and some not). So far what’s worked best is a queue system. First 4 teams on and winner stays on, everything after is play 2 then you’re off. Next team in line fills into whatever court finishes first. This has been good besides the long wait times, but that’s a given considering our limited facilities. If anyone has any alternatives it’d be appreciated. Something to bear in mind is that we’re technically a community center, so we can’t have a cut off for teams. We also aren’t able to have teams RSVP ahead of time and try and make a “game schedule” as majority of people coming in are walk-ins/late.",
        "author": "EvenAdministration81"
    },
    {
        "title": "Took second place at my work sand volleyball tournament today!",
        "score": 48,
        "id": "1gqr4uh",
        "url": "https://i.redd.it/821mijqb9r0e1.jpeg",
        "created_utc": 1731541314.0,
        "num_comments": 3,
        "selftext": "Hadn’t played volleyball since I left coaching about five years ago. Overall didn’t look too bad.  ",
        "author": "Therealfern1"
    },
    {
        "title": "volleyball bags ",
        "score": 1,
        "id": "1gq5xgr",
        "url": "https://www.reddit.com/r/volleyball/comments/1gq5xgr/volleyball_bags/",
        "created_utc": 1731476182.0,
        "num_comments": 1,
        "selftext": "Best place to shop for a volleyball gym bag? Spacious enough to have the ball, shoes, extra clothes, etc",
        "author": "Active_Bonus_4032"
    },
    {
        "title": "Rate my form",
        "score": 6,
        "id": "1gqp762",
        "url": "https://v.redd.it/19txqywutq0e1",
        "created_utc": 1731536113.0,
        "num_comments": 26,
        "selftext": "I am middle blocker (185 cm), started playing volleyball since June 2023. This is currently my form to attack my middle, well, not consistently like this because it really depend how reliable is the set too, but I think it is the most ideal form could get.\n\nls the progress for 1,5 year good enough? what should improve based on this form? Any opinions are welcomed",
        "author": "lorenz_valdy"
    },
    {
        "title": "Slippery shoes - am I doing smth wrong?? / Choosing new shoes maybe",
        "score": 1,
        "id": "1gqmizg",
        "url": "https://www.reddit.com/r/volleyball/comments/1gqmizg/slippery_shoes_am_i_doing_smth_wrong_choosing_new/",
        "created_utc": 1731529359.0,
        "num_comments": 5,
        "selftext": "Hi, I have asics sky elite ff. I find them horribly slippery. I've played in these shoes for a couple of years now, however my skills have gone up recently (from totally recreational playing to some sort of fine amateur league games), and so the lack of grip is really getting on my nerve. The wet towel method does help only for the short term, like 1/4 of the set. Then the shoes became slippery af again. The soles look fine (no wear is visible). Do you know what could be the reason? I'm 176cm and 58kg. Could it be because I'm too light for them? I've deep cleaned the sole (soap water and cif), I'll see the results next Saturday. Or am I doing something wrong that I'm not aware of?\n\nI'm considering buying another pair that would maybe fit me better. (the shoes are a little old; maybe the soles are indeed worn out, it does not look like they are tho). I'm small and light, relying mostly on speed and quick movements in my play. Any recommendations?\n\nPS. The shoes are original.",
        "author": "Peter_CA-643"
    },
    {
        "title": "Coaches Needed! How could video analysis help you become a better coach?",
        "score": 0,
        "id": "1gqhplc",
        "url": "/r/SportsBuddyai/comments/1gqhk2s/coaches_needed_how_could_video_analysis_help_you/",
        "created_utc": 1731517418.0,
        "num_comments": 0,
        "selftext": "",
        "author": "Fit_Engineer9548"
    },
    {
        "title": "Guide: How To Increase Your Vertical Jump",
        "score": 243,
        "id": "1gqhl9q",
        "url": "https://www.reddit.com/r/volleyball/comments/1gqhl9q/guide_how_to_increase_your_vertical_jump/",
        "created_utc": 1731517141.0,
        "num_comments": 53,
        "selftext": "I've been seeing a ton of posts on desire to jump higher, or critiquing technique and figured now is my time to shine.\n\nI started playing volleyball when I was 20 and had no previous experience with jumping. I did all sorts of sports that were very non-explosive (Soccer, XC, Swimming) and had no business jumping. When I first got into volleyball I couldn’t even touch the bottom of a basketball hoop netting. My vertical was less than 20”, I’m undersized (5’10”) and my body knew nothing about getting off the ground. This had me pretty motivated to control what I could by increasing my vertical. Over my 10+ year journey of increasing vertical from 18” to 36” I’ve learned quite a few nuggets. I’m by no means a professional, sports scientist, kinesiology major, etc…but I’ve done a ton of reading, trial and am a personal testimonial. That said, here is my attempt at streamlined advice on jumping higher. \n\n# Body Composition\n\nFat don’t fly. Simply put, you need to decrease your body fat% as much as possibly, while still staying athletic. I add that last part because there are body builders that have 7-10% body fat, but it wouldn’t translate well to sport. There is such thing as useful abs vs aesthetic abs. If you are overweight you need to cut weight through diet and exercise (preferably heavy lifting). Ideal BF% would be 10-15% range (15-20% for women). There are a boatload of resource on cutting weight while keeping strength, but a good starting point would be the FAQ in r/fitness\n\n# Lifting \n\nYou need to be able to move heavy things very quickly. Lifting explosively is the best way to translate weight room movements to volleyball. The preferred lifts are fully body movements such as olympic lifts, squatting, deadlifting. When doing these lifts you want to do low reps (3-5 sets of 1-6 reps) and heavy weight. You want to complete the lift as fast as possible, while keeping good form. A good example would be doing the eccentric movement of squat at normal or even slow pace, and when moving back to the top of the lift, you move the bar as fast as possible. You can do any sort of lifting regime you’d like (preferably full/lower body), as long as you’re gaining strength. Your goal should be squatting 1.5 to 2x your body weight. Once you hit that, you should start introducing plyometrics back into your routine. Once again, you can get a ton of info on lifting from r/fitness. I’d suggest taking any lifting program and adjust the plan to low reps, heavy weight and performing the movements quickly yet safely. \n\n# Muscle Fibers\n\nNow to some boring yet very necessary shit. You have two types of muscle fibers (slow twitch and fast twitch). These muscles fibers are developed over years of activity, genetics, and childhood. Some people are born with a high amount of specific fibers based on genetics and others develop it through childhood play. You can train towards increasing the amount of specific fibers you have as well…this takes time, but will change. Fast twitch fibers are used for explosive movements (jumping, sprinting, etc) and slow twitch fibers are used for longer, slower movements (walking, long distance running, etc.)\n\nThis all translates to 2 types of jumpers (bouncy and power). If you are born with fast twitch or had a childhood that promotes explosive movements, you’re more likely a bouncier more natural jumper. If you were born with slower twitch muscles, or had a childhood that promotes more endurance based activities, you are probably more of a strength based/power jumper. It is important to determine what type of jumper you are in order to implement the proper exercise/lifting program for you. \n\nSpringy/Bouncy jumpers are traditionally more fluid. It almost looks like it’s easy for them to jump/move quickly. Think of the whole Japanese volleyball team. Those types of jumpers USUALLY don’t have a lot of strength and should really focus on lifting heavy. They need to move heavy shit fast and gain as much strength as possible. Low reps, high weight, lift to failure (or close to failure) and do so 3-4 times per week.\n\nPower/Strength based jumpers are traditionally stronger, and look a lot more powerful when jumping. Think of Earvin Ngapeth, Matt Anderson or guys that use a lot more of their body to jump. Those types of jumpers USUALLY have a lot of strength, but don’t have much explosiveness and should focus on plyometrics. They need to jump, bound, sprint, and do plyometrics that will help generate more fast twitch fibers. Doing these workouts are harder on the body if done at max effort so 2-4 times per week. One day could be 5-10 sprints of 40m. One day could be a jump workout. One day could be playing an explosive sport (volleyball, tennis, basketball, football). One day could be a jump workout. One day could be a plyo workout doing depth jumps, hex bar jumps, squat jumps, and bounding. You will need to listen to your body as overdoing it could have your knees screaming at you. It’s harder to see results doing this type of stuff vs seeing numbers increasing in the weight room, so a fun measure would doing bi-weekly or monthly vertical jump test. You could tinker with going off one, off two, goofy footed, etc. At the end of the day, you’re wanting to do as much bouncy activity as possible, while staying healthy. \n\nIf you’re between these two (TJ DeFalco is a perfect example), or don’t know what type of jumper you are, doing a combo of both of these will benefit you. You can lift twice a week, and then do explosive workouts twice a week. I’m to the point where I have decent bounce and strength, so I will cycle my workouts. In the winter I will go all strength based, and then in the summer I will do all explosive based. Whatever helps keep your mind into it will be the best thing! \n\n# Technique\n\nThis alone can increase your vertical immediately. Jumping is a practiced movement, and takes time to become efficient. In volleyball you want to jump off two feet from a 3 or 4 step approach. Your 1st/2nd step(s) should be slower and you should be more upright, and when going into your penultimate step you need to have a long aggressive stride, and use your whole body to drive towards your block step. Use your last step to plant and move vertically while simultaneously extending your core/hips and lifting your arms aggressively. This is very hard to explain via text so my two recommended resources would be \n\n1. Project Pure Athlete on Instagram. He can be very salesy, but he has very good guidance on form, and has exercises that can work on this form. \n2. Coach Donny on YouTube has videos out there that translate jumping to volleyball. \n\nPPA is more jumping for vertical results, and then Donny is more volleyball based approach. Finding a good baseline from PPA and then implementing that to a volleyball approach is your best bet for proper technique. The best way to get better with technique is jumping. Practice jumping, tinker with your form until it feels or looks right. Record yourself and compare it to what PPA or Coach Donny says about technique. \n\n# Flexibility Myths\n\nOver my years of pursuing a higher vertical, I have yet to find any well-backed research that proves stretching, flexibility, etc. helps increase your vertical. In fact, some research shows that it hurts (this research is also not conducted well). If it helps you feel good, then that’s great. That said, until proven otherwise, I wouldn’t recommend wasting your time with different stretching routines before or after jumping/playing. The best warmup will be a dynamic warmup that gets your heart rate up, and legs feeling efficient/strong. \n\n# Quit Doing Slow Twitch Movements\n\nLong distance running and sports like soccer that involve distance are terrible for your vertical as it generate slow twitch muscles. These are big no-no’s for your goals. Cut out any activities that involve this type of stuff and replace it with lifting or sprints. If you are running or playing sports that generate slow twitch, this will slow your progress immensely. \n\n# Rest and Recovery\n\nThe last and least fun part of this is letting your body recoup. If you’re jumping/lifting daily, your body has no time to change/grow. You need to have off days especially with explosive workouts. These workouts are harder than traditional lifting regimens, and require more rest. Huberman Podcast has a ton of phenomenal guidance on optimizing sleep and recovery. \n\n# Read Vertical Jump Bible\n\nThis is essentially an abridged version of the vertical jump bible with some additional information I've found over the years. Both vertical jump bibles provide more in depth details on a lot of the stuff I posted here, so I'd recommend checking those out as mentioned in the FAQ\n\n# TLDR: \n\n* Body Fat Percentage should be around 10-15% (15-20% for women) for optimal performance.\n* Determine what type of jumper you are.\n   * Bouncy Jumpers should do low reps, high weight of mainly full body movements. Do these lifts fast.\n   * Strength Jumpers should develop more fast twitch muscle fibers by jumping, sprinting, bouncing and other plyometrics.\n   * Doing both strength and plyometrics will do wonders for anyone that doesn’t know what type of jumper they are, or are an in-between jumper.\n* Improve jump technique by checking out Project Pure Athlete on Instagram, Coach Donny on YouTube, and by continuing to jump!\n* Don’t waste your time stretching\n* Stop distance running\n* Rest!!!\n* Read both Vertical Jump Bibles",
        "author": "Darbitron"
    },
    {
        "title": "Some highlights cuz club starts in 2 days (I’m cooked)",
        "score": 0,
        "id": "1gqex30",
        "url": "https://v.redd.it/uvgzd0zvoo0e1",
        "created_utc": 1731510350.0,
        "num_comments": 7,
        "selftext": "",
        "author": "KarlTheUnipug"
    },
    {
        "title": "Game Thread: CEV Champions League",
        "score": 6,
        "id": "1gqekip",
        "url": "https://www.reddit.com/r/volleyball/comments/1gqekip/game_thread_cev_champions_league/",
        "created_utc": 1731509429.0,
        "num_comments": 0,
        "selftext": "# Men's - 2nd Leg\n\n# Pool A\n\n|Home|Away|Time|\n|:-|:-|:-|\n||\n|Greenyard MAASEIK (BEL)|BERLIN Recycling Volleys (GER)|Nov 20 20:30 local time|\n|ACH Volley LJUBLJANA (SLO)|PGE Projekt WARSZAWA (POL)|Nov 21 18:00 local time|\n\n# Pool B\n\n|Home|Away|Time|\n|:-|:-|:-|\n||\n|Fenerbahçe Medicana ISTANBUL (TUR)|Mint Vero Volley MONZA (ITA)|Nov 20 19:00 local time|\n|Olympiacos PIRAEUS (GRE)|Helios Grizzlys GIESEN (GER)|Nov 20 19:30 local time|\n\n# Pool C\n\n|Home|Away|Time|\n|:-|:-|:-|\n||\n|Hypo Tirol INNSBRUCK (AUT) |Allianz MILANO (ITA)|Nov 20 18:00 local time|\n|Knack ROESELARE (BEL)|Aluron CMC Warta ZAWIERCIE (POL)|Nov 21 18:30 local time|\n\n# Pool D\n\n|Home|Away|Time|\n|:-|:-|:-|\n||\n|SAINT-NAZAIRE VB Atlantique (FRA))|Sir Sicoma Monini PERUGIA (ITA)|Nov 19 20:00 local time|\n|Jihostroj ČESKÉ BUDĚJOVICE (CZE)|Halkbank ANKARA (TUR|Nov 20 18:00 local time|\n\n# Pool E\n\n|Home|Away|Time|\n|:-|:-|:-|\n||\n|CHAUMONT VB 52 (FRA)|JASTRZEBSKI Wegiel (POL)|Nov 20 20:00 local time|\n|Levski SOFIA (BUL)|SVG LÜNEBURG (GER)|Nov 20 20:00 local time|\n\n",
        "author": "Darbitron"
    },
    {
        "title": "Vnl jerseys",
        "score": 7,
        "id": "1gqdl9b",
        "url": "https://i.redd.it/00ds8rj8eo0e1.jpeg",
        "created_utc": 1731506644.0,
        "num_comments": 1,
        "selftext": "Anyone know where I can buy VNL jerseys? Tried searching online but couldn’t find anything. I was going to buy De Cecco’s Argentina jersey but couldn’t find it anywhere. Looking for the one in the picture specifically. \n\nAlso, I know his Modena jersey is on the Modena site, but it’s design is iffy imo, I’d rather get the Argentina one.",
        "author": "bount_"
    },
    {
        "title": "Need tips on hitting with better form",
        "score": 16,
        "id": "1gq5867",
        "url": "https://v.redd.it/awzp9h97ol0e1",
        "created_utc": 1731473686.0,
        "num_comments": 13,
        "selftext": "I feel like my form is ok but could use some improvements.\n\nI see a bunch of players kick their legs back then straighten them when they hit, and are able to twist their entire body to generate power. Are there any exercises for this? How can I tell if I’m doing it correctly? \n\nAlso my left arm goes too far to the side to generate more power - looks weird but not sure how I can fix this without sacrificing power.\n\nLast clip is what I want my form to look more like. He hits it with seemingly no effort but still has good form",
        "author": "Brief-Lingonberry359"
    },
    {
        "title": "Setting Form Check",
        "score": 0,
        "id": "1gq44si",
        "url": "https://v.redd.it/5jd248ymcl0e1",
        "created_utc": 1731469915.0,
        "num_comments": 1,
        "selftext": "",
        "author": "Leading_Shape9144"
    },
    {
        "title": "form",
        "score": 0,
        "id": "1gq31p9",
        "url": "https://www.reddit.com/gallery/1gq31p9",
        "created_utc": 1731466494.0,
        "num_comments": 2,
        "selftext": "whenever i swing my guide arm goes out to the side instead of pointing forward and then pulling down. How do i fix this?",
        "author": "Tough_Market8675"
    },
    {
        "title": "Coach are racist &amp; won’t POC into sports teams",
        "score": 0,
        "id": "1gpv5ok",
        "url": "https://www.reddit.com/r/volleyball/comments/1gpv5ok/coach_are_racist_wont_poc_into_sports_teams/",
        "created_utc": 1731444748.0,
        "num_comments": 37,
        "selftext": "Hello! I tried out today and last year for my school’s volleyball team. Last year, I tried so hard that what I didn’t make the cut I cried, I’ve had Volleyball lessons before, and while I don’t consider myself good at all I’m definitely better than these BAFOONS also trying out. I’ve noticed that in every single girl’s sports team from our school they are always 99% white, which is odd especially since they are a minority out of the entire school and make up maybe 10% of the school. For example, last year I walked by the girl‘s lacrosse team and they had, I kid you not, ONE black girl and everyone else was white (I checked because I was so flabbergasted). Also, every gym teacher and coach in our school is also white, and I’ve noticed the same popular white kids who have been in their classes getting picked for every single team. It really sucks because I really would have loved to be on the team, and have been trying my best and doing really well in tryouts. Meanwhile, I see these girls absolutely SHANKING their balls into oblivion and STILL MAKING IT. and this isnt even for the Final Cut it’s just for the second tryout. I looked at the name sheet today (had 21 names), and everyone was white except for maybe 4 girls who did extremely well. Majority of people who tried out weren’t even white. I’m so done. I wish I could make a swim team with “equity” or something so POC could actually get to play sports in the racist ass school.",
        "author": "pikshaa"
    },
    {
        "title": "Bruising on Hand",
        "score": 49,
        "id": "1gpz51r",
        "url": "https://i.redd.it/dsau4s405k0e1.png",
        "created_utc": 1731455118.0,
        "num_comments": 28,
        "selftext": "Hi guys,\n\nI've just started playing again for the first time in about 10 years and noticed quite a bit of bruising on my hand, is this considered normal? They felt a bit swollen, but not particularly painful.\n",
        "author": "Ok-Bed6421"
    },
    {
        "title": "Japan challenge ",
        "score": 0,
        "id": "1gptvgg",
        "url": "https://www.reddit.com/r/volleyball/comments/1gptvgg/japan_challenge/",
        "created_utc": 1731441574.0,
        "num_comments": 1,
        "selftext": "Guys I need your help, idk if it was a Mandela effect but I remember a game with Japan National Team and Nishida did a very strong spike in the net and after a challenge request a opponent player touch the net for the power of spike and Ref decide it was a net fault.\nI try to find a shorts or the video on YouTube but never found it. Did you remember the same? And in case can you link me the video? ",
        "author": "Spampyman"
    },
    {
        "title": "CEV Challenge Cup Kangasala (FIN) - Haifa (ISR)",
        "score": 10,
        "id": "1gprxhj",
        "url": "https://www.reddit.com/gallery/1gprxhj",
        "created_utc": 1731436816.0,
        "num_comments": 4,
        "selftext": "Kangasala wins, 3-0",
        "author": "kimmeljs"
    },
    {
        "title": "After 7 years, I got my big injury, tell me about yours and how you made it through",
        "score": 11,
        "id": "1gpc11k",
        "url": "https://www.reddit.com/r/volleyball/comments/1gpc11k/after_7_years_i_got_my_big_injury_tell_me_about/",
        "created_utc": 1731383797.0,
        "num_comments": 17,
        "selftext": "After 7 years of playing volleyball, I’ve gotten my first injury that has taken me out for coming onto a month now (MCL and Meniscus damage (not torn thank god)). I’m at an all time burnt out stage in my life playing volleyball, how did you guys use your injuries to make it through and get better as a player and maybe even as a person? Inspire me.",
        "author": "LOLADDICT123"
    },
    {
        "title": "University leagues ",
        "score": 1,
        "id": "1gphaju",
        "url": "https://www.reddit.com/r/volleyball/comments/1gphaju/university_leagues/",
        "created_utc": 1731405296.0,
        "num_comments": 4,
        "selftext": "If you take away the university championships in the USA, Canada and Japan, what other countries offer an interesting university league at a good level? ",
        "author": "Muxou"
    },
    {
        "title": "Tips to teach Reading?",
        "score": 11,
        "id": "1gpiv9e",
        "url": "https://www.reddit.com/r/volleyball/comments/1gpiv9e/tips_to_teach_reading/",
        "created_utc": 1731411956.0,
        "num_comments": 19,
        "selftext": "I'm a new volleyball coach working with athletes aged 12-19 at a club. We’re focusing on improving the basics, like serving, receiving, and passing. However, when we move into game simulations, I notice a lack of “play-reading” skills in my athletes. They tend to follow the ball and simply react to it, rather than reading the play and positioning themselves proactively.\n\nSince we’ve just started these simulations, I believe it's essential to teach play-reading skills early on so they can develop this ability over time.\n\nFor more experienced players and coaches: what tips have you received or given that really helped improve game sense? And for coaches, how do you typically approach this with your athletes?",
        "author": "Atsumuux"
    },
    {
        "title": "Casual Volleyball Games at Workplace - Need Advice to Form team",
        "score": 7,
        "id": "1gph6m8",
        "url": "https://www.reddit.com/r/volleyball/comments/1gph6m8/casual_volleyball_games_at_workplace_need_advice/",
        "created_utc": 1731404807.0,
        "num_comments": 4,
        "selftext": "Hi, at my workplace I got assigned to manage my department volleyball team formation. We are required to send 3 teams to compete with another 9 teams for our company level tournament.\n\nIn our case each team will have 10 players (4 subs).\n\nWe have people from different level of volleyball experiences i.e people who dont even know the rules to people who can hit properly. \n\nI am thinking to send 1 team with the most solid play of members while the other 2 with average ability. But I also want people who dont know much about volleyball to at least enjoy (and perhaps develop their interest). \n\nAlso because I also understand the sadness if people dont want me if I am not so good at it.. \n\nHow would you do it? \n\nTLDR: Want to win, but also want the other fellas to have fun (not stressing to win).",
        "author": "nnghzl"
    },
    {
        "title": "Should Volleyball Allow 4 Touches per Rally? 🤔 ",
        "score": 0,
        "id": "1gpb9ll",
        "url": "https://www.reddit.com/r/volleyball/comments/1gpb9ll/should_volleyball_allow_4_touches_per_rally/",
        "created_utc": 1731381317.0,
        "num_comments": 19,
        "selftext": " Should Volleyball Allow 4 Touches per Rally? 🤔\n\n\nHey volleyball community! 👋\n\nI’ve been thinking about the possibility of adding a fourth touch in volleyball, especially in the men’s game, where points can end so quickly due to the power and speed of play. Do you think allowing four touches would help increase rally length and make the game more dynamic? Or would it just make the offense too powerful, making it harder for defenses to keep up?\n\nSome thoughts on both sides:\n\nPros:\n\nCould give teams a chance to recover from strong serves or tough blocks, leading to more back-and-forth rallies.\n\nCould benefit defense as well, allowing players more chances to reset after tough digs.\n\n\nCons:\n\nCould make the offense too strong, especially with teams faking hits or running complex plays that the defense can’t keep up with.\n\n\nCurious to hear what you all think! Would adding a fourth touch improve the game, or do you think it would throw off the balance between offense and defense?\n\n",
        "author": "Suspicious-Yellow722"
    },
    {
        "title": "Still seeking 2025 Summer Men's (Non Competitive) Volleyball Training Camps",
        "score": 0,
        "id": "1gp8jhg",
        "url": "https://www.reddit.com/r/volleyball/comments/1gp8jhg/still_seeking_2025_summer_mens_non_competitive/",
        "created_utc": 1731373142.0,
        "num_comments": 1,
        "selftext": "I've asked this question before I'm asking again in case someone missed it the first time. \n\nI've actually found two really good quality summer training programs for men's volleyball. One in Medina Italy, the other one in Sydney Australia. \n\nI would love to know if there's any additional ones. My son is a freshman, division one volleyball, in the United States. I'm looking for opportunities outside of the United States. \n\nIt just can't be competitive. And it would be great if the program was at least 10 days minimum.\n\nAny suggestions, would be so great.!",
        "author": "birkcreative"
    },
    {
        "title": "Middleblocker Reach",
        "score": 1,
        "id": "1goqnnd",
        "url": "https://www.reddit.com/r/volleyball/comments/1goqnnd/middleblocker_reach/",
        "created_utc": 1731326710.0,
        "num_comments": 2,
        "selftext": "Hey, I started playing Middleblock (190cm height, 252cm standing reach and 310cm block reach). I know that I still need to jump higher but I was wondering what the reach of the pro MB is like. Thanks in advance for your answers!",
        "author": "Glittering_Cat_7634"
    },
    {
        "title": "Spiking form help",
        "score": 0,
        "id": "1gowxs5",
        "url": "https://www.reddit.com/r/volleyball/comments/1gowxs5/spiking_form_help/",
        "created_utc": 1731344196.0,
        "num_comments": 2,
        "selftext": "It seems like I'm always hitting the net when I spike. Am I doing something wrong in my approach, or do I just need to develop more strength to jump higher? Sorry, for the video quality. It wouldn't download at a higher res for some reason\n\n[hitting vod](https://reddit.com/link/1gowxs5/video/h53u3js3za0e1/player)\n\n",
        "author": "Justin6165"
    },
    {
        "title": "Landing on one leg",
        "score": 13,
        "id": "1gp7goo",
        "url": "https://v.redd.it/ivnmsln74d0e1",
        "created_utc": 1731370106.0,
        "num_comments": 16,
        "selftext": "Why does my right leg kind of stay in the air when I land? How can I train myself to land on both?",
        "author": "Wartzin"
    },
    {
        "title": "I think I’ve ruined someone’s love for the game",
        "score": 65,
        "id": "1gp7aco",
        "url": "https://www.reddit.com/r/volleyball/comments/1gp7aco/i_think_ive_ruined_someones_love_for_the_game/",
        "created_utc": 1731369626.0,
        "num_comments": 14,
        "selftext": "Seeking advice from coaches. \n\nI am a youth volunteer in a rural village in a non-Western country. I mainly work with students aged 9-16. I did not grow up playing volleyball but I'm relatively naturally athletic and have picked it up since living here as that is the past time many of my students enjoy. \n\nOver the last year or so we have played almost every day and I am a pseudo-coach. As I said before I don't have a background in volleyball or in teaching, I'm just a volunteer, but I have religiously looked up videos on YouTube and read articles to try and advise and help my students improve their skills. \n\nMany students have improved but one student (16f) improved and then recently has seemingly lost all confidence and enjoyment for playing. \n\nI tried to teach her to hit. The approach steps, etc. She was doing okay. \n\nWe went to a beach Vball competition. The first match she was hitting confidently and realistically the best I have ever seen her play. They got smoked. \n\nShe rarely tried to hit in the remaining games after shanking a few hits. The last two weeks she now has tried to totally change her hitting form where she is trying to hit the ball with a closed fist to get more power (naturally losing all control). I've tried to tell her this isn't right but she's been getting increasingly discouraged at her improvement, or lack thereof, over the last month. Lately she will play for 5-10 minutes, fail some hits, and then just take herself out and sit on the sideline. This isn't organized, it's supposed to be for fun. I think part of it is she thinks she is letting me down and I am disappointed in her. \n\nI fear I've ruined her enjoyment for playing. What can I do? Language is also a barrier. Also, how do coaches deal with the feeling that you've failed a player? Please help. ",
        "author": "SureBudYaBudOkayBud"
    },
    {
        "title": "Finally decided to get all my balls off the floor",
        "score": 237,
        "id": "1gp6o41",
        "url": "https://i.redd.it/609ezi9sxc0e1.jpeg",
        "created_utc": 1731367935.0,
        "num_comments": 7,
        "selftext": "Not included is the other V200W that lives in my bag",
        "author": "Kandolre"
    },
    {
        "title": "Hey everyone! Didn't catch all the big volleyball news from last week?\n\nNo worries – the new volleyball news episode is here for you!",
        "score": 7,
        "id": "1gozyfh",
        "url": "https://youtu.be/v4aZEaZ1NNE",
        "created_utc": 1731351363.0,
        "num_comments": 0,
        "selftext": "",
        "author": "RSport13"
    },
    {
        "title": "thirst for improvements lol rate me 1-10",
        "score": 43,
        "id": "1gozqqx",
        "url": "https://v.redd.it/nmzk0b6zib0e1",
        "created_utc": 1731350853.0,
        "num_comments": 33,
        "selftext": "I've been a setter for 1 year, and getting bored for my team mates that can't score so decided to be opener haha, btw we had a broken play so the set is open so i need to make it long ball, but i can hit the ball pretty bounce ",
        "author": "Muted-Draw6609"
    },
    {
        "title": "Just posting this last one for the week. Thx everyone for your help!",
        "score": 0,
        "id": "1gozl89",
        "url": "https://v.redd.it/nuko7o6xhb0e1",
        "created_utc": 1731350494.0,
        "num_comments": 3,
        "selftext": "",
        "author": "[deleted]"
    },
    {
        "title": "Here’s some clips, leave any feedback. *Also thx everyone on my previous post with great advice*",
        "score": 0,
        "id": "1gozacv",
        "url": "https://v.redd.it/c8infrxrfb0e1",
        "created_utc": 1731349777.0,
        "num_comments": 4,
        "selftext": "",
        "author": "[deleted]"
    },
    {
        "title": "Why can't I spike or serve hard?",
        "score": 0,
        "id": "1goye3j",
        "url": "https://www.reddit.com/r/volleyball/comments/1goye3j/why_cant_i_spike_or_serve_hard/",
        "created_utc": 1731347647.0,
        "num_comments": 19,
        "selftext": "I started a rec/coed volleyball league in March. I liked it quite a bit so I signed up for another day my second session, and this session I'll be doing four a week (remains to be seen if that's overkill or not lol). \n\nI've gotten much better at receiving, especially overhand. I can often go straight into a set on the first hit even if it's a tricky one, and I'm rarely the one to drop the ball. Last week everything from the read, timing, and distance seemed to click and I got five successful blocks too. However, my spike still sucks bad when I thought it would be my best asset.\n\nI'm 6'1\" and my standing reach is slightly over 8 feet. However, I always feel like if I spike hard it will go into the net or out of bounds. I basically flick my wrist down without much elbow or shoulder movement to ensure I keep it in, but obviously this results in a pretty light hit that is less likely to score. \n\nI should be strong enough to hit pretty hard, but psychologically I feel like I'll either hit it out, hit it into the net, or hit the net with my hand. Part of this is I feel like I'm not getting any air on my jumps. I was 270 at the start of this year as I was previously competing in strongman and I definitely wasn't jumping super high, but now I'm at 245 and my teammates assure me I am almost up to my shoulders on the net when I jump even if it doesn't feel like it. Also tried to touch a basketball rim at one of the gyms just to check and I got high enough to wrap at least my finger tips around it.\n\nOn serves also, I was a actually *better* in March/April. At one point I got 8 aces straight. Now every time I try to hit it hard, it goes out. It's like the next is too high to give it speed and still get it to come down in bounds...Even though I was doing it before. I can get my serve in every time and almost never miss, but only by hitting it lightly and they're not fast enough to ever be a point. Try to add some speed, and it goes out or into the net. \n\nThen I see other people who are shorter than me or not jumping as high hit the ball HARD and get it to come down in the middle of the court...How are they doing this? Other players have said it's the spin, but how do you hit the ball differently to change its spin without also changing its direction? And how do you handle all this at the same time as coordinating your jump, swing, ball location, and the positions of the other team? 😵‍💫\n\nDo I just need more practice to get a feel for it? I only ever really get to spike in games and even then, most of my teammates are not good enough at controlling the ball for us to get consistent bump/set/spikes, so I don't get to do it often. \n\nAny insights/advice would be appreciated. ",
        "author": "Ofcertainthings"
    },
    {
        "title": "Form check ",
        "score": 22,
        "id": "1goxdpg",
        "url": "https://v.redd.it/pv8ch7t72b0e1",
        "created_utc": 1731345217.0,
        "num_comments": 11,
        "selftext": "Feel like I’m struggling to hit at my max reach and when I do I tend to waffle it out of bounds like the first clip",
        "author": "wlx5"
    },
    {
        "title": "FP Insoles. Do they work well for volleyball?",
        "score": 2,
        "id": "1gox4cp",
        "url": "https://www.reddit.com/gallery/1gox4cp",
        "created_utc": 1731344610.0,
        "num_comments": 5,
        "selftext": "",
        "author": "PC_Rob15"
    },
    {
        "title": "Any apps  to follow volleyball matches",
        "score": 2,
        "id": "1go6b8c",
        "url": "https://www.reddit.com/r/volleyball/comments/1go6b8c/any_apps_to_follow_volleyball_matches/",
        "created_utc": 1731260916.0,
        "num_comments": 2,
        "selftext": " im very new to vollyeball as a fan and im interested in watching live matches but im not sure how to look up when matches are??(sorry bad English its my second language) i need an app like Fotmob that tells me when matches are when leagues starts how the scores are and stuff like that but i dont know any apps I tried searching but couldn't find any ",
        "author": "sall0z"
    },
    {
        "title": "Game Thread: Men's CEV Champions League - 4th Round (Leg 1)",
        "score": 6,
        "id": "1gosvip",
        "url": "https://www.reddit.com/r/volleyball/comments/1gosvip/game_thread_mens_cev_champions_league_4th_round/",
        "created_utc": 1731333759.0,
        "num_comments": 0,
        "selftext": "Where to watch? [Here](https://championsleague.cev.eu/en/broadcasters/)!\n\n# Pool A\n\n|Home|Away|Time|\n|:-|:-|:-|\n|BERLIN Recycling Volleys (GER)|ACH Volley LJUBLJANA (SLO)|12/11/2024 19:30 local time|\n|PGE Projekt WARSZAWA (POL)|Greenyard MAASEIK (BEL)|12/11/2024 20:30 local time|\n\n# Pool B\n\n|Home|Away|Time|\n|:-|:-|:-|\n|Helios Grizzlys GIESEN (GER)|Fenerbahçe Medicana ISTANBUL (TUR)|13/11/2024 20:00 local time|\n|Mint Vero Volley MONZA (ITA)|Olympiacos PIRAEUS (GRE)|14/11/2024 20:00 local time|\n\n# Pool C\n\n|Home|Away|Time|\n|:-|:-|:-|\n|Aluron CMC Warta ZAWIERCIE (POL)|Hypo Tirol INNSBRUCK (AUT)|13/11/2024 18:00 local time|\n|Allianz MILANO (ITA)|Knack ROESELARE (BEL)|13/11/2024 18:30 local time|\n\n# Pool D\n\n|Home|Away|Time|\n|:-|:-|:-|\n|Halkbank ANKARA (TUR)|SAINT-NAZAIRE VB Atlantique (FRA)|13/11/2024 18:00 local time|\n|Sir Sicoma Monini PERUGIA (ITA)|Jihostroj ČESKÉ BUDĚJOVICE (CZE)|13/11/2024 20:30 local time|\n\n# Pool E\n\n|Home|Away|Time|\n|:-|:-|:-|\n|SVG LÜNEBURG (GER)|CHAUMONT VB 52 (FRA)|13/11/2024 19:00 local time|\n|JASTRZEBSKI Wegiel (POL)|Levski SOFIA (BUL)|13/11/2024 20:30 local time|\n\nWomen's 2nd Leg\n\n# Pool A\n\n|Home|Away|Time|\n|:-|:-|:-|\n||\n|(POL)Maritza PLOVDIV (BUL)|A. Carraro Imoco CONEGLIANO (ITA)|12/11/2024 19:00 local time|\n|Mladost ZAGREB (CRO)|Developres RZESZÓW (POL)|14/11/2024 20:00 local time|\n\n# Pool B\n\n|Home|Away|Time|\n|:-|:-|:-|\n||\n|SSC Palmberg SCHWERIN (GER)|Eczacibasi Dynavit ISTANBUL (TUR)|13/11/2024 18:00 local time|\n|Tent OBRENOVAC (SRB)|LEVALLOIS PARIS Saint Cloud (FRA)|14/11/2024 19:00 local time|\n\n# Pool C\n\n|Home|Away|Time|\n|:-|:-|:-|\n||\n|Calcit KAMNIK (SLO)|Numia Vero Volley MILANO (ITA)|12/11/2024 18:00 local time|\n|FC PORTO (POR)|VakifBank ISTANBUL (TUR)|12/11/2024 20:30 local time|\n\n# Pool D\n\n|Home|Away|Time|\n|:-|:-|:-|\n||\n|PGE Grot Budowlani ŁÓDŹ (POL)|Neptunes NANTES (FRA)|12/11/2024 18:00 local time|\n|Vasas Óbuda BUDAPEST (HUN)|Fenerbahçe Medicana ISTANBUL (TUR)|13/11/2024 18:30 local time|\n\n# Pool E\n\n|Home|Away|Time|\n|:-|:-|:-|\n||\n|Allianz MTV STUTTGART (GER)|Savino Del Bene SCANDICCI (ITA)|13/11/2024 19:00 local time|\n|C.S.O. VOLUNTARI 2005 (ROU)|BKS Bostik ZGO BIELSKO-BIAŁA (POL)|13/11/2024 21:00 local time|",
        "author": "Darbitron"
    },
    {
        "title": "What's the best volleyball match you ever saw?",
        "score": 21,
        "id": "1gost7g",
        "url": "https://www.reddit.com/r/volleyball/comments/1gost7g/whats_the_best_volleyball_match_you_ever_saw/",
        "created_utc": 1731333597.0,
        "num_comments": 25,
        "selftext": "",
        "author": "SirLadthe1st"
    },
    {
        "title": "Buying a Molten volleyball from Taobao (sharing my experience)",
        "score": 15,
        "id": "1gos22n",
        "url": "https://www.reddit.com/r/volleyball/comments/1gos22n/buying_a_molten_volleyball_from_taobao_sharing_my/",
        "created_utc": 1731331349.0,
        "num_comments": 11,
        "selftext": "I'm staying in Hong Kong for a while and wanted to buy a better volleyball during my stay.\n\nResearching about other people's experience led me to believe that the Molten V5M5000 might be a good choice for me. I played volleyball for about a year back when I was 17 years old, and now, 15 years later, started again since about a year ago, but only in my grandpa's sports club where it's mostly 50+ age people (except for me and another grandson who shows up occasionally).\n\nSo I was hoping to get a ball that handles well enough to be fun and make people feel pro enough to have some ego stroke yet soft enough to not hurt hands and arms more than necessary. From what people were saying (\"softer than Mikasa\" in particular) I felt hopeful with the Molten V5M5000.\n\nInitially I wanted to buy a volleyball from a local shop, but given how cheap and easy it is to import from China through Taobao to Hong Kong, I figured I might as well order from Taobao directly, where I can return it for free with little hassle if it turns out to be fake.\n\nThere are plenty of \"Molten\" and \"Mikasa\" volleyballs listed there, and the first listing I found that looked trustworthy (sold by \"Tmall Molten Fenhu Store\", with a couple hundred sales and 50 positive reviews) had the V5M5000 model for 265 RMB, which is about 38 USD or 35 EUR. It included a carrying bag and a cheap no-name brand ball pump.\n\nI wasn't sure what to expect, figuring that it was most likely going to be a fake, but if it felt much better than my 15€ Goma VB20 ball that I bought from a local shop last week, I might still keep it, otherwise back to the seller it goes.\n\nThe ball arrived today, and I am pleasantly surprised with the production quality. The seams and prints all look clean and the surface feels nice.\n\nhttps://preview.redd.it/64c6qafwv90e1.jpg?width=1488&amp;format=pjpg&amp;auto=webp&amp;s=65d66c3c330fd87d8719bf25d37f8bffca4cf048\n\nAs to whether it's genuine: it came with a little business card with a verification number hidden under a scratch-off layer. The verification number is specific to the Molten China website.\n\nhttps://preview.redd.it/ex6mambtv90e1.jpg?width=1488&amp;format=pjpg&amp;auto=webp&amp;s=690ce88d1e4f681c7d2f2d05f9ef84c1e013dcc0\n\nFor a bit, I thought this was just a very elaborate part of a scammer trying to minimize his product return rate, since the [website](http://www.molten-china.com/) doesn't have HTTPS and looks like it's stuck somewhere between 2005 and 2015, design wise. While I don't have a problem with the design ([this post](https://old.reddit.com/r/unpopularopinion/comments/sz6kyt/modern_web_design_is_trash_web_design_peaked/) could have been written by me), it's a stark contrast to the current English and Japanese Molten websites which look much more modern.\n\nHowever, the official website indeed links to the same URL in its [\"Molten Global Network\" page](https://www.molten.co.jp/sports/en/network/). On the Molten China website, the bottom left corner has a blue rectangle with the number 16 in it, this links to their genuine check verification, which is hosted on an [external website](http://www.581315.com/CodeQuery/AntiCodeQuery.aspx).\n\nMy ball's code was 8011 3884 015 95923. After entering it for the first time, it told me that it's a genuine ball. When I entered it for the second time, it told me that the code was entered before (showing the date) and that if that date does not coincide with me entering the code for the first time, the ball might be fake.\n\nhttps://preview.redd.it/8orktyttw90e1.jpg?width=2304&amp;format=pjpg&amp;auto=webp&amp;s=3baa5debe62aed5aa084225658607cbb346f5deb\n\nFrom my understanding, this indicates good practices (apart from the websites not having HTTPS, which will likely throw some people off) and that the ball is indeed genuine.\n\nI haven't played with the ball yet and am about to put air into it for the first time. Since I could not find any discussions when searching for \"Molten volleyball Taobao\" that had people comment positively about whether Molten volleyballs on Taobao are genuine, I'd figure it's a good idea to post something that people can look up. \n\nI can't ascertain with 100% confidence that the ball really is genuine – it's not impossible for Molten's partner (?) who maintains the China website and the genuine check system to also sell counterfeit balls, without Molten having noticed it (yet). But I think that's really unlikely and the ball looks so well-made that I'll trust the ball to be genuine until I happen to meet someone who has a genuine one and can show me the difference.",
        "author": "Kadano"
    },
    {
        "title": "Weekly Short Questions Thread",
        "score": 3,
        "id": "1gootf2",
        "url": "https://www.reddit.com/r/volleyball/comments/1gootf2/weekly_short_questions_thread/",
        "created_utc": 1731319228.0,
        "num_comments": 38,
        "selftext": "Welcome to the Weekly Short Questions Thread! If you've got a quick question that doesn't require you to provide in-depth explanation, post it here! Examples include:\n\n* What is the correct hand shape for setting?\n* My setter called for a \"31\" and I'm looking for advice on to do that.\n* What are the best volleyball shoes on the market for a libero?\n* Is the Vertical Jump Bible any good?\n* I'm looking for suggestions on how to make an impression at tryouts.\n\nQuick questions like these are allowed only in this thread. If they're posted elsewhere, they will be removed and you'll be directed to post here instead. The exceptions to this rule are when asking for feedback **WITH A VIDEO**, or when posting an in-depth question (must be &gt;600 characters). Please create a separate post for these kinds of questions.\n\nIf your question is getting ignored:\n\n* Are you asking a super generic question? Questions like \"How do I play opposite?\" or \"How do I start playing volleyball?\" are not good questions.\n* Has the question you're asking been answered a lot on the sub before? Use the search function.\n* Is the question about your hitting/passing/setting form and you haven't provided a video? It's hard to diagnose issues without seeing your form. Best to get some video and post to the main subreddit.\n\nLet's try to make sure everyone gets an answer. If you're looking to help, sort the comments by \"new\" to find folks who haven't been replied to yet.\n\nIf you want to chat with the community about volleyball related topics or really anything, [join our Discord server!](https://discord.gg/zv3c6xQsAy) There is a lot of good information passed around there and you might get more detailed responses.",
        "author": "AutoModerator"
    },
    {
        "title": " Proud father sharing my 15 year old daughter’s great kill shot from the weekend ",
        "score": 64,
        "id": "1goo8mw",
        "url": "https://www.reddit.com/r/volleyball/comments/1goo8mw/proud_father_sharing_my_15_year_old_daughters/",
        "created_utc": 1731316619.0,
        "num_comments": 2,
        "selftext": "https://www.instagram.com/reel/DCNjnE0yFUF/?igsh=MXB1MzducXk5MGJkbQ==\n",
        "author": "chizled21"
    },
    {
        "title": "I really want to get better but it's hard to learn from videos",
        "score": 15,
        "id": "1gojnv1",
        "url": "https://www.reddit.com/r/volleyball/comments/1gojnv1/i_really_want_to_get_better_but_its_hard_to_learn/",
        "created_utc": 1731298440.0,
        "num_comments": 7,
        "selftext": "Hi all! \n\nI've been playing volleyball for a few months now and really enjoying it. I've been practicing as much as I can and have been going to open gyms + playing in a league multiple times per week. I definitely learned a lot fast but I feel like I am hitting a point where there are things I'm not doing completely correct but I just don't know enough to correct myself (and certainly things I don't even realize I'm doing wrong). \n\nI really am passionate about improving and have tons of time to dedicate to doing so, so I'm wondering what the best route is for learning in a less independent manner? \n\nAre there adult club teams with practices? Do people take lessons? Would love to know how to approach this. I definitely plan to keep playing consistently and know I'll continue to improve, but there are certain skills where I feel like I'm hitting a wall trying to improve without feedback. I appreciate any help!!!",
        "author": "Neither_Pea6993"
    },
    {
        "title": "Does my vollyball have excess air?",
        "score": 0,
        "id": "1gofzs8",
        "url": "https://v.redd.it/hcd9a143860e1",
        "created_utc": 1731286678.0,
        "num_comments": 9,
        "selftext": "I am a newbie to vollyball , just brought my first vollyball which is nivia spikester(encounter) and I inflated it I don't have a pressure gauge to check the air pressure and I don't know of there is excess air even if a push it so I have taken a video , if anyone could , please tell me if there is enough air or should I let soms air out or anything ",
        "author": "itz_king665"
    },
    {
        "title": "Rate the funny moments",
        "score": 43,
        "id": "1god3bi",
        "url": "https://v.redd.it/n7cp5dwkj50e1",
        "created_utc": 1731278437.0,
        "num_comments": 0,
        "selftext": "",
        "author": "KarlTheUnipug"
    },
    {
        "title": "How can I improve at releasing into attacking position better as a setter?",
        "score": 2,
        "id": "1goc6j1",
        "url": "https://www.reddit.com/r/volleyball/comments/1goc6j1/how_can_i_improve_at_releasing_into_attacking/",
        "created_utc": 1731276039.0,
        "num_comments": 9,
        "selftext": "I was wondering if anyone had any tips for a setter releasing into the attacking position because it’s something i really struggled with in my last game. we were playing in a 5-1 and for example let’s say we’re in serve receive in rotation 4 ( Where in stacking in the left corning with the middle ) after the serve has been hit and i’ve moved to my setter position usually the passes are really low and a lot of the time it isn’t anywhere near me, really close to the net resulting in me having extremely little time to adjust to the pass and it always results in a poorer set. The goes for releasing from my defensive position into my attacking position as well, does anyone have any tips they can give me that would help me have more time to adjust to the pass?",
        "author": "Beneficial-Tune3001"
    },
    {
        "title": "I have performance anxiety ",
        "score": 8,
        "id": "1gobtvf",
        "url": "https://www.reddit.com/r/volleyball/comments/1gobtvf/i_have_performance_anxiety/",
        "created_utc": 1731275117.0,
        "num_comments": 14,
        "selftext": "I have been playing volleyball for the past 3 months and I attend the 3 classes a week religiously and never miss any unless I really have to. I now know and am getting alot better at all the basics like setting and passing and serving and I practice alot either alone with a wall or with my brother or my friends. I have semi average reaction time and I do really well with my pepper partner. The problem is that whenever I play games I get so nervous, even if they’re practice matches. I’d be standing, not moving yet sweat is still dripping from my forehead. A girl from my team glares at anyone who makes a mistake and sometimes call their name out which made me so nervous to the point where my brain literally lags and I forget how to move. I’m always so scared to let my coach down but this fear is whats making me let her down. Does anyone know any tips to help calm down or something? Cuz this is really getting out of hand",
        "author": "Sensitive-Tea-2633"
    },
    {
        "title": "Instagram",
        "score": 0,
        "id": "1gobplw",
        "url": "https://www.reddit.com/r/volleyball/comments/1gobplw/instagram/",
        "created_utc": 1731274804.0,
        "num_comments": 0,
        "selftext": "Hi all, I am a volleyball player from the Netherlands and my team started an instagram this year. We want to get as many followers as possible! If you are interested in our journey this season and upcoming season ofcourse please follow us :)\n\nhttps://www.instagram.com/geminikangeroes_heren_2/profilecard/?igsh=ZTA1NW9oNmwyZml6\n",
        "author": "kianaidenn"
    },
    {
        "title": "Is there any way I can improve my defense/ diving?",
        "score": 12,
        "id": "1go7te1",
        "url": "https://v.redd.it/xi5vr550f40e1",
        "created_utc": 1731264768.0,
        "num_comments": 9,
        "selftext": "Had a really bad school season and i’m trying to improve for club. (Libero/ DS #2/23)",
        "author": "Party-Respect1002"
    },
    {
        "title": "Proper form for overhand serve (beginner)",
        "score": 28,
        "id": "1go4t2u",
        "url": "https://v.redd.it/dm7sodp0s30e1",
        "created_utc": 1731257039.0,
        "num_comments": 25,
        "selftext": "Hello, I am a complete beginner and just started playing the past few weeks. \nI want to make a solid overhand serve, but that is a bit challenging. \n\nPlease give some pointers for improvement!Also pointers to avoid shoulder pain is appreciated!",
        "author": "RandomRedditCat87"
    },
    {
        "title": "Hi guys!",
        "score": 1,
        "id": "1gnf8en",
        "url": "https://www.reddit.com/r/volleyball/comments/1gnf8en/hi_guys/",
        "created_utc": 1731173491.0,
        "num_comments": 3,
        "selftext": "Hi guys i am an (not very good) amatuer player in spain i've been ghosting this sub for a bit but I don't really onow the positions in english could you guys  help?\n\nColocador: the one who raises the ball so you can ¿Strike?\n\nOpuesto: always opposite of the colocador \n\n\nCentrales: middle guys who swap out with the libero and block the ¿Strikes? \n\nLibero: rear of the pitch and are for defense they swap out with the centrales at 4 position \n\nReceptor:  they receive the ball\n\nThank you!",
        "author": "Happy-Ad-6317"
    },
    {
        "title": "guys how can i get better at spiking  ",
        "score": 8,
        "id": "1go1i65",
        "url": "https://v.redd.it/1ogo285y030e1",
        "created_utc": 1731247936.0,
        "num_comments": 13,
        "selftext": "my spike here is really weak and i feel like my run up is affecting how high i can jump ",
        "author": "Ancientmasterjeff"
    },
    {
        "title": "Where to start watching volleyball matches from",
        "score": 4,
        "id": "1gnxqy3",
        "url": "https://www.reddit.com/r/volleyball/comments/1gnxqy3/where_to_start_watching_volleyball_matches_from/",
        "created_utc": 1731234344.0,
        "num_comments": 6,
        "selftext": "I'm a complete newbie to watching volleyball matches and have literally no idea on what tournaments occur and which team is good and stuff",
        "author": "Axecene"
    },
    {
        "title": "Volleyball Drills ",
        "score": 3,
        "id": "1gns4n1",
        "url": "https://www.instagram.com/reel/DCH_-pRiLDV/?igsh=ajc4aDVjaXRvZDUz",
        "created_utc": 1731211320.0,
        "num_comments": 0,
        "selftext": "",
        "author": "Independent_Air6284"
    },
    {
        "title": "way of wades + vktry insoles",
        "score": 0,
        "id": "1gnrrz8",
        "url": "https://www.reddit.com/r/volleyball/comments/1gnrrz8/way_of_wades_vktry_insoles/",
        "created_utc": 1731210112.0,
        "num_comments": 9,
        "selftext": "i recently got a pair of vktry insoles as a gift because of the black friday deal, and i’m wondering if i should completely swap out the insoles that come with my way of wades. i have the way of wades 808 4 ultra and when i’ve been wearing them with the original insoles.\n\ni like it when they’re tight because i feel like it gives me more support. But when i swap it out with vktry they feel loose because of the difference in thickness.\n\ni’m just trying to figure out whether i should wear both at the same time (which i don’t think i should but ???) or if i should just stick with the vktry and get used to having shoes looser than im used to.",
        "author": "insprini"
    },
    {
        "title": "Ball hit my head on block, how can I prevent that from happening?",
        "score": 129,
        "id": "1gnr9ow",
        "url": "https://v.redd.it/iewuvcvcrzzd1",
        "created_utc": 1731208385.0,
        "num_comments": 45,
        "selftext": "",
        "author": "[deleted]"
    },
    {
        "title": "vent: feeling under appreciated ",
        "score": 0,
        "id": "1gng5vw",
        "url": "https://www.reddit.com/r/volleyball/comments/1gng5vw/vent_feeling_under_appreciated/",
        "created_utc": 1731175981.0,
        "num_comments": 4,
        "selftext": "im a libero and the only sophomore on varsity. would be cool if i wasnt benched the whole season. ive talked to my coach before and she outright told me she put me on varsity so i could practice/play at a higher level, because starting on jv wouldnt have helped me at all.\n\nfirst few weeks of the season i was a nervous wreck, the girls on my team have been on varsity before, and they all have classes together, so they were able to mesh better. i have terrible social anxiety, so my play was completely off. not to mention there were 11 girls on the team, so i had to ask the managers, who are juniors/seniors to pepper/warmup with me. \n\nso came the time of our first game, my coach had realized someone else on my team could play libero. i played half a set and was able to keep up, but i was still pretty nervous. \n\nthe rest of the season hasnt been any better. halfway through the season my coach began to prioritize the starting 6, sometimes they would do one more rep of a drill than the other 6 players. \n\none game, our main libero was benched because she didnt go to practice for a day or two. so i was on, even wore the opposite colored jersey. keep in mind this has never happened before, and i still dont mesh as well with the starter players. so naturally, i was nervous and made mistakes. i played one full set and got benched the rest of the 4 (we ended up losing). my coach didnt even talk to me after that first set to give me a pep talk or whatever, she just told the main libero “put on the other shirt.” i went to the bathroom and cried as i was changing back to the regular jersey. \n\nduring one talk ive had with my coach, she told me that “you look nervous whenever youre put in because you seem afraid to mess up, and you tell yourself if you mess up coach will take me out” followed by “well i will take you out if you mess up, but dont tell yourself that!” … uh?\n\nnow we are at the end of the season, main libero has pretty much gotten more reps than me. maybe im putting myself on a high horse out of frustration, but i feel that we are nearly at the same level. she just has better passes than me, but i really havent been playing much. i do practice on my own time, but nothing will beat an actual game. she can dive, however not that well or consistently. I CAN. i also think im a bit quicker. and im much more talkative on and off the court, im always congratulating my teammates after and during a play. i especially try to tell our setters they made a good set, and passers a good pass, since i know they dont get congratulated as often as attackers do when they get a good kill. i also cheer very loudly. its so frustrating because my coach SEES i have so much ambition, she told me herself, and here we are almost at the end of the season. i feel there isnt a drastic difference between me and our main libero. i just cant help but think what player i could have become if i got the same opportunity as her. and then im blaming myself for being too nervous the first few weeks, i could have proven to my coach i can do the job.\n\nto add salt to the wound, i only get played the 2nd or 3rd set. lately its been the 3rd. and i dont start the set either, so im only playing about 15 points. \n\nand my coach expects me to perform as well as our main libero, when i have been benched practically the whole time. i can try but what am i supposed to do!? \n\nplease comment anything with advice it would be greatly appreciated ",
        "author": "cacasucker3000"
    },
    {
        "title": "My coach forces me to play libero even tho i have the best jump on the team",
        "score": 0,
        "id": "1gnbmjt",
        "url": "https://www.reddit.com/r/volleyball/comments/1gnbmjt/my_coach_forces_me_to_play_libero_even_tho_i_have/",
        "created_utc": 1731163586.0,
        "num_comments": 11,
        "selftext": "I am almost 16 and my growth has been stunned because of the intensity of training I did for my vertical jump, leading me to be 164cm and searching desperately for methods to grow. I never liked playing defense as much as I liked adapting to huge blocks using my jump and arsenal, it's also a really hard pill to swallow as I used to be one of the best OH before I was promoted to a cadet where I'm forced to play with the juniors as well. I've expressed this multiple times to my coach and team and was mocked, but there aren't even any teams near me that I can maybe talk to and settle something. My emotions overall while playing libero are bad, I just get demoralized seeing someone on my team 2cm taller play my position, doing shit and still being able to play that position for some reason. Is there any way I can resume my growth? My mum is pretty tall for a lady in my country and my dad is 175/180cm or so. I have a passion for volleyball that nobody in my entire continent has seen and I'd hate to quit because of the mocking on my team and my emotions just making me close to crying every match I play on the court.",
        "author": "Dismal_Fishing_2460"
    },
    {
        "title": "What does it mean to be called a beggar?",
        "score": 3,
        "id": "1gn0ho5",
        "url": "https://www.reddit.com/r/volleyball/comments/1gn0ho5/what_does_it_mean_to_be_called_a_beggar/",
        "created_utc": 1731121139.0,
        "num_comments": 9,
        "selftext": "And if it’s a common slang term? The college team I watch has a cheer for when we get a kill i think? I originally thought it was a term for someone who lays out for a ball but misses, but it doesn’t seem to be the case. Wondering if anyone else has heard of the term or what it’s used for",
        "author": "skyteir"
    },
    {
        "title": "First time coach! ",
        "score": 1,
        "id": "1gn1unl",
        "url": "https://www.reddit.com/r/volleyball/comments/1gn1unl/first_time_coach/",
        "created_utc": 1731125761.0,
        "num_comments": 3,
        "selftext": "Hello all!! I'm coaching my 7th grade daughter's team this year. This position is volunteer based and I'm SO excited!! I've had parents reach out to me thanking me for volunteering and have asked if I have a \"wish list\" for this season. I have a few items such as tennis balls and a first aid kit but wanted to ask advice on other things I should add for parents willing to contribute. Thank you!!",
        "author": "Western_Hunter1682"
    },
    {
        "title": "COLD AS ICE-SICKLE 🥶",
        "score": 0,
        "id": "1gnaozp",
        "url": "https://www.reddit.com/r/volleyball/comments/1gnaozp/cold_as_icesickle/",
        "created_utc": 1731160786.0,
        "num_comments": 1,
        "selftext": "Brooke Van Sickle went into full MVP mode in her first game of the 2024-25 PVL All-Filipino Conference, lifting the Petro Gazz Angels past the Choco Mucho Flying Titans in four sets!  \n  \n\\#PVL2025 #TheHeartOfVolleyball #OneSports\n\nhttps://preview.redd.it/yynbwn2ttvzd1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=8836c1a5420db048433219a1f4919e937df9100c",
        "author": "OneSportsPHL"
    },
    {
        "title": "WIND BENEATH THEIR WINGS 🪽",
        "score": 2,
        "id": "1gnafc0",
        "url": "https://www.reddit.com/r/volleyball/comments/1gnafc0/wind_beneath_their_wings/",
        "created_utc": 1731159927.0,
        "num_comments": 1,
        "selftext": "The Petro Gazz Angels got off to a high-flying start after toppling the Choco Mucho Flying Titans in four sets to cap off the opening day of the 2024-25 PVL All-Filipino Conference!  \n  \n\\#PVL2025 #TheHeartOfVolleyball #OneSports\n\nhttps://preview.redd.it/yuhbxt49rvzd1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=7de2fa74c4e8488224d1adacd2d0fb0863cdb2ac",
        "author": "OneSportsPHL"
    },
    {
        "title": "My brother and I built tournament software for running volleyball tournaments",
        "score": 77,
        "id": "1gn7pxs",
        "url": "https://www.reddit.com/r/volleyball/comments/1gn7pxs/my_brother_and_i_built_tournament_software_for/",
        "created_utc": 1731150088.0,
        "num_comments": 33,
        "selftext": "Hi r/volleyball, my brother and I have have spent the last few years building a site for running sports tournaments: [https://tourny.ca/](https://tourny.ca/). Our goal for the site is to simplify the admin side of running tournaments by helping with things like format setup, generation of schedules, tracking results and determining the standings as well as provide a mobile friendly, simple to use, modern UI for people participating in the tournament. \n\nThis summer we had a bunch of Canadian youth baseball tournaments use the site and the feedback was really positive. We collaborated quite a bit with the baseball community to help update the site to really fit with their setup. Adding things like custom game stats, new tiebreak rules and custom bracket formats. \n\nWanted to share the site here because we’d love to do the same with the volleyball community. We think the site could be really helpful for people running tournaments especially if you don’t already have a good option for managing your tournaments. We’d also love to hear any feedback on the site and hear what you like or don't like and how we might be able to update it to better work with your tournaments.  \n  \nHere’s an [example tournament](https://tourny.ca/t/volleyball-championship) I put together and a  [short youtube video](https://www.youtube.com/watch?v=nqTYy3_BQEU&amp;ab_channel=Tourny) that gives an overview of the site. Check it out and let me know what you think!\n\nAlso here are a few screenshots to get a sense of what the site looks like:\n\n[What the players see \\(home page, games, standings, bracket\\)](https://preview.redd.it/s4wlcgfdxuzd1.png?width=1972&amp;format=png&amp;auto=webp&amp;s=b1b6ef8378a72ec25cba558049fcad4f5203c989)\n\n[What the admin sees \\(manage tournament, run tournament, submit score, transition to playoffs\\) ](https://preview.redd.it/q3rvyaitxuzd1.png?width=1968&amp;format=png&amp;auto=webp&amp;s=ac744c47b0d6dfa595bf331943f5d7a05eddb7c9)\n\n",
        "author": "MeringueFair5879"
    },
    {
        "title": "THE LADY BEAST HAS AWAKENED 💪",
        "score": 2,
        "id": "1gn7ot5",
        "url": "https://www.reddit.com/r/volleyball/comments/1gn7ot5/the_lady_beast_has_awakened/",
        "created_utc": 1731149970.0,
        "num_comments": 1,
        "selftext": "Grethcel Soltones' all-around game powers the Akari Chargers to a decisive four-set win over the Galeries Tower Highrisers in the 2024-25 PVL All-Filipino Conference!  \n  \n\\#PVL2025 #TheHeartOfVolleyball #OneSports\n\nhttps://preview.redd.it/tskke99nxuzd1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=5c3846d498019c8e381aa7c05b1bac397e71ae4e\n\n",
        "author": "OneSportsPHL"
    },
    {
        "title": "LIGHTS GUIDING ‘EM TO WIN ⚡️",
        "score": 2,
        "id": "1gn7h17",
        "url": "https://www.reddit.com/r/volleyball/comments/1gn7h17/lights_guiding_em_to_win/",
        "created_utc": 1731149020.0,
        "num_comments": 0,
        "selftext": "The Akari Chargers shrug off a slow start to open their 2024-25 PVL All-Filipino Conference campaign with a blinding four-set victory over the Galeries Tower Highrisers!\n\n\\#PVL2025 #TheHeartOfVolleyball #OneSports\n\nhttps://preview.redd.it/6j7iessruuzd1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=5994fabaed46c12b800520e35a59f30aeb31128c\n\n",
        "author": "OneSportsPHL"
    },
    {
        "title": "Setting my outside",
        "score": 10,
        "id": "1gn71um",
        "url": "https://v.redd.it/ecbzkx3bpuzd1",
        "created_utc": 1731147162.0,
        "num_comments": 8,
        "selftext": "Had a chance to set my outside back to back but seem to have a problem with transitioning from defense to offence, tips on footwork please ",
        "author": "aaronvillaosme"
    },
    {
        "title": "Very big nerves for my game in a few hours",
        "score": 10,
        "id": "1gn65wr",
        "url": "https://www.reddit.com/r/volleyball/comments/1gn65wr/very_big_nerves_for_my_game_in_a_few_hours/",
        "created_utc": 1731143162.0,
        "num_comments": 3,
        "selftext": "I am a 16 year old girl playing in one of the lowest teams of my age. I have been playing for 1.5 years and am really motivated to get better, also wanting to spend time on playing outside of practice, but recently it just felt as if I hit a block on progressing more.\n\nIn 6 hours I will be playing with the boys team (17+18 years old) with a friend of mine, and I am so so nervous! I can’t fully overhand serve from behind the line yet (I can get it from the 7 meters line only) and sometimes my sets are really wonky. I am gonna have to underhand serve, and if I get that into the net I will just be so ashamed. I wasn’t that nervous yesterday but now I am really stressing. Any tips that might help are welcome!",
        "author": "velasi2008"
    },
    {
        "title": "Finally got my dream volleyballs!",
        "score": 318,
        "id": "1gn29p8",
        "url": "https://i.redd.it/swmarzwx1tzd1.jpeg",
        "created_utc": 1731127203.0,
        "num_comments": 30,
        "selftext": "I was finally able to purchase both my dream volleyballs! I really love the mikasa but I haven’t been able to use the molten yet, hopefully I will use it soon and see which one I like more!",
        "author": "tonylogics"
    },
    {
        "title": "Why is the Outside Hitter called that?",
        "score": 1,
        "id": "1gmv6th",
        "url": "https://www.reddit.com/r/volleyball/comments/1gmv6th/why_is_the_outside_hitter_called_that/",
        "created_utc": 1731105462.0,
        "num_comments": 26,
        "selftext": "What is the origin of that position's name? What is \"outside\" referring to? Outside of what?",
        "author": "quickslothslowmonkey"
    },
    {
        "title": "Is this a volleyball?",
        "score": 0,
        "id": "1gn1brl",
        "url": "https://www.reddit.com/gallery/1gn1brl",
        "created_utc": 1731123963.0,
        "num_comments": 9,
        "selftext": "Sorry for the random question, but some kids were playing soccer by my house and hit my window with this ball while I am out of town.  \n\nAfter they hit my window, they ran away. Is this a volleyball? I’m hoping so, as that means my window probably wasn’t damaged.",
        "author": "voiceinsidemyeeead"
    },
    {
        "title": "Please help me pick County Player of the Year!",
        "score": 27,
        "id": "1gmtrnt",
        "url": "https://www.reddit.com/r/volleyball/comments/1gmtrnt/please_help_me_pick_county_player_of_the_year/",
        "created_utc": 1731101699.0,
        "num_comments": 18,
        "selftext": "I am the sports editor at a local paper and am in charge of selecting the All-County Player of the Year. I have a good understanding of volleyball, but never played the sport.\n\nPlease help me select which of these three finalists, which were all nominated by other teams' coaches.\n\nL.J. is the best setter in the county and leads in AST/S by a large margin  \nM.H. is the best hitter in the county and leads in K/S by a large margin  \nH.S. is an incredible all-around player, ranks about third in K/S and AST/S, and is top 3 in state for aces\n\nI've seen all three play several times, and all really are exceptional players. All of their teams made deep state playoff runs.\n\n  \nAny help is appreciated!\n\nhttps://preview.redd.it/ui7holuexqzd1.png?width=596&amp;format=png&amp;auto=webp&amp;s=12f340f42538b0557db8866017a9f71a4c481795\n\n",
        "author": "ezekyle3"
    },
    {
        "title": "volleyball karma! more lowlights and bloopers from pickup w the homies!",
        "score": 5,
        "id": "1gmsr9x",
        "url": "https://youtu.be/nCvysvOty5s",
        "created_utc": 1731099081.0,
        "num_comments": 0,
        "selftext": "",
        "author": "AsTheyCollide"
    },
    {
        "title": "Any advice on my back row attack",
        "score": 0,
        "id": "1gmowtn",
        "url": "https://v.redd.it/3ads9egvwpzd1",
        "created_utc": 1731089172.0,
        "num_comments": 47,
        "selftext": "",
        "author": "[deleted]"
    },
    {
        "title": "Brother hasn’t played for 3 games in middle school",
        "score": 21,
        "id": "1gmo3gc",
        "url": "https://www.reddit.com/r/volleyball/comments/1gmo3gc/brother_hasnt_played_for_3_games_in_middle_school/",
        "created_utc": 1731087156.0,
        "num_comments": 40,
        "selftext": "Hello all! I am the (adult) older sister to a middle school boy on a school volleyball team and don’t know much about middle school sports and how they work and wanted some insight. \n\nMy brother went to tryouts for his middle school volleyball team and out of probably 80+ kids, he made the team of about 18? (Which to me personally seems large). \n\nHe has never played with an organized team, but he and his friends play on a local court all the time and they decided to try out for the team. There are some kids on the team who are very good and he and everyone else does recognize that. However, there have been 3 games so far and the coach has not put him in once. He mentioned to us as well that at practices his coach doesn’t like putting them (bench warmers) in scrimmages because she wants the “starters” to learn how to play and play together. I want to know if this is normal? She put him in the scrimmage yesterday, but with all of the kids who also are benched, so they obviously bombed and got beat by the kids who constantly play and practice. In my head I don’t understand how he’s supposed to get better if she doesn’t talk to him much, doesn’t give him things to work on, doesn’t really let him practice, and then doesn’t put him in games. To me, middle school sports doesn’t really matter so I don’t understand why she’s insanely focused on winning. He’s not the only one either, there are about 6 boys who just bench warm and don’t play. Why would she have taken him on the team if she’s not even gonna try and help him get better or let him play the sport he loves? He’s obviously getting down in his spirits about it and I just want to help. Please be nice if I sound ignorant I truly don’t know how these things work I didn’t play many sports in school lol thank u!!",
        "author": "Pristine_Talk5908"
    },
    {
        "title": "Hey everyone! My friends and I are still competing in an amateur tournament, and this match was tough for us in every way. If you want to dive right into the heat of the volleyball action, then this video is for you!",
        "score": 9,
        "id": "1gmlubm",
        "url": "https://youtu.be/4fjFPpKiuKo",
        "created_utc": 1731081529.0,
        "num_comments": 1,
        "selftext": "",
        "author": "RSport13"
    },
    {
        "title": "Ruling Question: how to make a call on backcourt hits that happen *outside* of the court?",
        "score": 2,
        "id": "1gmf733",
        "url": "https://www.reddit.com/r/volleyball/comments/1gmf733/ruling_question_how_to_make_a_call_on_backcourt/",
        "created_utc": 1731060359.0,
        "num_comments": 6,
        "selftext": "I may have just missed a section talking about this, but how do you make a call about a backcourt hit if the player takes off from *outside* of the court? I.e the setter sets the ball to the backcourt opposite, but they send it too far and the opposite has to go off the court to hit it. \n\nIn that instance, my assumption is that the 3m line (the line between the front court and backcourt) extends outwards beyond the sideline and that the ref has to make a call on whether they were in front of or behind the 3m line if it were to be extended. \n\nWhat is the ruling on this?",
        "author": "DaveHydraulics"
    },
    {
        "title": "Can a Libero bump set in front of the attack line?",
        "score": 13,
        "id": "1gmdm4w",
        "url": "https://www.reddit.com/r/volleyball/comments/1gmdm4w/can_a_libero_bump_set_in_front_of_the_attack_line/",
        "created_utc": 1731053080.0,
        "num_comments": 14,
        "selftext": "",
        "author": "Zember1"
    },
    {
        "title": "Help me improve form.",
        "score": 6,
        "id": "1gmgx3w",
        "url": "https://v.redd.it/qb0d23b24ozd1",
        "created_utc": 1731067377.0,
        "num_comments": 4,
        "selftext": "I’m 14 and have been playing a few years and need pointers on how I can improve my form and approach. Do not sugarcoat I need the harsh truth.",
        "author": "Bright_Database_8766"
    },
    {
        "title": "Arm Swing Chest-Shoulder-Arm Movement",
        "score": 34,
        "id": "1gme7ql",
        "url": "https://i.redd.it/ke9hgwzq5nzd1.jpeg",
        "created_utc": 1731055835.0,
        "num_comments": 11,
        "selftext": "\nMy arm does not externally rotate( probably due to me having rounded shoulders) enough to allow for my hand to stay back, while my shoulder and elbow moves forward. \n\nIt feels like this creates a huge inefficiency for me, where some torque from core rotation is lost. \n\n\nWould this lack of shoulder mobility cause my arm swing to be rigid and inconsistent?",
        "author": "amumuchan1"
    },
    {
        "title": "Any tips for my arm swing?",
        "score": 6,
        "id": "1gmckf0",
        "url": "https://v.redd.it/e3pdguimjmzd1",
        "created_utc": 1731048414.0,
        "num_comments": 5,
        "selftext": "All my team mates say I have a weird arm swing, and that it could be better. \n\nI also find sometimes that I'm late or early for my approach as a middle, how can I time it better?",
        "author": "N0ts0t4llb0i"
    },
    {
        "title": "A question about the rule ",
        "score": 6,
        "id": "1gmbsch",
        "url": "https://www.reddit.com/r/volleyball/comments/1gmbsch/a_question_about_the_rule/",
        "created_utc": 1731045325.0,
        "num_comments": 15,
        "selftext": "I have a few questions about the rule since I can’t find the answer in google \n\n1. Can liberlo move to the position of another player before ball serving? Such as, now liberlo switch with middle and before the serve start. He/She move to position 5 to make a receive from serve easily.\n2. Can we throw the ball as serve?\n3. Can frontrow player stay behind 3 meters line before ball serving. As long us I saw most tournament frontrow usually go recieve ball serving in backrow. But my friend tell me that’s illegal. Frontrow must stay in frontrow and backrow stay in backrow before ball serving\n\nThis rule is based on FIVB",
        "author": "KILLVader"
    },
    {
        "title": "What can I do at this point?",
        "score": 2,
        "id": "1gmaip0",
        "url": "https://www.reddit.com/r/volleyball/comments/1gmaip0/what_can_i_do_at_this_point/",
        "created_utc": 1731040733.0,
        "num_comments": 8,
        "selftext": "I've been playing volleyball for over a year now just in pickup games at a rec center and during open gym times at my university (the latter exclusively now). It's my first semester, and I have pretty much met all of the regulars there, but I'm struggling to actually be able to play. I don't think I'm bad, probably exactly average of all the people who are playing, but no one picks me up, and if I try to form a team to play, the line to play is so long most people leave before it's my time to actually play on the court. I think I would get picked up more if I improved, but I really don't know how. My grandma is a coach so I could ask her, but I only have one day of the week off in the first place so practice and improvement would be really slow. I would love to join an actual team so I can get used to playing with a specific set of people and they could help me improve, but I have no idea how to go about that or how to see if there are any sort of rec leagues in my area. So, what do I do? I kinda struggle to make friends too (I think I put people off), so getting to know a group at my Uni seems... Weird to do, I guess. I'm 99% sure I would just get shut down, as the majority of them have known each other for years. I'm also transferring colleges next August so pretty much every relationship I form here is gonna turn into long distance at best. For reference, I play setter, I'm 5'9, 130lbs, my vertical is (with an approach) ~9.5 ft and I do know 5-1 rotation. I've never been on a team before either, as my high school didn't have one until my senior year, and I was too busy working to join it. Help? I love volleyball, but I'm struggling to find motivation to bother playing. ",
        "author": "Satan--Ruler_of_Hell"
    },
    {
        "title": "St. Joes vs. Holy Cross Game 1",
        "score": 3,
        "id": "1gm67ck",
        "url": "https://youtube.com/watch?v=P7eG5MXuLRk&amp;si=agpMaUATwyn3K6oA",
        "created_utc": 1731027167.0,
        "num_comments": 1,
        "selftext": "",
        "author": "Euphoric_Trade_5191"
    },
    {
        "title": "I don't see USA pro women's league sticking around for very long ",
        "score": 40,
        "id": "1gm3knc",
        "url": "https://www.reddit.com/r/volleyball/comments/1gm3knc/i_dont_see_usa_pro_womens_league_sticking_around/",
        "created_utc": 1731019863.0,
        "num_comments": 29,
        "selftext": "I hope I'm wrong, but I just don't see how it's profiting at all. Of the 3 games I watched today on YouTube, they all had audiences of like 30 or so people, not even bleachers or anything, and each match is days old and is still sitting around 1k views each. Matches form 3 weeks ago are only at like 6k at most or so lol. I watch girls high school matches on YouTube often and they each have like 5k-10k views, you'd think they'd be less popular than a pro league but it don't seem like it lol\n\nHope I'm missing something, but from what I've seen it doesn't seem like it's gonna explode in popularity which IMO it need to do obviously for revenue",
        "author": "Low_Management9055"
    },
    {
        "title": "Looking for a bag",
        "score": 0,
        "id": "1glzoj3",
        "url": "https://www.reddit.com/r/volleyball/comments/1glzoj3/looking_for_a_bag/",
        "created_utc": 1731009890.0,
        "num_comments": 10,
        "selftext": "So oddly specific sorry, but I wanna find a bag with a ball compartment and shoe compartment, and have some space for other stuff, legit any brand works",
        "author": "Metrix09"
    },
    {
        "title": "Unspoken rules for coed blocking?",
        "score": 47,
        "id": "1glznre",
        "url": "https://www.reddit.com/r/volleyball/comments/1glznre/unspoken_rules_for_coed_blocking/",
        "created_utc": 1731009838.0,
        "num_comments": 56,
        "selftext": "*UPDATE BELOW\n\nTL;DR: I joined an new league. During my teams last game our opponent claimed that men should not block women's shots during coed play. I've never encountered this before and I (and my team) don't understand why this would be enjoyable for anyone. I'm looking for some outside perspective.\n\nHi volleyball reddit,\n\nI recently moved to a new city and joined an adult rec volleyball league. During our last match the other team stopped us midway through the first set to tell us we were violating the \"rule\" that men cannot block women's shots during coed play. I asked if this was a league rule or just some unspoken thing among the players, but they wouldn't give a clear answer. We went with it since there was no ref present (staffing shortage at the facility) to clarify, and my team is all new to the league.\n\nI thought this was unusual as I've been playing in similar leagues for years and never heard of any rule like this, either official or unspoken, so I emailed the league to clarify. Turns out it's not an official rule, so maybe it's just something among the players, although I have my doubts about that as well as none of our previous opponents (including this same team a month ago) have said anything. It was a little suspicious that they only brought this up after we took an early lead, and after we resumed play they started always having a woman hit it over. For the purpose of my question though I'll give them the benefit of the doubt and assume the previous teams just felt too awkward to say anything.\n\nMy question is, why would anyone (male or female) enjoy playing with such a rule in place? And should we agree to play by it if it comes up again? I discussed it with my team after the game and got 3 responses:\n\n* 1 player (female) liked the rule and thought it levelled the playing field\n* 2 players (1 male 1 female) didn't care either way, but think we should go along with it if it comes up again to avoid conflict with other teams\n* 3 players (all female) were strongly against the rule. They said they felt disrespected that they were not being treated as equals on the court, and that it was sexist to imply they weren't capable of playing a competitive game against men. It may be worth noting that 2 of these women are recently graduated D1 college athletes in another sport, and are easily more athletic than any of the men on my team or the opposing team.\n\nPersonally I (male) agree with the last group. I discussed it with them and we didn't understand why the rule would be fun for anyone involved. We were confused for the following reasons, and I'm hoping reddit can provide some insight:\n\n* We don't understand why women would sign up for a coed league if they aren't ok with playing volleyball under the normal rules against men. The facility offers a women's league as well, why not just join that instead?\n* We don't understand why men playing would find this rule enjoyable. Most people in the league have limited free time due to work, kids, and other commitments. We don't see why anyone would use their limited free time to drive all the way to the facility and not play their hardest. It seems unfulfilling.\n* We don't understand why anyone would want to play against an opponent that isn't trying their hardest. What's the fun in playing a game when your opponent isn't trying their best to win?\n\nI'm also looking for advice on what to do if a future opponent brings this up. I'm the captain, so it falls on me to decide whether or not we agree to any unofficial rules. I'm inclined to reject the rule and tell opponents that \"we're going to play our hardest and we hope you do as well\", since that's what the majority of the team favors. Does anyone have any thoughts on either the (unofficial) rule itself or how I should handle it? I'd love some outside perspective\n\nEdit: In case it matters, the net is at men's height, and there is an (official) rule in place that a woman must hit the ball before it goes over, assuming there is more than one total hit\n\nEdit 2: I should probably also add that the \"blocking\" isn't some highly skilled thing where we're smacking it down onto their side of the net. This is a low-level league and we aren't that good, so most \"blocks\" just bounce back over and are fairly returnable\n\nUPDATE:\nI just got back from today's game, where unfortunately there was a whole thing about the rule again. My team remained divided on how to handle it, but we decided to just each play how we wanted. I opted to block all players equally while the other two men in attendance decided not to so as to avoid potential conflict.\n\nWell if you hadn't guessed yet, there was conflict. Right from the start of our first set the other team's captain would complain every time I went up for a block against a woman. He wouldn't complain directly to me, but he was loudly insulting me to his teammates while I was in the front row, so he must have known I could hear him. I didn't feel like starting a fight about it so I just pretended I didn't hear. This continued throughout the whole match. After the last set I skipped the usual high fiving with the other team since I didn't feel like saying \"good game\" after how they treated me. I didn't do anything dramatic, just walked over to the bench to drink some water. Naturally this was wildly offensive to the other team, and a few minutes later one of them walked over and said to my wife and other teammates \"You're all amazing, except for that guy, he's a douche\" while pointing directly at me. Once again I was like 15 feet away, so I can obviously hear them.\n\nFunny thing is I didn't actually block any of the shots, they all went way over my head. The only successful block I made the whole match was against a man. I mentioned it to the ref on the way out and she said the other captain has been playing there for years and he's \"always been an a******\", so I'm guessing this isn't the first time this has happened. I get that he wasn't happy about it and he's entitled to his opinion but this just seemed excessive. Additionally, it seemed hypocritical that he would complain about me taking advantage of a favorable matchup when they were clearly and repeatedly targeting our weaker players. Again, I fully expect any opponent to play their hardest and go for our weak points, but it's bizarre to me that they would complain about me doing effectively the same thing",
        "author": "JudgementalTree"
    },
    {
        "title": "How to not get demotivated?",
        "score": 4,
        "id": "1glus9s",
        "url": "https://www.reddit.com/r/volleyball/comments/1glus9s/how_to_not_get_demotivated/",
        "created_utc": 1730997675.0,
        "num_comments": 13,
        "selftext": "So basically me and my friend basically started volleyball around the same time and we were basically equal in terms of skill. At one point i considered myself slightly better but not by a lot. So after summer in which we both barely played i couldn't play normally anymore, for the past like 2 months ive been getting frustrated on how i kinda suck now more than before while he kept really improving. And now i had a back injury and havent played for like 3 weeks while he has been improving and especially his spikes have become wayy better than mine and i guess a part of that is cause hes like 5cm taller than me but his spikes are eay better while mine are way worse so whenever i watch him play or when we play together i cant help but realise how much he improved while i play even worse than before which makes me lose all motivation and i dont even want to play anymore.\n",
        "author": "Hefty_Zucchini_5159"
    },
    {
        "title": "Highlights I VakifBank ISTANBUL vs. Calcit KAMNIK I Champions League",
        "score": 3,
        "id": "1glr5zo",
        "url": "https://www.youtube.com/watch?v=DmYcaVVzS0Y",
        "created_utc": 1730988252.0,
        "num_comments": 1,
        "selftext": "",
        "author": "Fiishman"
    },
    {
        "title": "More technical discussions - Setter decision making",
        "score": 29,
        "id": "1glm7ga",
        "url": "https://www.reddit.com/r/volleyball/comments/1glm7ga/more_technical_discussions_setter_decision_making/",
        "created_utc": 1730969732.0,
        "num_comments": 16,
        "selftext": "Just wanted to start contributing more instead of letting the sub fill up with form checks and parents asking for advice. I thought technical discussions could be a way to bring a bit more variety. We used to have more of these 5, 10 years ago but that has dwindled.\n\nTo start with, what are things to consider as a setter when deciding who to set to? What are you looking at?\n\nWould you set a weaker attacker more when he's in his strongest rotation? Even though you have a stronger more consistent attacker? \n\n",
        "author": "jagovibe"
    },
    {
        "title": "READ: The PVL's official statement on Alohi Robins-Hardy's eligibility to play",
        "score": 0,
        "id": "1glno3o",
        "url": "https://www.reddit.com/r/volleyball/comments/1glno3o/read_the_pvls_official_statement_on_alohi/",
        "created_utc": 1730976414.0,
        "num_comments": 0,
        "selftext": "The Premier Volleyball League (PVL) has issued an official statement regarding the eligibility of newly acquired setter Alohi Robins-Hardy to play in the league.  \n  \nOn Thursday, November 7, the Farm Fresh Foxies held a press conference, appealing to the league to allow Robins-Hardy to play, referencing a prior understanding with Sports Vision president Ricky Palou.  \n  \n\\#PVL2024 #TheHeartofVolleyball #OneSports\n\n📸 PVL\n\nhttps://preview.redd.it/yqav6zdilgzd1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=6e26274638d9ab31d1ef472ddbe671e440d1b686\n\n",
        "author": "OneSportsPHL"
    },
    {
        "title": "Need help with my hitting",
        "score": 6,
        "id": "1glisgw",
        "url": "https://v.redd.it/cyxafrk3vezd1",
        "created_utc": 1730955399.0,
        "num_comments": 3,
        "selftext": "I need help with my hitting and my form cause i feel like im not hitting as hard as i can. Im 16 and 5’10 playing on a high school net. Any tips or advice? Thanks",
        "author": "makingina"
    },
    {
        "title": "need help with my form",
        "score": 16,
        "id": "1glhkso",
        "url": "https://v.redd.it/dnuyhh4miezd1",
        "created_utc": 1730951201.0,
        "num_comments": 7,
        "selftext": "Hey guys so I've been playing for 8 yrs now and I just need some opinions and advice with my form since a lot of my teammates told me that I have a bad form while spiking.(The net in the vid is low cuz we were playing with some of our Female friends)",
        "author": "woopsie544"
    },
    {
        "title": "Help!!!",
        "score": 3,
        "id": "1glfeck",
        "url": "https://i.redd.it/8r31xfpxxdzd1.jpeg",
        "created_utc": 1730944245.0,
        "num_comments": 7,
        "selftext": "Whenever I jump to go hit, my legs do this and it looks so ugly and doesn’t feel right, I also bring in my arm to my chest? I’ve been playing for two years and this is pretty much the form I’ve had, I also struggle to hit lines. Please help.",
        "author": "02Joshyyyy"
    },
    {
        "title": "Are these carries/doubles?",
        "score": 6,
        "id": "1glafzg",
        "url": "https://v.redd.it/bag4sklzsczd1",
        "created_utc": 1730930496.0,
        "num_comments": 20,
        "selftext": "",
        "author": "Opening-Use-8446"
    },
    {
        "title": "Advice welcome: Arm Swing",
        "score": 0,
        "id": "1gl67ys",
        "url": "https://www.reddit.com/r/volleyball/comments/1gl67ys/advice_welcome_arm_swing/",
        "created_utc": 1730919863.0,
        "num_comments": 7,
        "selftext": "Hey, I am fairly new to volleyball and here are some Videos where I have been practicing my arm swings. I have a lot of trouble with consistent throws and as you can tell this is at home, so I am not throwing the ball too high. In the videos I am mostly focusing on keeping an open hand and \"snapping\" my wrist (which is what my coach told me to focus on). It still fells kind of bad and unnatural to me so I am wondering if there is any advice or drills for me to improve.\n\n  \nP.S.: I know I should probably be hitting the ball at a higher point (I don't think my arm is fully extended at any point) but I feel like I don't have the coordination yet where I can consistently hit the ball at the point where my arm is fully extended. Also I am afraid that I will break something in my room if I were to hit it at full extension as I have a lot of power even if my technique is bad haha.\n\nhttps://reddit.com/link/1gl67ys/video/j4t5zm5axbzd1/player\n\nhttps://reddit.com/link/1gl67ys/video/rqp9om5axbzd1/player\n\nhttps://reddit.com/link/1gl67ys/video/1407nl5axbzd1/player\n\nhttps://reddit.com/link/1gl67ys/video/5qdaxn5axbzd1/player\n\n",
        "author": "Pussy_Pumper__69"
    },
    {
        "title": "Why is my right leg doing that?",
        "score": 16,
        "id": "1gl2w9i",
        "url": "https://www.reddit.com/gallery/1gl2w9i",
        "created_utc": 1730911580.0,
        "num_comments": 22,
        "selftext": "When I spike my right leg always stays behind of my left leg, no matter which angle I hit. Since then, I land sideways instead of straightly facing the net. Sometimes my right leg even gets bent while my left leg doesn’t.\n\nI think both legs should be placed (almost) horizontally, which I also admire cuz it enables my upper body to be fully rotated. But since I am doing that, I only use some of my rotational power and arm strength when I spike. Hitting straight is difficult too. My form doesn’t look good asw.\n\nWhat is causing this and what can I do to fix it?",
        "author": "qkaxhfdnjs"
    },
    {
        "title": "Selling JTEKT Stings vs Osaka Bluteon",
        "score": 1,
        "id": "1gky948",
        "url": "https://www.reddit.com/r/volleyball/comments/1gky948/selling_jtekt_stings_vs_osaka_bluteon/",
        "created_utc": 1730898999.0,
        "num_comments": 6,
        "selftext": "Hii I bought 2 tickets for Sat 16/11 game between JTEKT and Osaka Blueteon at the Asue Arena at Osaka. But my travel plans changed due to visa and issues and im desperate to sell it off 🙏\n\nIf anyone is interested pls dm me or comment.\nI'll transfer the tickets to you via the legitimate SV league App and help you with it.\n\n",
        "author": "No_Web169"
    },
    {
        "title": "Arm swing / form check ",
        "score": 0,
        "id": "1gl0i4f",
        "url": "https://v.redd.it/5bss7wg1qazd1",
        "created_utc": 1730905341.0,
        "num_comments": 5,
        "selftext": "Hi all! First time poster. I’m just looking for advice on what I could do better. A problem I’m having right now is not hitting the ball hard enough and I’m wondering if it’s because of my arm swing. I think I’m doing a high elbow and not cocking back at all. Any suggestions are much appreciated :))",
        "author": "SkeetSkrt101"
    },
    {
        "title": "What’s the difference between PMS and MPS?",
        "score": 0,
        "id": "1gkvbp0",
        "url": "https://www.reddit.com/r/volleyball/comments/1gkvbp0/whats_the_difference_between_pms_and_mps/",
        "created_utc": 1730888309.0,
        "num_comments": 9,
        "selftext": "In open play, I’ve only played PMS.\n\nIn league play, we only do MPS, why is that?\n\nAny advantages to either strategy? ",
        "author": "bcitman"
    },
    {
        "title": "A funny moment during training yesterday ",
        "score": 118,
        "id": "1gkuqmd",
        "url": "https://v.redd.it/6d0wssbt39zd1",
        "created_utc": 1730885722.0,
        "num_comments": 13,
        "selftext": "",
        "author": "kianaidenn"
    },
    {
        "title": "In honor of the guy who received the ball with his face",
        "score": 29,
        "id": "1gkshqp",
        "url": "https://v.redd.it/iplqo6ibb8zd1",
        "created_utc": 1730876105.0,
        "num_comments": 12,
        "selftext": "Being on the opposite end, I felt really bad after the play. I love that the play did not stop in both videos though. My old club coach would have loved it though 😂\n\n(p.s. I’m a setter/middle and not an outside)\n",
        "author": "Sensitive-Dinner9936"
    },
    {
        "title": "A fun 31 that took my friend and I way too many attempts",
        "score": 11,
        "id": "1gks8ze",
        "url": "https://v.redd.it/sm3strgf88zd1",
        "created_utc": 1730875133.0,
        "num_comments": 1,
        "selftext": "(Yes this net is lower than men's height, I think it was co-ed height)",
        "author": "Kaimull"
    },
    {
        "title": "A highlight I made 😄",
        "score": 3,
        "id": "1gkrwm3",
        "url": "https://v.redd.it/ro2od79e48zd1",
        "created_utc": 1730873782.0,
        "num_comments": 2,
        "selftext": "",
        "author": "games0124"
    },
    {
        "title": "Any advice on my spike approach?",
        "score": 134,
        "id": "1gkqcw2",
        "url": "https://v.redd.it/v5082ahvm7zd1",
        "created_utc": 1730867892.0,
        "num_comments": 54,
        "selftext": "I’ve been having problems with consistently hitting the ball over the net when spiking, while I did hit it over in this video it just barely gets over and many times it will hit the net and not go over. I’m not sure if it is my approach, my jump, timing or maybe my height. I’m 5,8 and playing on a senior high net. Any advice would be appreciated!🙏🏼\n\n\n",
        "author": "Ok_University_9974"
    },
    {
        "title": "Is Nishida Yuji Overrated?",
        "score": 40,
        "id": "1gklgmm",
        "url": "https://youtu.be/Oc0GXZmKkrI",
        "created_utc": 1730851752.0,
        "num_comments": 50,
        "selftext": "",
        "author": "GrapeResponsible6005"
    },
    {
        "title": "Training these kiddos today🫶🏼",
        "score": 15,
        "id": "1gkjbue",
        "url": "https://v.redd.it/dem485bgt5zd1",
        "created_utc": 1730845885.0,
        "num_comments": 2,
        "selftext": "",
        "author": "[deleted]"
    },
    {
        "title": "help!!",
        "score": 29,
        "id": "1gkhias",
        "url": "https://v.redd.it/vhbwib1gf5zd1",
        "created_utc": 1730841209.0,
        "num_comments": 8,
        "selftext": "I am practicing my setting which obviously im not that good at yet but tips or drills you recommend would be highly appreciated! I really wanna try setting my sophmore year but itll take practice☺️",
        "author": "Happy-Engineer7432"
    },
    {
        "title": "Help",
        "score": 2,
        "id": "1gkebu4",
        "url": "https://www.reddit.com/r/volleyball/comments/1gkebu4/help/",
        "created_utc": 1730833152.0,
        "num_comments": 9,
        "selftext": "Hey!\nI’m relatively new to playing with rotation. I play in the setter position. I want to learn the basic back and front row rules. I can’t seem to find material that is easy to understand. I would really appreciate it if you people helped me with the following:\n\n1) can a setter in back row come to the net and *jump* set?\n2) can front row players stand behind the 10foot line during serve receive?\n3) when can we switch? When the ball crosses over the net or leaves the server’s hand?\n4) do we rotate clockwise or counter clockwise? ( I had been told both but for each the position of server changed i.e right to left )\n5) can back row setter dump?",
        "author": "shahood1"
    },
    {
        "title": "Why do i feel like i'm getting worse every time i practice",
        "score": 8,
        "id": "1gke31m",
        "url": "https://www.reddit.com/r/volleyball/comments/1gke31m/why_do_i_feel_like_im_getting_worse_every_time_i/",
        "created_utc": 1730832539.0,
        "num_comments": 16,
        "selftext": "I've been practicing every three days of the week, for 2 hours. And every time i feel like i'm getting worsening. I don't know if it's normal. ",
        "author": "floweyes"
    },
    {
        "title": "Got the dig 😭🤕",
        "score": 121,
        "id": "1gkcew3",
        "url": "https://v.redd.it/fqhmmlged4zd1",
        "created_utc": 1730828383.0,
        "num_comments": 7,
        "selftext": "",
        "author": "Eborett1"
    },
    {
        "title": "Game Thread: Women's CEV Champions League - 4th Round (Leg 1)",
        "score": 3,
        "id": "1gkbylf",
        "url": "https://www.reddit.com/r/volleyball/comments/1gkbylf/game_thread_womens_cev_champions_league_4th_round/",
        "created_utc": 1730827253.0,
        "num_comments": 4,
        "selftext": "Matches can be viewed at [https://www.eurovolley.tv/](https://www.eurovolley.tv/) or [https://www.youtube.com/@CEVolleyball/streams](https://www.youtube.com/@CEVolleyball/streams)\n\n# Pool A\n\n|Home|Away|Time|\n|:-|:-|:-|\n|Developres RZESZÓW (POL)|Maritza PLOVDIV (BUL)|06/11/2024 18:00 local time|\n|A. Carraro Imoco CONEGLIANO (ITA)|Mladost ZAGREB (CRO)|07/11/2024 20:30 local time|\n\n# Pool B\n\n|Home|Away|Time|\n|:-|:-|:-|\n|Eczacibasi Dynavit ISTANBUL (TUR)|Tent OBRENOVAC (SRB)|06/11/2024 17:00 local time|\n|LEVALLOIS PARIS Saint Cloud (FRA)|SSC Palmberg SCHWERIN (GER)|06/11/2024 20:00 local time|\n\n# Pool C\n\n|Home|Away|Time|\n|:-|:-|:-|\n|VakifBank ISTANBUL (TUR)|Calcit KAMNIK (SLO)|06/11/2024 19:30 local time|\n|Numia Vero Volley MILANO (ITA)|FC PORTO (POR)|07/11/2024 20:00 local time|\n\n# Pool D\n\n|Home|Away|Time|\n|:-|:-|:-|\n|Neptunes NANTES (FRA)|Vasas Óbuda BUDAPEST (HUN)|05/11/2024 20:00 local time|\n|Fenerbahçe Medicana ISTANBUL (TUR)|PGE Grot Budowlani ŁÓDŹ (POL)|06/11/2024 20:00 local time|\n\n# Pool E\n\n|Home|Away|Time|\n|:-|:-|:-|\n|Savino Del Bene SCANDICCI (ITA)|C.S.O. VOLUNTARI 2005 (ROU)|06/11/2024 19:00 local time|\n|BKS Bostik ZGO BIELSKO-BIAŁA (POL)|Allianz MTV STUTTGART (GER)|07/11/2024 18:00 local time|",
        "author": "Darbitron"
    },
    {
        "title": "Libero highlights❤️ (receiving and digging)",
        "score": 0,
        "id": "1gk9pr3",
        "url": "https://v.redd.it/d5max92at3zd1",
        "created_utc": 1730821612.0,
        "num_comments": 0,
        "selftext": "",
        "author": "[deleted]"
    },
    {
        "title": "Training progress",
        "score": 13,
        "id": "1gk9eqd",
        "url": "https://v.redd.it/4y7ufewxq3zd1",
        "created_utc": 1730820824.0,
        "num_comments": 3,
        "selftext": "Sup guys, just wanted to share a video, still not there yet but this just to show that after a lot of training and feedback (mostly even on reddit posts haha) you do can improve a lot.\n",
        "author": "JustMakiV1"
    },
    {
        "title": "Which Armsleeves does Yuki Ishikawa use?",
        "score": 0,
        "id": "1gk8uxg",
        "url": "https://i.redd.it/20q937ynm3zd1.png",
        "created_utc": 1730819387.0,
        "num_comments": 20,
        "selftext": "",
        "author": "Successful-Plan-7733"
    },
    {
        "title": "I just had my first match today. Need to know more rules. ",
        "score": 10,
        "id": "1gk80xj",
        "url": "https://www.reddit.com/r/volleyball/comments/1gk80xj/i_just_had_my_first_match_today_need_to_know_more/",
        "created_utc": 1730817120.0,
        "num_comments": 17,
        "selftext": "For context I was on the bench for the 1st set as we only had 7 players show up (no libero). I only knew that I couldn't stand near the court, and that if I want to warm up I can do it in the corner.\n\nI go to the toilet in the hall next to the court which would have only taken a few minutes. A team member walks in saying they were looking for me because what I didn't know was that I had to ask permission from the referee to even go to the toilet. As soon as I'm back I got a yellow card. Felt so embarrassed after that and just stayed seated until  they brought me in for the next 2 sets to find my footing.\n\nI tried looking online for any detailed rules on these interactions off the court as well as being on. I know I still have a lot to learn and I want to get better at this. What else do I need to know before I go back? And where can I find somewhere that has everything I could learn from? ",
        "author": "atomic_dalton"
    },
    {
        "title": "Any areas I need to improve on? ",
        "score": 2,
        "id": "1gk4oui",
        "url": "https://v.redd.it/pfrww782l2zd1",
        "created_utc": 1730806739.0,
        "num_comments": 4,
        "selftext": "During the match it felt like I was in the motion and everything felt right but upon watching the footage I did look a little awkward. Should I start even further back for sets like that? \n\nThanks ",
        "author": "Danielepaul"
    },
    {
        "title": "Working on my float serves ",
        "score": 201,
        "id": "1gk1y97",
        "url": "https://v.redd.it/hs7a2c2mk1zd1",
        "created_utc": 1730794510.0,
        "num_comments": 23,
        "selftext": "I just started playing volleyball a couple of months ago, and I’ve been trying to improve on my serves. Please feel free to leave any comments or tips!",
        "author": "tonylogics"
    },
    {
        "title": "Finger tape placements",
        "score": 0,
        "id": "1gjsj59",
        "url": "https://www.reddit.com/r/volleyball/comments/1gjsj59/finger_tape_placements/",
        "created_utc": 1730762733.0,
        "num_comments": 13,
        "selftext": "Where do you guys like to tape for setters specifically? If at all ",
        "author": "dremocak"
    },
    {
        "title": "Latest and Greatest Volleyball Team App Experience - I'm over using Groupme, lol... \\m/",
        "score": 0,
        "id": "1gjr57h",
        "url": "https://www.reddit.com/r/volleyball/comments/1gjr57h/latest_and_greatest_volleyball_team_app/",
        "created_utc": 1730759059.0,
        "num_comments": 7,
        "selftext": "Have been using Groupme, would like to try something else this season - Practice, Tournaments, Polls, Messaging, Photos, etc. - Thanks in advance...",
        "author": "Airzilla7"
    },
    {
        "title": "Haikyuu and Volleyball   https://forms.office.com/Pages/ResponsePage.aspx?id=uFguxql99EGD8zou2CSZrBdhCQkX3B5KpFlwn0cyLJNUQTFNT0ozRFRLSVg2MDZYVEg3TTVOSVhRNS4u",
        "score": 0,
        "id": "1gjp07c",
        "url": "https://www.reddit.com/r/volleyball/comments/1gjp07c/haikyuu_and_volleyball/",
        "created_utc": 1730753743.0,
        "num_comments": 12,
        "selftext": "Hello Guys, I do a school project about Haikyuu and Volleyball. My aim is to find the answer to the Question. How did Volleyball change because of Haikyuu and how many did start with playing Volleyball because of Haikyuu.\n\nIt would be lovely if you can answer my forms even if you didn't watch Haikyuu at all.\n\nWhen you have 5 min to spare, I would appreciate it if you can do the Forms. Thank you a lot &lt;3\n\nI wish everyone a nice evening\n\n[https://forms.office.com/Pages/ResponsePage.aspx?id=uFguxql99EGD8zou2CSZrBdhCQkX3B5KpFlwn0cyLJNUQTFNT0ozRFRLSVg2MDZYVEg3TTVOSVhRNS4u](https://forms.office.com/Pages/ResponsePage.aspx?id=uFguxql99EGD8zou2CSZrBdhCQkX3B5KpFlwn0cyLJNUQTFNT0ozRFRLSVg2MDZYVEg3TTVOSVhRNS4u)",
        "author": "alelollol"
    },
    {
        "title": "Triangle Offense opinions?",
        "score": 7,
        "id": "1gjlerm",
        "url": "https://www.reddit.com/r/volleyball/comments/1gjlerm/triangle_offense_opinions/",
        "created_utc": 1730744942.0,
        "num_comments": 20,
        "selftext": "So, for the story, I coach a u16 boys team which, of my 6 best players, they are: 3 MH, 2 Liberos, and my setter . I feel like the obvious choice of a system is a 3 middle, but I do not really like to stray from a classic 5-1, but by FAR my weakest position is outside, as I am probably going to have to spin one of my liberos as an outside, due to the lack of quality. \n\nThe middles will start in 2, 4 and 6, Setter in 1, and OH1 in 5 and OH2 in 3. Libero pulls my OH2  (he is not a good passer, but is probably my best pin swing) and MB in 6, and I have 2 serviceable players to DS the MBs in 2 and 4.\n\nMy question is how has other's (coaches and players) experiences been running this offense. I do love a 5-1 myself, I just do not feel like sending my boys into their first tournament in a 5-1 is a great idea as I will have at least one weak link in defense/receive and one of my 3 best hitters on the bench, when I could always have 1-2 up front at all times.\n\nAny comments or concerns you have had with the triangle would be appreciated! ",
        "author": "TallinnEst"
    },
    {
        "title": "clarification on rules",
        "score": 4,
        "id": "1gjkfwf",
        "url": "https://www.reddit.com/r/volleyball/comments/1gjkfwf/clarification_on_rules/",
        "created_utc": 1730742605.0,
        "num_comments": 27,
        "selftext": "hi everyone, I'm a new volleyball player and I was wondering if anyone could clarify some rules or things that teams do that I can't seem to find the answer for. I live in Europe so the rules might be a bit different than the US.\n\n\n\n1. if a setter gets first touch, is it automatically assumed that the libero (if present on the court) gets the second? I've seen many teams do this and I was wondering if it was a widely used strategy.\n\n2. if on the first touch the ball went out of bounds on the other side but the team manages to get the ball back over the net with the second touch how does that work? I've seen some instances of this being allowed and this not. (I'm sorry if the description is a little confusing)\n\n3. what are the rules surrounding double touch? I heard that double touch is allowed in the US but what are the official rules world wide?\n\n4. similarly with double touch, are liberos allowed to serve? \n\n  \nthank you!!",
        "author": "syashida"
    },
    {
        "title": "VolleyballWorld shop scammed me.",
        "score": 0,
        "id": "1gji4i7",
        "url": "https://www.reddit.com/r/volleyball/comments/1gji4i7/volleyballworld_shop_scammed_me/",
        "created_utc": 1730737012.0,
        "num_comments": 8,
        "selftext": "I ordered a 2024 Olympic Game Ball V200W back in October 5. I soon contacted them through both directly replying to the Shopify confirmation mail (which I know they WILL receive it by doing this way) and mail to several different address they have listed on the Internet, to cancel the order, which all of my mails are replied by Microsoft Outlook mailing system saying that they are denying my access.\n\nI placed the order at 4.45 PM and contacted them immediately around 5.10 PM same day.\n\nLucky enough, I received thier reply in October 6 from one of the mails I've sent, and the Shopify cancellation at the same day; also another agent replied to my another mail in October 7, so they *definitely* know and agreed that my order has been cancelled.\n\nYet, in October 25, I received a package from them, exactly what I ordered back 20 days ago. I immediately mailed them by replying one of the mail that their agent has sent me, asking how should I mail the package back because since I've cancelled my order and this shouldn't belong to me.\n\nThey replied to me at the same day (Oct 25) asking if the payment has also been cancelled. To my suprise, the payment still listed in my unsettled bills. So I replied to them with this information and hoping them to provide a solution to this situation.\n\nI've got no any reply from them ever since.\n\nEven I have mailed them through different channels multiple times, contacted PayPal (and PayPal demand me to wait for their response, but still nothing from them), they are not still responding to any of my mails to this day.\n\nThis is not that I'm paying for what I received. Not even compulsive consumption. They are using me to compensate their administrative negligence, by not proceeding my cancelled payment, and try to justify either to themselves or any regulatory authority (if I can find any, and sadly they are registered in Switzerland, a country seems lacking of customer protection) that they are changing me in consideration of what I've received but not asked for.\n\nAfter looking up their names on Reddit it seems I'm not the first case. Very vulgarly of their business practices and I'm disgusted by them. I would not recommend making any purchases of item or service from this company.",
        "author": "_amkzi"
    },
    {
        "title": "Teach situational awareness.",
        "score": 0,
        "id": "1gjheca",
        "url": "https://www.reddit.com/r/volleyball/comments/1gjheca/teach_situational_awareness/",
        "created_utc": 1730735257.0,
        "num_comments": 21,
        "selftext": "Hi, so I currently have two problems which are kind of the same but different.\n\nNumber 1: On our club A-Team (We are reasonably good. Semi-Pro level), we are currently trying to improve out our Sideout%, with the goal being about 70% and our current rate being about 50-55. To that end, what needs to improve the most, are recieves, which are just about the worst in the league. Overpasses and aces are way too frequent (4-6 per set!!). As part of that improvement, a suggestion of coach was to fight off the balls about 3-4 meters off the net on a tough serve. This works well and I (setter) get to set a lot more, even out of position. \n\nNow here's the problem: When the ball is far off the net, we do not want to run a normal, middle quick. We run a quick-set where the MB hits between position 3 and 4 (as a lot of teams do)... however, it is extremely difficult to communicate to the MBs (they're young, explosive but not very experienced) that they should run the other play. It comes down to: Ball far off -&gt; run to OH; Ball close -&gt; run to S\n\nThey're simply lacking the awareness to notice these things.\n\n  \nProblem 2: As I also am the coach of a local High-School team, I have to teach a lot of people who never played the game stuff like: get away from the net, after the ball comes over, get close to the net if the other side has it, look where the setter and the recieve is for timing and so on.\n\nIn my experience, the only thing that truly helps is just reps after reps. \n\nSo I'm wondering. Does anyone here have a better idea on how to teach situational awareness?\n\nThx",
        "author": "Kamerad_Kugelmodus"
    },
    {
        "title": "Welcome to our new moderators: u/gr1ffinb and u/Darbitron!!!",
        "score": 59,
        "id": "1gjgvzu",
        "url": "https://www.reddit.com/r/volleyball/comments/1gjgvzu/welcome_to_our_new_moderators_ugr1ffinb_and/",
        "created_utc": 1730733971.0,
        "num_comments": 10,
        "selftext": "/u/Darbitron and /u/gr1ffinb have graciously offered to volunteer their time towards improving the subreddit as moderators.\n\n/u/Darbitron will mostly be focused on posting/making stickies related to professional club volleyball. As the CEV Champions League rolls around, keep an eye peeled for stickies and match threads.\n\n/u/gr1ffinb will be available to police the subreddit and discord channel as well as making posts about NCAA news and tournaments. Hopefully, the subreddit will have fewer posts that go against rule 7 stay up as long as they do now.\n\nI am very excited for our new moderators to begin creating the content the subreddit sorely needs. Please stay tuned for updates!",
        "author": "Fiishman"
    },
    {
        "title": "Lopéz in SV League is the most entertaining thing that could happen this year.",
        "score": 18,
        "id": "1gjg4r9",
        "url": "https://www.reddit.com/r/volleyball/comments/1gjg4r9/lopéz_in_sv_league_is_the_most_entertaining_thing/",
        "created_utc": 1730732049.0,
        "num_comments": 4,
        "selftext": "Like he is so fun to watch. He is so explosive.",
        "author": "majd012"
    },
    {
        "title": "VBTV Issues",
        "score": 5,
        "id": "1gjdbyp",
        "url": "https://i.redd.it/ctvutt6rrvyd1.jpeg",
        "created_utc": 1730724243.0,
        "num_comments": 7,
        "selftext": "Does anyone have an idea why I get this error? I already tried to reinstall the app but after i finished watching a game it comes back the day after.",
        "author": "Alternative-Key2295"
    },
    {
        "title": "How do I hit better?",
        "score": 51,
        "id": "1gjawgw",
        "url": "https://v.redd.it/ee9o8fkb0vyd1",
        "created_utc": 1730715030.0,
        "num_comments": 59,
        "selftext": "Please give me tips for better form &amp; technique to be more consistent with hitting harder and more downwards.",
        "author": "flipr4punz3l"
    },
    {
        "title": "Weekly Short Questions Thread",
        "score": 3,
        "id": "1gjareq",
        "url": "https://www.reddit.com/r/volleyball/comments/1gjareq/weekly_short_questions_thread/",
        "created_utc": 1730714430.0,
        "num_comments": 27,
        "selftext": "Welcome to the Weekly Short Questions Thread! If you've got a quick question that doesn't require you to provide in-depth explanation, post it here! Examples include:\n\n* What is the correct hand shape for setting?\n* My setter called for a \"31\" and I'm looking for advice on to do that.\n* What are the best volleyball shoes on the market for a libero?\n* Is the Vertical Jump Bible any good?\n* I'm looking for suggestions on how to make an impression at tryouts.\n\nQuick questions like these are allowed only in this thread. If they're posted elsewhere, they will be removed and you'll be directed to post here instead. The exceptions to this rule are when asking for feedback **WITH A VIDEO**, or when posting an in-depth question (must be &gt;600 characters). Please create a separate post for these kinds of questions.\n\nIf your question is getting ignored:\n\n* Are you asking a super generic question? Questions like \"How do I play opposite?\" or \"How do I start playing volleyball?\" are not good questions.\n* Has the question you're asking been answered a lot on the sub before? Use the search function.\n* Is the question about your hitting/passing/setting form and you haven't provided a video? It's hard to diagnose issues without seeing your form. Best to get some video and post to the main subreddit.\n\nLet's try to make sure everyone gets an answer. If you're looking to help, sort the comments by \"new\" to find folks who haven't been replied to yet.\n\nIf you want to chat with the community about volleyball related topics or really anything, [join our Discord server!](https://discord.gg/zv3c6xQsAy) There is a lot of good information passed around there and you might get more detailed responses.",
        "author": "AutoModerator"
    },
    {
        "title": "Does practice minimize bad days? ",
        "score": 22,
        "id": "1gj5s82",
        "url": "https://www.reddit.com/r/volleyball/comments/1gj5s82/does_practice_minimize_bad_days/",
        "created_utc": 1730693006.0,
        "num_comments": 18,
        "selftext": "Been playing for roughly 3 months and I’m improving quickly. For reference, I’d say I’m BB right now. I recently just got to playoffs for a beach doubles tourney and the day of playoffs I played the worst I have played in the last 2 months. \n\nI’m not exaggerating when I say you would look at me and think I just started two weeks ago. I’ve consistently been able to keep up with BB-A players before this. \n\nI played 3 games, and despite taking deep breaths, trying to focus, and being positive with myself, I couldn’t shake the weird mental state I was in for 3 whole games. \n\nWe played a team we had beaten before and the score reached 1-10 pretty quickly. I shanked 10 (pretty easy) serve receives in a row… I haven’t even shanked 3 in a row within the last month-ish. \n\nAgain, I want to say I was very positive throughout all 3 games. I was using every mental technique that worked in the past for getting my head right, but none of them were doing the trick this time :( \n\nI understand I need to work both on my mental and get more reps in. I guess my question is, even in a few more months/years when I’ve gotten a ton of reps in, will I still have days where I’m playing like a beginner? Have you? ",
        "author": "Kindofbad-oops"
    },
    {
        "title": "San Jose State volleyball coach denies collusion accusation",
        "score": 23,
        "id": "1gj2iua",
        "url": "https://www.espn.com/college-sports/story/_/id/42157485/san-jose-state-coach-denies-player-colluded-opponent",
        "created_utc": 1730682478.0,
        "num_comments": 29,
        "selftext": "",
        "author": "nosotros_road_sodium"
    },
    {
        "title": "Dead or alive ball?",
        "score": 23,
        "id": "1gig3lb",
        "url": "https://www.reddit.com/r/volleyball/comments/1gig3lb/dead_or_alive_ball/",
        "created_utc": 1730612198.0,
        "num_comments": 10,
        "selftext": "Hi if this happens, is the ball still in play or dead?\n\nOn 3rd touch, I tried to tip, but I got blocked and so we both held the ball at the same time. I let go and the ball drops to my side &amp; I hit it up it up with my wrist. My teammates caught it bc they said it was 4 touches. Was this ball still alive?",
        "author": "flipr4punz3l"
    },
    {
        "title": "Bad coaching?",
        "score": 4,
        "id": "1gikp1s",
        "url": "https://www.reddit.com/r/volleyball/comments/1gikp1s/bad_coaching/",
        "created_utc": 1730633037.0,
        "num_comments": 20,
        "selftext": "Hello. My daughter (HS sophomore) started playing for our small private school 2 seasons ago. There are only 7 other players on her team, most of which have 1-3 more seasons under their belts. There were no tryouts and they actually had to pull 3 middle schoolers up because there were not enough high schoolers that signed up. I know my girl isn't on the same skill level as everyone else. Her overhand is still not perfect. But her setting is amazing. \nHere is where it gets tricky. Her coaches will only play her \n1. If it is a non-competitive game or \n2. If they are 15-20 points ahead.\n\nWhich means she sat on the bench for the last 2 tournaments. (They did play her for a couple minutes when it was 22 vs 7) So out of the 12 hours of games, about 5 minutes total playing time.\nShe tried talking to the coaches multiple times and the answer is always \"maybe next time \" or \"join the winter league and we will play you more\".\nThey also have 2 other players who get minimal time and only switch them for each other. The other players are their own kids and literally are always played. (I generally am scorekeeper so it is not just emotions talking 😉)\nIf they were all perfect players, I would TOTALLY get it. But the amount of errors that happen has gotten worse over the season. Specifically ball not getting over the net when serving and double touching while setting.\nWe did have a sit down because they stopped practicing her at practice for a while as well. They did start up again after we pointed it out. I do appreciate that they saw that issue at least, but the game stuff is still an issue.\nSo, thoughts? Is this normal for coaches? Are there red flags or am I just being overly sensitive? I know it is just from my perspective, but our school is so small that there is no athletic director and minimal/incomplete guidelines so there is not much I can do.",
        "author": "ReasonableTrifle3020"
    },
    {
        "title": "All smiles from Jia de Guzman and still undefeated Denso Airybees after their first five-set victory of the season against Osaka Marvelous in the 2024-25 Japan V.League!",
        "score": 51,
        "id": "1gik10n",
        "url": "https://i.redd.it/1yqfq3otznyd1.jpeg",
        "created_utc": 1730630201.0,
        "num_comments": 1,
        "selftext": "",
        "author": "OneSportsPHL"
    },
    {
        "title": "some clips from open gym, any critiques would be helpful 🙏",
        "score": 2,
        "id": "1gii9t1",
        "url": "https://v.redd.it/pdz0u4uwbnyd1",
        "created_utc": 1730622103.0,
        "num_comments": 10,
        "selftext": "",
        "author": "tun7un"
    },
    {
        "title": "Tried to listen to some of yall from last time but here’s some more setting!!",
        "score": 39,
        "id": "1gi8mxk",
        "url": "https://v.redd.it/sdf822onhkyd1",
        "created_utc": 1730587772.0,
        "num_comments": 8,
        "selftext": "",
        "author": "KarlTheUnipug"
    },
    {
        "title": "Proper transition movement for Right Side Hitter",
        "score": 16,
        "id": "1gi1uoo",
        "url": "https://www.reddit.com/r/volleyball/comments/1gi1uoo/proper_transition_movement_for_right_side_hitter/",
        "created_utc": 1730569120.0,
        "num_comments": 9,
        "selftext": "Hey all! I recently started playing as a right side hitter for my club and I am unsure of how exactly I should transition back to attack after blocking so as to not run into/hinder the setter. Moreover, when I receive a very short tip as a front row player, where should I pass the ball and how to move, again to avoid the setter and make the play as optimal as possible.\n\n[What I have been doing to transition back](https://reddit.com/link/1gi1uoo/video/40crpu6pxiyd1/player)\n\nSo in the video above is what I have been doing to go around the setter. Should the setter be coming from the outside instead or is this indeed the optimal play?\n\n[Where to pass the ball on a short tip? \\(Red, Yellow, Black\\)](https://preview.redd.it/b2fo0fupxiyd1.png?width=2048&amp;format=png&amp;auto=webp&amp;s=3a38ef84c54d68183e16b40ef224ff3752c0fe32)\n\nI am wondering where I should pass the ball on a short tip. Also should the transition still be the same as the video above? Or does it change when I am forced to pass an awkward ball?\n\n  \nThank you all for your feedback, much appreciated!",
        "author": "Loose_Money_3567"
    },
    {
        "title": "Average foot receive",
        "score": 838,
        "id": "1ghvlwb",
        "url": "https://v.redd.it/wd00oxqphhyd1",
        "created_utc": 1730551518.0,
        "num_comments": 19,
        "selftext": "",
        "author": "PM_ME_YOUR_FRESH_NUT"
    },
    {
        "title": "How can I optimize my approach and arm sưing to hit harder and jump higher ",
        "score": 4,
        "id": "1ghuwrh",
        "url": "https://v.redd.it/a211j51uahyd1",
        "created_utc": 1730549058.0,
        "num_comments": 32,
        "selftext": "Any advice is appreciated ( don’t mind the net touch though ). Also can you guys approximate my vert, for reference l, I’m 190 cm tall (6”3’) ( I guess mine is pretty low for a volleyball player)",
        "author": "TheLastPhoenix123"
    },
    {
        "title": "V200W on SALE!",
        "score": 18,
        "id": "1ghtmrp",
        "url": "https://i.redd.it/vn43v6cnvgyd1.jpeg",
        "created_utc": 1730543948.0,
        "num_comments": 8,
        "selftext": "Just wanted to let everyone know that the Mikasa V200W ball is on sale on Amazon for 38.99$ right now!",
        "author": "tonylogics"
    },
    {
        "title": "Can y'all help me with my serves?",
        "score": 36,
        "id": "1ght0w7",
        "url": "https://v.redd.it/haz9xa8pngyd1",
        "created_utc": 1730541276.0,
        "num_comments": 23,
        "selftext": "I started volleyball recently. Where I live there is no volleyball field, so I normally don't try to serve.\nEverytime I serve, the serve goes on the line or out and I don't know what to do with that issue.\nNow that I had the opportunity to try and serve, I did what the video shows and a bit more.\nAny suggestions?",
        "author": "Simply_X_Y_and_Z"
    },
    {
        "title": "illegal activity in volleyball + bloopers, lowlights, and more!",
        "score": 2,
        "id": "1ghk4gx",
        "url": "https://youtu.be/NeB-MnoR09M",
        "created_utc": 1730506852.0,
        "num_comments": 1,
        "selftext": "",
        "author": "AsTheyCollide"
    },
    {
        "title": "College Volleyball’s Spartan Meltdown",
        "score": 14,
        "id": "1ghft2n",
        "url": "https://quillette.com/2024/11/01/college-volleyballs-spartan-meltdown/",
        "created_utc": 1730494872.0,
        "num_comments": 187,
        "selftext": "",
        "author": "lplalpllallpalas"
    },
    {
        "title": "Im so confused at the School Volleyball team.",
        "score": 0,
        "id": "1ghdto6",
        "url": "https://www.reddit.com/r/volleyball/comments/1ghdto6/im_so_confused_at_the_school_volleyball_team/",
        "created_utc": 1730489623.0,
        "num_comments": 11,
        "selftext": "I went to the third and last tryout, and I got asked by the coach, my first and last name, and y homeroom. He said that if you made the team, you would receive a Google Classroom Invite. A day later, no invite. My other friends who got asked by the coach got invited, but I didn't.\n\n  \nEDIT: I checked the list and it said my name on it, however I still didn't get an invite to the Google Classroom. I'll ask the Coach tomorrow.",
        "author": "ScrambledEggs1233"
    },
    {
        "title": "ts soo cooked😭🙏",
        "score": 62,
        "id": "1ghbg9k",
        "url": "https://i.redd.it/26mgphduvbyd1.png",
        "created_utc": 1730483482.0,
        "num_comments": 5,
        "selftext": "",
        "author": "kadijamal"
    },
    {
        "title": "Help/tips needed for opposite hitting",
        "score": 3,
        "id": "1ghb6ig",
        "url": "https://v.redd.it/jdeg7qlqtbyd1",
        "created_utc": 1730482774.0,
        "num_comments": 5,
        "selftext": "I really need tips I haven’t been playing opposite for that long🙏 not sure if it matters but I’m a leftie and 5ft female. ",
        "author": "NixxyNoodle"
    },
    {
        "title": "How to you analyze game clips?",
        "score": 12,
        "id": "1ghb5xy",
        "url": "https://www.reddit.com/r/volleyball/comments/1ghb5xy/how_to_you_analyze_game_clips/",
        "created_utc": 1730482733.0,
        "num_comments": 7,
        "selftext": "Hey!  \nDo you all recording your game? I found video is always a good way to teach and review tactics. But it's really really hard to do any edition on the video and time-consuming. Even if you'd like to draw some line, write some texts on a player, it takes lots of effort.\n\n  \nThat's why I build a website application that allows you to effortlessly put your insight into real game clips with just a few clicks. This really helps young players learning and feeling exciting. It's not an add and it's totally free. I'm in the Harvard Visual Computing Group so it is a study. Just want to share. Feedback, advice and even request would be greatly appreciated!\n\nhttps://reddit.com/link/1ghb5xy/video/hlj3ptlatbyd1/player\n\n[https://sportsbuddy.ai/](https://sportsbuddy.ai/)\n\nIf you'd like to know more about the study, feel free to DM me!",
        "author": "Fit_Engineer9548"
    },
    {
        "title": "Tips for RS/Oppo hitting and blocking",
        "score": 11,
        "id": "1gh9ayo",
        "url": "https://v.redd.it/idmy9i3kfbyd1",
        "created_utc": 1730478003.0,
        "num_comments": 3,
        "selftext": "Here’s some highlights from my last tournament, I would really appreciate any feedback to help me improve (approach, timing, footwork)! If you would like to see more footage lmk.\n\n#90\n5’8”\n7’3” reach\n10’6” max approach touch",
        "author": "Only_Acoustic"
    },
    {
        "title": "I can't get the ball to go where I want it to",
        "score": 0,
        "id": "1gh6pgc",
        "url": "https://v.redd.it/x80uxbomvayd1",
        "created_utc": 1730471308.0,
        "num_comments": 12,
        "selftext": "I don't know what I'm doing wrong, the ball goes EVERYWHERE except where the bottle(little hard to see, it's behind the ramp) is. I think I'm putting slightly more force into an arm over another? I can get it easily by doing a normal set but I'm trying to do a high one since that's what most people prefer and what my teammates are asking. I've spent more than an hour doing this consistently and kept missing, might have got it one or two times. I'm also really scared about doing doubles, my hands feel like they're touching the ball at a different time, but my friends told me it doesn't look like that. Any tips?",
        "author": "Amosgamedevs"
    },
    {
        "title": "any tips on my form and probably on how to hit much harder?",
        "score": 4,
        "id": "1gh5cmz",
        "url": "https://v.redd.it/91q8glzkkayd1",
        "created_utc": 1730467602.0,
        "num_comments": 6,
        "selftext": "",
        "author": "jogoisking"
    },
    {
        "title": "SETTER TIPS",
        "score": 42,
        "id": "1gh3dvv",
        "url": "https://v.redd.it/yjlbnyj62ayd1",
        "created_utc": 1730461416.0,
        "num_comments": 30,
        "selftext": "any tips po to improve as a setter? malapit na itramurals namim 🫠",
        "author": "pfzrmdrna"
    },
    {
        "title": "tips? ",
        "score": 14,
        "id": "1ggtz76",
        "url": "https://v.redd.it/0n7kamvaw6yd1",
        "created_utc": 1730423117.0,
        "num_comments": 26,
        "selftext": "i know i had an awkward position from being so under the ball, i just didnt give myself enough room for approach. otherwise, what else can i improve?",
        "author": "Appropriate_Map_9126"
    },
    {
        "title": "Rule suggestions for mostly boys vs girls volleyball scrimmage.",
        "score": 24,
        "id": "1ggs0v8",
        "url": "https://www.reddit.com/r/volleyball/comments/1ggs0v8/rule_suggestions_for_mostly_boys_vs_girls/",
        "created_utc": 1730417157.0,
        "num_comments": 21,
        "selftext": "Hi all! I coach a middle grades girls volleyball team and were fairly decent. We typically go undefeated in our season. In our school district we have a reputation for being really good. I send most of my girls to very strong high school teams and they typically go varsity as freshman.\n\nBackstory over. Recently a private school reached out to me for a non-league scrimmage which i accepted, but their team is coed with mostly boys. My question is, should i suggest specific rules for this game? I’ve never coached outside of girls vb and am mostly just concerned for their safety. \n\nPlease let me know if there are common rules boys should adhere to in this type of game. The only thing i saw that seemed common was no attacks in front of the attack line.\nThanks!\n\nEdit:\nI’ve done a little bit of research in the meantime and here’s the rules i proposed (could be confusing but this came from USA VB rules):\n\nCoed team must have at least two females on the court playing at all times, more females are allowed but not more than four males.\n\nIf it’s a single contact over the net it must be from a girl, otherwise a female must touch the ball before it goes over.\n\nAny player can block but no back row males can attack.\n\nFINAL EDIT:\nI ended up canceling the game because after learning more about their team, it was very obvious that they were kind of a bomb squad of boys with a few girls to make it coed. He was not willing to adhere to some of my suggestions of coed rules, the biggest one being no attacking on the front row, staggering the rotation, boy, girl, boy, girl, boy, girl, and having at least one girl touch the ball before it comes over on rallies. They are a heavy boy team playing on a women’s net and their boys are anywhere between 5 foot 9 to 5foot 11 so it’s not a risk I want my girls to take. Thanks for all the advice. The other issue is that they at the end of their season with no more games and we are midseason.",
        "author": "beartrapperkeeper"
    },
    {
        "title": "Confused by referee hand signal (NFHS)",
        "score": 1,
        "id": "1ggmxab",
        "url": "https://www.reddit.com/r/volleyball/comments/1ggmxab/confused_by_referee_hand_signal_nfhs/",
        "created_utc": 1730403153.0,
        "num_comments": 1,
        "selftext": "Sorry I don't have a picture, but there was a game where after the point ended the up ref put their palms together with fingers pointed upward and was rubbing them a couple of times vertically? None of us parents in the bleachers knew what they were referring to. Any thoughts?",
        "author": "SBinPNW"
    },
    {
        "title": "How to defend OT's? ",
        "score": 3,
        "id": "1gglr0v",
        "url": "https://www.reddit.com/r/volleyball/comments/1gglr0v/how_to_defend_ots/",
        "created_utc": 1730400094.0,
        "num_comments": 13,
        "selftext": "This question obviously encompasses all types of volleyball formats, but is more specifically geared towards Power Reverse Coed 4's. \n\nI struggle personally with this. And usually I just try to make educated guesses but 90% of the time it's wrong 😭. Any thoughts and suggestions? \n\nSpecifically plays like 2:40 and 4:12 in this video, here. \n\nhttps://youtu.be/L8uJbVZnBSA?si=ldyJ_tYyMaTymuzn\n\n",
        "author": "Sykologee"
    },
    {
        "title": "How much of an advantage does changing starting rotation actually give?",
        "score": 22,
        "id": "1ggkskg",
        "url": "https://www.reddit.com/r/volleyball/comments/1ggkskg/how_much_of_an_advantage_does_changing_starting/",
        "created_utc": 1730397659.0,
        "num_comments": 36,
        "selftext": "Hi, I'm part of the leadership of a college club. I've played relatively high-level volleyball through high school and have followed NCAA and VNL since I started playing 6-7 years ago. I feel that I understand the on-court side of playing pretty well.\n\nCurrently, my team has a fairly incompetent coach. I won't go into details, but I was specifically added to the team's leadership to deal with volleyball operations(planning practices, making rosters, and any strategic ideas). He doesn't really do anything and will constantly choose to blame leadership for decisions he's imposed on us.\n\n  \nAnyway, I feel fine making in-game calls(I did so at NCVF nationals last year), looking for matchups between hitters, and playing around with different blocking schemes. However, I need help deciding whether to mess around with the starting rotation to adapt to different teams. I do think it is a bit more nuanced than a yes or no question and a bit dependent on serving and such, but I also notice that the vast majority of teams at least at the club level chose to always receive in 6 and serve in 1 with no adjustments. \n\n\n\n**TL;DR: How much of an advantage does changing starting rotation actually give?**",
        "author": "PTCourageWasTaken"
    },
    {
        "title": "Just remembered I made this neat little video for my team last year",
        "score": 22,
        "id": "1gghica",
        "url": "https://v.redd.it/eao62add34yd1",
        "created_utc": 1730389167.0,
        "num_comments": 2,
        "selftext": "",
        "author": "AtomDChopper"
    },
    {
        "title": "A Simple and Free Video tool for amateur sport coaches",
        "score": 1,
        "id": "1gggyju",
        "url": "https://www.reddit.com/r/volleyball/comments/1gggyju/a_simple_and_free_video_tool_for_amateur_sport/",
        "created_utc": 1730387768.0,
        "num_comments": 0,
        "selftext": "Hi all! 😊\n\nI’m an amateur coach, and like many of you, I found existing video tools either too pricey or too complex. So, I created Clip2Coach, a simple, free tool for coaches like us.\n\n[www.clip2coach.tube](http://www.clip2coach.tube)\n\n**What it does:**\n\n* **Clip &amp; Edit**: Quickly create video clips from YouTube, Vimeo, or Twitch.\n* **Annotate**: Add notes and drawings for better tactical analysis.\n* **Share**: Send clips via WhatsApp, social media, or email.\n* **Free &amp; Easy**: Simple interface, no credit card needed.\n\nI’d love your feedback! 🙌",
        "author": "PurchaseSpecific9761"
    },
    {
        "title": "Finding sponsors",
        "score": 0,
        "id": "1ggfm6q",
        "url": "https://www.reddit.com/r/volleyball/comments/1ggfm6q/finding_sponsors/",
        "created_utc": 1730384279.0,
        "num_comments": 16,
        "selftext": "So I started playing on a mixed volleyball team, and we’re currently looking for a sponsor for our team T-shirts. We're hoping to keep the costs manageable, hence the sponsor. We've got a fun and committed group of players, and we play in a pretty active club. I haven't played for long yet tho, and figuring stuff out along the way.\n\nI'm reaching out to see if anyone here has experience with finding local sponsors or suggestions on how to pitch the idea. I'm considering anything really, trying to find fun brands aswell that would like to help out, and that would be fun to have on our shirts. \n\n I struggle to find reasons for companies to actually sponsor us, as we can't give much in return, and a logo on our shirts isn't the biggest of deals for them aswell. Most reactions I get are, ''not in our budget'', or ''not open for new sponsorships''.Any tips, insights? :)\n\nDutch team btw.",
        "author": "ThommieZ"
    },
    {
        "title": "Opinions/tips",
        "score": 4,
        "id": "1gg4h6b",
        "url": "https://v.redd.it/ibpgga5380yd1",
        "created_utc": 1730342315.0,
        "num_comments": 2,
        "selftext": "I have been setting for 3/4 months now, any opinions/tips based on this rally? (Could not get a better video sorry) (the person recording was sitting in case you see the video with some weird proportions)",
        "author": "Difficult_Yam_5699"
    },
    {
        "title": "club volleyball 🏐 newbie mom.",
        "score": 9,
        "id": "1gfwpfa",
        "url": "https://www.reddit.com/r/volleyball/comments/1gfwpfa/club_volleyball_newbie_mom/",
        "created_utc": 1730320815.0,
        "num_comments": 22,
        "selftext": "My daughter 11 yo just made the national team for 12U for a club team. I was surprised she even made the team let alone the national team. She said she is interested in playing Vb even into college. The competition is insane. Over 110+ girls trying out for 3 teams. Any advice for me with tournaments or how to support my daughter. ",
        "author": "Suspicious-Meet-1679"
    },
    {
        "title": "creatine and vertical",
        "score": 1,
        "id": "1gfx4pb",
        "url": "https://www.reddit.com/r/volleyball/comments/1gfx4pb/creatine_and_vertical/",
        "created_utc": 1730321917.0,
        "num_comments": 9,
        "selftext": "i’m thinking of supplementing creatine since i’ve been in the gym more often lately and it’s commonplace there, the only thing is that i hear that it causes weight gain due to water retention; for those of you who take creatine, should i be concerned with this ‘weighing me down’ or will the muscle mass i gain outweigh the overall increase in weight?",
        "author": "TenderizedTendons"
    },
    {
        "title": "How to start coaching?",
        "score": 4,
        "id": "1gfwadb",
        "url": "https://www.reddit.com/r/volleyball/comments/1gfwadb/how_to_start_coaching/",
        "created_utc": 1730319723.0,
        "num_comments": 8,
        "selftext": "I’ve played competitively in high school, college and also after work for rec leagues. This was more than 15 years ago. \n\nI want to give back to Vball and want to start coaching. How do I get into it? It seems like most coaches are affiliated with schools. \n\nWhat do clubs look for in coaches?\n",
        "author": "Sea-Recommendation42"
    },
    {
        "title": "Odd Serve Help?",
        "score": 1,
        "id": "1gg1eu9",
        "url": "https://www.reddit.com/r/volleyball/comments/1gg1eu9/odd_serve_help/",
        "created_utc": 1730333236.0,
        "num_comments": 11,
        "selftext": "Is there a underhanded beach serve where you basically serve from the hip and punch the ball with the top of your fist? Sort of upward stabbing motion using the bicep. The ball kinda shoots off the hip. Anyone seen this? Is there a name for it?\n\nI know it's not traditional. But it was how I learned playing beach in the late 90s. I remember a guy who could spin it left right top like this and mixed it in with a float serve. To great effect. \n\nNow my 10yo daughter is playing indoor and I can't find anything even remotely like it on the interwebs. I don't want to teach bad habits but seems like a simple and effective way to underhand serve in rec. \n\nThanks all",
        "author": "CoolHanMatt"
    },
    {
        "title": "Some clips from practice.",
        "score": 204,
        "id": "1gfxm3i",
        "url": "https://v.redd.it/zvqnbb70nyxd1",
        "created_utc": 1730323119.0,
        "num_comments": 96,
        "selftext": "",
        "author": "[deleted]"
    },
    {
        "title": "Does this count as a block?",
        "score": 33,
        "id": "1gfxgy9",
        "url": "https://www.reddit.com/r/volleyball/comments/1gfxgy9/does_this_count_as_a_block/",
        "created_utc": 1730322771.0,
        "num_comments": 39,
        "selftext": "About twice now it's happened at a open gym. Which isn't much but it always caused arguments. We don't have a ref there ever so there's no one final say or what not. Anyway, say one team bumps it over the net, or sets it. and someone goes up to \"block\" it. but instead tries to set it over the net to a specific spot. But, it doesn't go over and instead hits the net. Can he touch it again? both times he has hit the ball up for his team to get the second touch. But no one on the enemy side really attacked the ball. And I don't remember there being anyone on the enemy side close to the net. \n\nPersonally I don't think that counted as a block and he double touched. But I also don't have proof that thats how it is. I was wondering if there was  a rule about this. I can't find anything about this kind of situation. ",
        "author": "Diligent_Regular5347"
    },
    {
        "title": "Underhand serve",
        "score": 0,
        "id": "1gfvytl",
        "url": "https://www.reddit.com/r/volleyball/comments/1gfvytl/underhand_serve/",
        "created_utc": 1730318916.0,
        "num_comments": 2,
        "selftext": "(Reminder: I can understand English, but I found it more comfortable to write it in Spanish, cause it’s my first language. I’ll listen to your suggestions. Thanks!)\n\nActualmente estoy enseñando a los chicos y chicas (entre 11 a 16 años) a jugar al voley a nivel aficionado.\n\nEl problema radica en que una chica (13 años), le cuesta realizar el saque de abajo. No creo que sea falta de técnica, sino por su condición física. Ella no es lo suficientemente atlética, ya que nació con dismetría inferior. Hace poco, exactamente hace 1 año, puso realizar su cirugía, pero seguramente su cuerpo aún no está preparado para actividades físicas.\n\nMe gustaría que ella pueda jugar con sus amigas y subir su confianza. Me pone mal dejarla en la banca o que tenga miedo de tocar el balón.\n\nEscucho sugerencias o ejercicios. Gracias de antemano.",
        "author": "SprayAccomplished736"
    },
    {
        "title": "Favorite College Volleyball NIL Deals This Season?",
        "score": 0,
        "id": "1gfmwqq",
        "url": "https://www.reddit.com/r/volleyball/comments/1gfmwqq/favorite_college_volleyball_nil_deals_this_season/",
        "created_utc": 1730295988.0,
        "num_comments": 1,
        "selftext": "Thought this might be a fun discussion.\n\nI am interested in this topic as related to USA collegiate volleyball players. I am not as familiar with their deals as opposed to college football player deals, but I’m sure some players at colleges like Nebraska can still get some good deals.\n\nWhat are some of the NIL deals/ads/marketing that you have seen from players this season that you enjoy? \n\nThanks for indulging with me. 😊",
        "author": "DrWhit65"
    },
    {
        "title": "Mikasa dupe",
        "score": 0,
        "id": "1gfpp3v",
        "url": "https://www.reddit.com/r/volleyball/comments/1gfpp3v/mikasa_dupe/",
        "created_utc": 1730303211.0,
        "num_comments": 7,
        "selftext": "I’m looking to find a good Mikasa dupe since I’m still a beginner and am not looking to spend nearly 80 usd on a ball but I don’t know where to find any. I tried practicing with cheap dollar store beach volleyballs but the best one lived for two weeks and after that my dad just got tired of me and told me if I wanted another ball it’s coming out of my pocket. I’m thinking of buying one off of Trendyol that looks exactly like the Mikasa but I’m scared that it’s not surviving more than 2 weeks.\nWhat should I get?\nTrendyol ball link 👉\nhttps://ty.gl/o2okt2k6ikx54",
        "author": "Sensitive-Tea-2633"
    },
    {
        "title": "V-league tickets for Nov 3rd near Tokyo",
        "score": 1,
        "id": "1gfms7j",
        "url": "https://www.reddit.com/r/volleyball/comments/1gfms7j/vleague_tickets_for_nov_3rd_near_tokyo/",
        "created_utc": 1730295633.0,
        "num_comments": 1,
        "selftext": "Hello \n\nVB fan Tourist in Japan. Can anybody tell me how I could get tickets for a v-league (man or woman) for Nov 3rd game Near Tokyo (to a site accessible by public transport station). Not able to read Japanese, so site or contact has to be in English. Thanks ",
        "author": "Real-Major-9102"
    },
    {
        "title": "JULES SAMONTE JOINS CHERY TIGGO IN THE 2024-25 PVL SEASON",
        "score": 9,
        "id": "1gfi6qj",
        "url": "https://i.redd.it/n53vcvpozuxd1.png",
        "created_utc": 1730279078.0,
        "num_comments": 1,
        "selftext": "",
        "author": "OneSportsPHL"
    },
    {
        "title": "Oregon OSAA 2A volleyball State Tournament 2024",
        "score": 2,
        "id": "1gfe5kj",
        "url": "https://www.reddit.com/r/volleyball/comments/1gfe5kj/oregon_osaa_2a_volleyball_state_tournament_2024/",
        "created_utc": 1730261224.0,
        "num_comments": 5,
        "selftext": "In an unfortunate twist of fate the three best teams in this years tournament at Redmond High School are all on the same side of the bracket.  Portland Christian, last years 2a state champions will likely face off in round one against the winner of tomorrows Salem Academy vs Western Christian match.  Salem Academy features the #1 player in 2a in Emma Brewer while Western Christian features the Tri-towers in the Herber sisters.  Clastskanie, the powerful #2 team from the Northwest League has a solid chance to play its way into the championship match based upon its bracket position with only #1 Crosshill Christian standing in its way.  Chrosshill Christian  though rated #1 has losses to both Western and Salem Academy and its schedule has been less then stellar. It's unfortunate that the OSAA is still using the two games at once format for the semifinals when the level of play certainly demands the full attention of the fans for each game and the girls deserve better. Portland Christian returns all the key players from the 2023 championship team but they did face a late season loss to rival Clatskanie.  Following in the tradition of Portland Christian Olympic gold medalist, Kim Hill, there are players in 2a who have decided to remain loyal to their small school environment when they are demonstrating skills that could take them to the best of 6a volleyball.  Look forward to some highly competitive five set matches coming soon to Redmond.",
        "author": "SignificantMud3190"
    },
    {
        "title": "Fragile shoulders",
        "score": 18,
        "id": "1gf764n",
        "url": "https://www.reddit.com/r/volleyball/comments/1gf764n/fragile_shoulders/",
        "created_utc": 1730240294.0,
        "num_comments": 17,
        "selftext": "Hey there, as a somewhat(?) older player in his 30s, I need up to half an hour of warming up to be able to hit hard. Two things about this:\n\n  * I don't always have the time for a full warm-up. Currently, after general things like jogging or arm circles, I just hit the ball against a wall for around 15-20 minutes until my shoulders are no longer tweaky\n  *  I'm not sure how to get warm/keep it warm without a ball, so on game days if there are technical issues or I'm benched for a set for whatever reason and my shoulders get cold, I'm out for the rest of the game\n\nAny exercises you recommend that could get me ready in a faster/more efficient manner or something I could do while on the bench? Out of court the thing that helped me the most was just doing delt/rotator cuff exercises. I'm hoping my shoulder health will naturally improve as I get stronger. Last year I wasn't able to go all out without my shoulder hurting even with extensive warm-ups, so my current state is a definite improvement.",
        "author": "triplenoped"
    },
    {
        "title": "A few volleyball photos from a recent HS regional tournament. Sony A7RIV 28mm, 85mm, 105mm",
        "score": 107,
        "id": "1gf6qf4",
        "url": "https://www.reddit.com/gallery/1gf6qf4",
        "created_utc": 1730239140.0,
        "num_comments": 10,
        "selftext": "",
        "author": "a53mp"
    },
    {
        "title": "Is it me or is this net not very tight? (ball hit the net). Someone in a photography group posted this and I asked why the net was so loose and everyone is replying like it's a normal net hit, but I can't imagine that's normal on a tight net.. at least I've never seen that in my 30 years of playing",
        "score": 100,
        "id": "1gf6asn",
        "url": "https://i.redd.it/1bnuc8tklrxd1.png",
        "created_utc": 1730237979.0,
        "num_comments": 22,
        "selftext": "",
        "author": "a53mp"
    },
    {
        "title": "Renting a facility",
        "score": 0,
        "id": "1gezn89",
        "url": "https://www.reddit.com/r/volleyball/comments/1gezn89/renting_a_facility/",
        "created_utc": 1730221396.0,
        "num_comments": 7,
        "selftext": "How to find like minded people to rent a facility with for a few hours a week to train? \nIt’s a bit too expensive to pay for it by myself plus you need others to properly train. \nWhere do I find people/opponent team to train and share the facility rent with?\n\nThis is in US",
        "author": "chpokchpok"
    },
    {
        "title": "Is this a 11'/335cm touch?",
        "score": 58,
        "id": "1gepfiu",
        "url": "https://i.redd.it/8ya7emjsknxd1.jpeg",
        "created_utc": 1730189201.0,
        "num_comments": 27,
        "selftext": "Hello, I don't really have a good way to measure my vert and I was wondering If I touched 11' on that jump. For reference my palm is about 7,5in/19cm long. I wanted to ask someone else, cause i believe I'm a bit biased myself. Thanks",
        "author": "taube_original"
    },
    {
        "title": "Here’s is my defense from my first indoor tourney ",
        "score": 61,
        "id": "1geomnw",
        "url": "https://v.redd.it/3vs1fm4g9nxd1",
        "created_utc": 1730185398.0,
        "num_comments": 5,
        "selftext": "",
        "author": "[deleted]"
    },
    {
        "title": "What to work on as an OH? (5'10, 10'1 max reach)",
        "score": 1,
        "id": "1geo7b7",
        "url": "https://www.reddit.com/r/volleyball/comments/1geo7b7/what_to_work_on_as_an_oh_510_101_max_reach/",
        "created_utc": 1730183387.0,
        "num_comments": 7,
        "selftext": "[https://www.youtube.com/watch?v=QEx4lmtmlcA](https://www.youtube.com/watch?v=QEx4lmtmlcA)\n\nIm the guy in the red/pink shirt, some specific timestamps for when I screw up/score: 7:25 (hit out), 9:08 (barely out), 11:22 (off the block, dug), 12:27 (nice kill), 15:31 (off the block, out), 26:45 (oos swing), 28:56 (kill, couldve swung a little harder here), 38:25 (oos, mis-hit), 38:54 (set was pretty in, didn't expect blocker to peel off), 41:27 (got a little lucky with the waterfall), 45:15 (whaled it out), 45:54\n\nWould like any tips in general but would also like tips on improving power, approach, and swinging at steeper angles specifically.",
        "author": "Which-Firefighter-87"
    },
    {
        "title": "Getting A wade shoe",
        "score": 17,
        "id": "1geno5e",
        "url": "https://i.redd.it/jnia832iwmxd1.jpeg",
        "created_utc": 1730181030.0,
        "num_comments": 8,
        "selftext": "Hey so I'm getting this shoe, because my all city 12s having been quite uncomfortable for my feet overall and in addition theres like there's a lot of space on the toebox, imma just show u the shoe and see what you guys think, its the shadow 6.",
        "author": "Purple-Ad-1585"
    },
    {
        "title": "Question about shoulder bursitis",
        "score": 2,
        "id": "1gei8h6",
        "url": "https://www.reddit.com/r/volleyball/comments/1gei8h6/question_about_shoulder_bursitis/",
        "created_utc": 1730162895.0,
        "num_comments": 1,
        "selftext": "Hello everyone, I need some feedback regarding players who have experienced shoulder bursitis.\n\nFor some context, I started playing volleyball four years ago. Last year, I went from two medium-intensity training sessions to three high-intensity ones, without being in good enough physical shape. As a result, I got injured and ended up with shoulder bursitis. My training sessions were on three consecutive days, as I couldn't organize them differently due to my work obligations.\nI am fully aware that I should have prepared myself better physically before training at that level of intensity. However, I was going through a tough time, and volleyball became the activity that helped me the most to regain mental and physical balance.\n\nFor the past two months, I’ve been following a rehab program with a physiotherapist, reduced my training frequency, and now play at low intensity.\nI feel like I’m gradually gaining strength, and the pain is slowly decreasing, but it still persists.\n\nSince I play as a setter, setting and blocking don't cause any pain.\nHowever, attacking and serving do. I also often experience pain when I have to react quickly in unexpected situations, such as reacting to a dump. In daily life, I sometimes feel pain when I stretch or raise my arm too quickly.\n\nI’m not necessarily looking for recovery advice, but I'd like to hear your experiences regarding how long it took for the pain to disappear.\nOr more specifically, how did you adjust your training routines? Did you change anything? My physiotherapist is very competent, but I’d really appreciate feedback from experienced players who have been through the same situation.\n\nI know I need to stop when the pain becomes too intense, but I also understand that completely stopping isn’t good either, as the joint and body could become too deconditioned. I’ve tried adapting my activity to be less demanding. And whenever I feel too much pain, I switch to setting only (in practice, we play all positions for the first part or do drills, followed by a half-hour match at the end).\n\nI think I currently have a lot of apprehension when preparing to attack, and I find it difficult to relax my shoulder.\nHow long did your rehab take, if you’ve had this injury? And how long did it take before you regained explosiveness in your attacking motion? I know that bursitis, while not necessarily severe since I'm being properly treated, is frustrating because the recovery period can be long.\n\nDo you have any tips or advice on how you approached your training sessions? What changes did you make during the recovery period? If not, do you have any Intel that could benefit me ?\nRight now, I’m focusing on muscle strengthening and trying to correct my attacking technique, as I had a habit of not pulling my arm back enough and attacking too much from the side. I often found myself under the ball during attacks.\n\nThanks in advance!\n\n",
        "author": "Bibthebob"
    },
    {
        "title": "Toe socks?",
        "score": 1,
        "id": "1ge1dyv",
        "url": "https://www.reddit.com/r/volleyball/comments/1ge1dyv/toe_socks/",
        "created_utc": 1730120361.0,
        "num_comments": 2,
        "selftext": "Has anyone used toe socks for volleyball, and if so, what brands would you recommend? Would injinji (the one that runners all recommend) still be good?",
        "author": "Definitely_Not_A_Lie"
    },
    {
        "title": "U13 club. ",
        "score": 5,
        "id": "1gegtg5",
        "url": "https://www.reddit.com/r/volleyball/comments/1gegtg5/u13_club/",
        "created_utc": 1730158957.0,
        "num_comments": 15,
        "selftext": "TLDR: The classic question - Sit with a good team or start with ok team.  Is it really that rude to ask when you are paying for it?\n\nU13 club tryouts are coming soon.  It is a large club so usually there are at least 6-7 teams per age group from U10 through U14. Goes from National 1 and 2 to further down in skill level.  My kid has been playing for the last 3 years in Rec, open gyms, clinics and “pre club” style camps.  She proudly made her school team out of 55 players but was on the bench.  She was a “good player with a nice serve” ,  coaches words but she’s short and they took 4 girls to be Libero’s/defensive specialists.  The team had 15 girls total but that’s a different story.\n\nThe kid got feedback from the coach, played her heart out in practice and did what what she told but she couldn’t break into the top spots so got limited playing time.  To be fair the other kids were good too.  It was a big blow to her to sit like that and going into club I want her to play and not sit. Lessons were learned about sitting and not playing but supporting your team early in her rec career(crazy coaches) so that wasn’t what we were going for.\n\nI know some people think it’s madness to ask but since my club has so many kids/teams anyways can’t I just be straight with the coaches and tell them “I don’t care what team she’s on I just want her to be playing.”  To everyone that going to ask that’s what she wants too.  I don’t think local Rec is a good fit anymore as the kids there are total beginners.\n\nIs taking your lumps on the bench really how club ball has to be?  I just want a honest review and placement.  If she’s not good enough to start that’s ok too.  I would rethink the whole club ball journey.\n\nEdit: TLDR: I asked and the kid is starting the 2nd national team instead of bench on 1st team.\n\n\nIt worked itself out naturally.  I was approached by the National 1 coach who offered a spot day 1 of a 2 day tryout.  I asked where on the roster and was told 10-11.  We had an open, honest conversation about what mine and my kids wishes were and she killed it the second day and was offered a starting spot on National 2 team.  ",
        "author": "Danger-"
    },
    {
        "title": "Semi Pro Team - Donations and Sponsors?",
        "score": 1,
        "id": "1ge9n0a",
        "url": "https://www.reddit.com/r/volleyball/comments/1ge9n0a/semi_pro_team_donations_and_sponsors/",
        "created_utc": 1730140788.0,
        "num_comments": 1,
        "selftext": "I tried searching for this, but none of the keywords I used gave me anything. I'm helping with a very new Semi Pro Men's Team that is trying to navigate sponsorship/donations. Does a semi pro team have to have a certain status to recieve donations or sponsorship?\n\nI've looked into becoming a non-profit and I don't think that's a good option. The team is ran entirely by volunteers (with limited budget) and it seems like they'd have to navigate the legal side without someone that knows the law and requirements.",
        "author": "Xander976"
    },
    {
        "title": "Creative Ways to Practice Hitting in a Small Apartment?",
        "score": 3,
        "id": "1gefw4g",
        "url": "https://www.reddit.com/r/volleyball/comments/1gefw4g/creative_ways_to_practice_hitting_in_a_small/",
        "created_utc": 1730156461.0,
        "num_comments": 14,
        "selftext": "Hey everyone,\n\nI live in a small studio apartment and am looking for some creative ways to work on my hitting without leaving home. I know a few spots nearby where I can practice against walls, but I’m hoping to find ways to improve my hitting right in my apartment.\n\nI’ve heard of someone hitting against their couch, but I’m curious if anyone else has found unique methods or drills to practice hitting in a small space. I already do some setting drills, but I want to incorporate hitting as well.\n\nAny tips or creative ideas would be much appreciated!\n\nThanks!",
        "author": "stvwxyz"
    }
]