[
    {
        "title": "Old Montreal fire: Two men, 18 and 20, arrested in connection with deadly Oct. 4 blaze",
        "publication_date": "Published Oct 11, 2024",
        "author": " Jacob Serebrin, Leora Schertzer ",
        "blurb": "Old Montreal fire: Two men, 18 and 20, arrested in connection with deadly Oct. 4 blazeThe five-alarm fire took the lives of French tourists Léonor Geraudie, 43, and her seven-year-old daughter, Vérane Reynaud-Geraudie.Author of the article: Jacob Serebrin, Leora Schertzer   •   Montreal GazettePublished Oct 11, 2024  •  Last updated 5 hours ago  •  3 minute read  Join the conversation  You can save this article by registering for free here. Or sign-in if you have an account."
    },
    {
        "title": "Public security minister says he's reassured after police meeting on youth crime",
        "publication_date": "Published Oct 10, 2024",
        "author": " Jacob Serebrin, René Bruemmer ",
        "blurb": "Public security minister says he's reassured after police meeting on youth crimeChildren as young as 12 are recruited into street gangs to aid with such crimes as firebombings and shootings related to extortion, police say.Author of the article: Jacob Serebrin, René Bruemmer   •   Montreal GazettePublished Oct 10, 2024  •  Last updated 8 hours ago  •  5 minute read  Join the conversation  You can save this article by registering for free here. Or sign-in if you have an account."
    },
    {
        "title": "Longueuil woman arrested again after Black child, 10, scalded with boiling water",
        "publication_date": "Published Oct 11, 2024",
        "author": " Paul Cherry ",
        "blurb": "Longueuil woman arrested again after Black child, 10, scalded with boiling waterThe re-arrest of Stéphanie Borel, 46, comes after complaints from a lobby group that fights racism and discrimination.Author of the article: Paul Cherry   •   Montreal GazettePublished Oct 11, 2024  •  Last updated 4 hours ago  •  2 minute read  Join the conversation  You can save this article by registering for free here. Or sign-in if you have an account."
    },
    {
        "title": "Analysis: One year later, Quebec's anglophone universities still seek ‘respect’ from CAQ",
        "publication_date": "Published Oct 11, 2024",
        "author": " Andy Riga ",
        "blurb": "Analysis: One year later, Quebec's anglophone universities still seek ‘respect’ from CAQThe principal of Bishop's University says he was \"surprised and dismayed\" by a Coalition Avenir Québec minister's claim this week that English-language universities \"exaggerated\" the impact of last year's tuition overhaul.Author of the article: Andy Riga Published Oct 11, 2024  •  Last updated 10 hours ago  •  6 minute read  Join the conversation  You can save this article by registering for free here. Or sign-in if you have an account."
    },
    {
        "title": "Quebec mulls prioritizing access to family doctors to those in poor health: report",
        "publication_date": "Published Oct 11, 2024",
        "author": " Montreal Gazette ",
        "blurb": "Quebec mulls prioritizing access to family doctors to those in poor health: reportOnly those patients deemed \"vulnerable\" would be assigned to a GP.Author of the article: Montreal Gazette Published Oct 11, 2024  •  Last updated 10 hours ago  •  1 minute read  Join the conversation  You can save this article by registering for free here. Or sign-in if you have an account."
    }
]